xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
#include "stm32f10x.h"
#include "Delay.h"
#include "RA8806_CTRL.h"
#include "Ex_Var.h"
#include "string.h"
#include "time.h"
#include "ds1302_op.h"
#include "at24c64_op.h"
#include "TIME_OP.h"
#include "traffic_param.h"
#include "LED_OP.h"
#include "stdlib.h"

#define MOVE 0

#define SET_RS 		GPIO_SetBits(LCDPort, RS)
#define RESET_RS 	GPIO_ResetBits(LCDPort, RS)
#define SET_CS 		GPIO_SetBits(LCDPort, CS)
#define RESET_CS 	GPIO_ResetBits(LCDPort, CS)
#define SET_WR 		GPIO_SetBits(LCDPort, WR)
#define RESET_WR 	GPIO_ResetBits(LCDPort, WR)
#define SET_RD 		GPIO_SetBits(LCDPort, RD)
#define RESET_RD 	GPIO_ResetBits(LCDPort, RD)
#define SET_RST 	GPIO_SetBits(LCDPort, RST)
#define RESET_RST 	GPIO_ResetBits(LCDPort, RST)

const uint8_t Night_Icon[32] = {0x00, 0x00, 0x21, 0x22, 0x34, 0x32, 0x39, 0x38, 0x1C, 0x1E, 0x0F, 0x07, 0x03, 0x00, 0x00, 0x00, \
								0x00, 0x00, 0x00, 0x80, 0x40, 0x80, 0x10, 0x28, 0x44, 0x28, 0x10, 0xC0, 0xF0, 0xFC, 0x00, 0x00};
const uint8_t Manual_Icon[32] = {0x00, 0x02, 0x05, 0x05, 0x05, 0x05, 0x05, 0x35, 0x2D, 0x2C, 0x24, 0x10, 0x08, 0x04, 0x04, 0x00, \
								 0x00, 0x00, 0x00, 0x00, 0x80, 0x60, 0x50, 0x58, 0x54, 0x04, 0x04, 0x08, 0x08, 0x30, 0x20, 0x00};
								 
const uint8_t Number_Table[10] = {'0','1','2','3','4','5','6','7','8','9'};
const uint8_t* Weekday_Table[11] = {"日", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十"};
const uint8_t* Tick_Cross_Table[2] = {"×", "√"};
const uint8_t* LedColor_Table[3] = {"绿", "红", "黄"};

const uint8_t Func_Run_PeriodPhase_Place[2][2] = {{18, 120}, {18, 138}};
const uint8_t Func_RTCDate_Place[12][2] = {{9, 120}, {10, 120}, {12, 120}, {13, 120}, {15, 120}, {16, 120}, {9, 150}, {10, 150}, {12, 150}, {13, 150}, {15, 150}, {16, 150}};
const uint8_t Func_DayNight_Place[6][2] = {{10, 130}, {11, 130}, {13, 130}, {14, 130}, {16, 130}, {17, 130}};
const uint8_t Func_LedGPIO_Place[17][2] = {{6, 75}, {11, 111}, {11, 129}, {11, 147}, {11, 165}, {11, 183}, {11, 201}, {16, 111}, {16, 129}, {16, 147}, {16, 165}, {21, 111}, {21, 129}, {21, 147}, {21, 165}, {21, 183}, {21, 201}};
const uint8_t Func_SetFlash_Place[17][2] = {{11, 111}, {11, 129}, {11, 147}, {11, 165}, {11, 183}, {11, 201}, {16, 111}, {16, 129}, {16, 147}, {16, 165}, {21, 111}, {21, 129}, {21, 147}, {21, 165}, {21, 183}, {21, 201}, {7, 75}};
const uint8_t Func_PhaseInfo_Place[7][2] = {{8, 126}, {18, 126}, {8, 146}, {18, 146}, {8, 166}, {18, 166}, {15, 186}};
const uint8_t Func_AddPhase_Place[4][2] = {{11, 150}, {22, 150}, {4, 180}, {16, 180}};
const uint8_t Func_SetPeriodOfTime_Place[4][2] = {{18, 100}, {11, 120}, {14, 120}, {17, 120}};
/*
typedef enum{
	lcdapp_ready = 0x00U,
	lcdapp_saved,
	lcdapp_notsaved,
	lcdapp_error,
	lcdapp_wait,
	lcdapp_locked,
	lcdapp_unlocked,
	lcdapp_cmd,
	lcdapp_return,
	lcdapp_codeerror,
	lcdapp_auto
}lcd_appstate;
*/
void LCD_WaitForIDLE_Low(void)
{
	//直接读取BUSY电平并等待系统闲置
	while(GPIO_ReadInputDataBit(LCDPort, BUSY)==(uint8_t)Bit_RESET);
}

//选择使用忙信号为高电平
void LCD_WaitForIDLE_High(void)
{
	while(GPIO_ReadInputDataBit(LCDPort, BUSY)==(uint8_t)Bit_SET);	
}

//状态寄存器没有地址，直接对LCD进行读操作
uint8_t LCD_ReadSTATUSReg(void)
{
	uint8_t rtn;
	GPIO_InitTypeDef GPIO_InitStructure;

	GPIO_InitStructure.GPIO_Pin = DB;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(LCDPort, &GPIO_InitStructure);

//TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);
//RTC_ITConfig(RTC_IT_ALR | RTC_IT_SEC, DISABLE);

	GPIO_ResetBits(LCDPort, CS);
	GPIO_SetBits(LCDPort, RS);
	GPIO_SetBits(LCDPort, WR | RD);
	GPIO_ResetBits(LCDPort, RD);
	//delay_100ns(2);
	rtn = (uint8_t)(GPIO_ReadInputData(LCDPort)&0x00FF);
	GPIO_SetBits(LCDPort, RD);
	GPIO_SetBits(LCDPort, CS);

//TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
//RTC_ITConfig(RTC_IT_ALR | RTC_IT_SEC, ENABLE);

	GPIO_InitStructure.GPIO_Pin = DB;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(LCDPort, &GPIO_InitStructure);

	return rtn;
}

uint8_t LCD_ReadData(void)
{
	uint8_t rtn;
	GPIO_InitTypeDef GPIO_InitStructure;

	BUSY_CheckForLow;
//	while((LCD_ReadSTATUSReg()&0x80)!=0x00);
	
	GPIO_InitStructure.GPIO_Pin = DB;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(LCDPort, &GPIO_InitStructure);

//TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);
//RTC_ITConfig(RTC_IT_ALR | RTC_IT_SEC, DISABLE);

	GPIO_SetBits(LCDPort, WR | RD);
	GPIO_ResetBits(LCDPort, CS);
	GPIO_ResetBits(LCDPort, RS);
	
	GPIO_ResetBits(LCDPort, RD);
	//delay_100ns(2);
	rtn = (uint8_t)(GPIO_ReadInputData(LCDPort)&0x00FF);
	GPIO_SetBits(LCDPort, RD);
	GPIO_SetBits(LCDPort, CS);

//TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
//RTC_ITConfig(RTC_IT_ALR | RTC_IT_SEC, ENABLE);

	GPIO_InitStructure.GPIO_Pin = DB;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(LCDPort, &GPIO_InitStructure);
	
	return rtn;
}

void LCD_WriteData(uint8_t data)
{
	BUSY_CheckForLow;
//	while((LCD_ReadSTATUSReg()&0x80)!=0x00);

//TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);
//RTC_ITConfig(RTC_IT_ALR | RTC_IT_SEC, DISABLE);
	GPIO_SetBits(LCDPort, WR | RD);
	GPIO_Write(LCDPort, (GPIO_ReadOutputData(LCDPort)&0xFF00|data));
	GPIO_ResetBits(LCDPort, CS);	  //使能控制芯片
	//GPIO_SetBits(LCDPort, WR | RD);	  //屏蔽读写操作
	GPIO_ResetBits(LCDPort, RS);	  //选择数据
	GPIO_ResetBits(LCDPort, WR);	  //选择写入
	
	//GPIO_Write(LCDPort, (GPIO_ReadOutputData(LCDPort)&0xFF00|data));   //准备写入的数据内容

	//delay_100ns(2);
	
	GPIO_SetBits(LCDPort, WR);		  //屏蔽写操作
	GPIO_SetBits(LCDPort, CS);		  //失能控制芯片
	//delay_100ns(5);

//TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
//RTC_ITConfig(RTC_IT_ALR | RTC_IT_SEC, ENABLE);
}

void LCD_WriteCommand(uint8_t cmd)
{
	BUSY_CheckForLow;
//	while((LCD_ReadSTATUSReg()&0x80)!=0x00);

//TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);
//RTC_ITConfig(RTC_IT_ALR | RTC_IT_SEC, DISABLE);
	GPIO_SetBits(LCDPort, WR | RD);
	GPIO_Write(LCDPort, (GPIO_ReadOutputData(LCDPort)&0xFF00|cmd));
	GPIO_ResetBits(LCDPort, CS);	  //使能控制芯片
	
	//GPIO_SetBits(LCDPort, WR | RD);	  //屏蔽读写操作
	GPIO_SetBits(LCDPort, RS);	  //选择命令
	GPIO_ResetBits(LCDPort, WR);	  //使能控制芯片
	//GPIO_Write(LCDPort, (GPIO_ReadOutputData(LCDPort)&0xFF00|cmd));   //准备写入的数据内容
	
	//delay_100ns(2);					  //数据保持
	GPIO_SetBits(LCDPort, WR);		  //屏蔽写操作
	GPIO_SetBits(LCDPort, CS);		  //失能控制芯片
	//delay_100ns(5);

//TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
//RTC_ITConfig(RTC_IT_ALR | RTC_IT_SEC, ENABLE);
}

void LCD_Reset(void)
{
	GPIO_ResetBits(LCDPort, CS);
	GPIO_SetBits(LCDPort, WR | RD);
	GPIO_ResetBits(LCDPort, RST);
	delay_us(15000);
	GPIO_SetBits(LCDPort, RST);
	GPIO_SetBits(LCDPort, CS);
}

//被调用
//对某一寄存器进行读写操作时，先以写命令方式写入寄存器地址，再以读数据/写数据方式写入相应内容
uint8_t LCD_ReadREG(uint8_t RegAddr)
{
	uint8_t rtn;
	uint8_t lcd_flag_temp;
	
	lcd_flag_temp = LCD_FLAG_Using;	

LCD_FLAG_Using = 1;

	LCD_WriteCommand(RegAddr);
	rtn = LCD_ReadData();

