xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	
	return rtn;	
}

//被调用
void LCD_WriteREG(uint8_t RegAddr, uint8_t data)
{
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;

	LCD_WriteCommand(RegAddr);
	LCD_WriteData(data);

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}

//被调用
void LCD_Inv(void)
{
	LCD_WriteREG(WCCR, LCD_ReadREG(WCCR) | Inverse_Bit_Order);
}

//被调用
void LCD_NoInv(void)
{
	LCD_WriteREG(WCCR, LCD_ReadREG(WCCR) & (~Inverse_Bit_Order));
	delay_100ns(1);
}
//在文本方式下，无法使用消除雪花模式，在图形模式下可以用
/*
void LCD_EliminateFlickerON(void)
{
	LCD_WriteREG(MISC, LCD_ReadREG(MISC) | Eliminating_Flicker_ON);
}
*/

//被调用
void LCD_EliminateFlickerOFF(void)
{
	LCD_WriteREG(MISC, LCD_ReadREG(MISC) & (~Eliminating_Flicker_ON));
}

//被调用
void LCD_ResetBuffers(void)	 //不影响DDRAM内容
{
	LCD_WriteREG(WLCR, Software_Reset);
	delay_us(10);
	BUSY_CheckForHigh;
	LCD_WriteREG(WLCR, LCD_ReadREG(WLCR)&(~Software_Reset));
}

//被调用
void LCD_TextHybridMode(void)
{
	LCD_EliminateFlickerOFF();
	LCD_WriteREG(WLCR, LCD_ReadREG(WLCR)|Text_Mode_Selection);
	CN_EN_HybridDisplay;
}

//被调用
void LCD_TextAsciiMode(void)
{
	LCD_EliminateFlickerOFF();
	LCD_WriteREG(WLCR, LCD_ReadREG(WLCR)|Text_Mode_Selection);
	EN_AllDisplay;
}

//被调用
void LCD_TextMode(void)
{
	LCD_WriteREG(WLCR, LCD_ReadREG(WLCR)|Text_Mode_Selection);
	CN_EN_HybridDisplay;
	LCD_EliminateFlickerOFF();
	delay_100ns(5);
}

//被调用
void LCD_PicsMode(void)
{
	LCD_WriteREG(WLCR, LCD_ReadREG(WLCR)&(~Text_Mode_Selection));
	//LCD_EliminateFlickerON();
	delay_100ns(5);
}

//被调用
void LCD_ClearAppWindow(void)
{  
	LCD_PicsMode();							   //选择绘图模式
	LCD_EliminateFlickerOFF();				   //取消雪花消除功能
	LCD_WriteREG(PNTR, 0x00);				   //填充当前操作图层内容，以绘图形式填写，1为该像素为黑，0为该像素为白
	//LCD_WriteREG(FNCR, LCD_ReadREG(WLCR) | Fill_AW);
	LCD_WriteREG(FNCR, LCD_ReadREG(WLCR) | 0x08);
	delay_100ns(1);	 //5
	while((LCD_ReadREG(WLCR)&0x08) != 0x00);
	//LCD_EliminateFlickerON();
}

//被调用
void LCD_FillAppWindow(uint8_t bytedata)
{
	LCD_PicsMode();
	LCD_EliminateFlickerOFF();
	LCD_WriteREG(PNTR, bytedata);
	//LCD_WriteREG(FNCR, LCD_ReadREG(WLCR) | Fill_AW);
	LCD_WriteREG(FNCR, LCD_ReadREG(WLCR) | 0x08);
	//LCD_EliminateFlickerON();
}

//被调用
void LCD_SetAppwindow(uint8_t toppixel, uint8_t bottompixel, uint8_t leftpixel, uint8_t rightpixel)
{
	LCD_WriteREG(AWLR, leftpixel);					   
	LCD_WriteREG(AWTR, toppixel);
	LCD_WriteREG(AWRR, rightpixel);					   
	LCD_WriteREG(AWBR, bottompixel);
}

//被调用																 
void LCD_SetCursor(uint8_t x, uint8_t y)	   //x由水平像素位置/8-1得出，y有垂直像素位置-1得出
{											   //x范围0-27h，y范围0-EFh
	LCD_WriteREG(CURX, x);
	LCD_WriteREG(CURY, y);	
}

//被调用
void LCD_ShowLayer(uint8_t layer)
{
	LCD_WriteREG(MAMR, (LCD_ReadREG(MAMR)&0x8F) | layer);
}

//被调用
void LCD_AccessLayer(uint8_t layer)
{
	LCD_WriteREG(MAMR, (LCD_ReadREG(MAMR)&0xFC) | layer);
	delay_100ns(1);	  //5
}

//被调用
void LCD_DDRAMs_ShowRule(uint8_t rule)
{
	LCD_WriteREG(MAMR, (LCD_ReadREG(MAMR)&0xF3) | rule);
}

//被调用
void LCD_DrawPics(uint8_t x, uint8_t y, uint8_t hpixel, uint8_t vpixel, uint8_t* pic)
{
	uint8_t hp, vp;
	uint8_t* picaddr;

	picaddr = pic;

//LCD_FLAG_Using = 1;
	
	LCD_AccessLayer(Layer_Selection_DDRAM2);
	
	LCD_PicsMode();

	LCD_SetCursor(x, y);
	LCD_WriteREG(AWLR, x);		 //设置工作窗口为图片大小
	LCD_WriteREG(AWTR, y);
	LCD_WriteREG(AWRR, x+hpixel);					   
	LCD_WriteREG(AWBR, y+vpixel);
	LCD_WriteCommand(MWCR);		 //光标设置为水平移动
	
	for(vp=0; vp<vpixel; vp++)
		for(hp=0; hp<hpixel; hp++){
			LCD_WriteData(*picaddr++);
		}

	LCD_WriteREG(AWLR, 0);		 //重设工作窗口为320*240
	LCD_WriteREG(AWTR, 0);
	LCD_WriteREG(AWRR, 39);					   
	LCD_WriteREG(AWBR, 239);

//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_DrawRectangle(uint8_t x, uint8_t y, uint8_t width, uint8_t height)
{
	uint8_t hp, vp;
	uint8_t DDRAM_data;

//LCD_FLAG_Using = 1;

	LCD_AccessLayer(Layer_Selection_DDRAM2);

	LCD_PicsMode();
	
	for(vp=0; vp<height; vp++){
		if(vp==0){
			LCD_SetCursor(x, y+vp);
			LCD_WriteCommand(MRCR);
			DDRAM_data = LCD_ReadData();
			
			LCD_SetCursor(x, vp+y);
			LCD_WriteCommand(MWCR);
			LCD_WriteData(0x0F|DDRAM_data);
			for(hp=1; hp<width; hp++)
				LCD_WriteData(0xFF);

			LCD_WriteCommand(MRCR);
			DDRAM_data = LCD_ReadData();

			LCD_SetCursor(x+width, vp+y);
			LCD_WriteCommand(MWCR);
			LCD_WriteData(0xF0|DDRAM_data);
		}
		
		else if(vp==height-1){
			LCD_SetCursor(x, vp+y);
			LCD_WriteCommand(MRCR);
			DDRAM_data = LCD_ReadData();

			LCD_SetCursor(x, vp+y);
			LCD_WriteCommand(MWCR);
			LCD_WriteData(0x0F|DDRAM_data);
			for(hp=1; hp<width; hp++)
				LCD_WriteData(0xFF);

			LCD_WriteCommand(MRCR);
			DDRAM_data = LCD_ReadData();

			LCD_SetCursor(x+width, vp+y);
			LCD_WriteCommand(MWCR);
			LCD_WriteData(0xF0);
		}
		else{
			LCD_SetCursor(x, y+vp);
			LCD_WriteCommand(MRCR);
			DDRAM_data = LCD_ReadData();
			LCD_SetCursor(x, y+vp);
			LCD_WriteCommand(MWCR);
			LCD_WriteData(0x08|DDRAM_data);

			LCD_SetCursor(x+width-1, y+vp);
			LCD_WriteCommand(MRCR);
			DDRAM_data = LCD_ReadData();
			LCD_SetCursor(x+width, y+vp);
			LCD_WriteCommand(MWCR);
			LCD_WriteData(0x10|DDRAM_data);
		}
	}

	LCD_WriteCommand(MRCR);

//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_DrawForm(uint8_t x, uint8_t y, uint8_t row, uint8_t rank, uint8_t width, uint8_t height)
{
	uint8_t i;
	uint8_t hp, vp;
	uint8_t DDRAM_data;

//LCD_FLAG_Using = 1;

	LCD_AccessLayer(Layer_Selection_DDRAM2);

	LCD_PicsMode();

	//先画横线
	for(i=0; i<rank+1; i++){
		LCD_SetCursor(x, y+height*i);
		LCD_WriteCommand(MWCR);
		for(hp=0; hp<width*row; hp++){
			LCD_WriteData(0xFF);
			delay_100ns(1);
		} 
	}
	

	//再画竖线
	for(i=0; i<row+1; i++){
		//LCD_SetCursor(x+width*i, y);
		for(vp=0; vp<height*rank; vp++){
			LCD_SetCursor(x+width*i, y+vp+1);
			LCD_WriteCommand(MRCR);		   //预读指令，光标自增
			DDRAM_data = LCD_ReadData();   //读出预读数据，光标又自增。。。

