xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
			//LCD_WriteREG(CURY, (LCD_ReadREG(CURY)-2));
			LCD_SetCursor(x+width*i, y+vp+1);
			LCD_WriteCommand(MWCR);
			LCD_WriteData(0x80|DDRAM_data);
		}
	}
	/*
	LCD_WriteREG(MAMR, (LCD_ReadREG(MAMR) | Cursor_Direction_Vert));
	delay_100ns(5);
	for(i=0; i<row+1; i++){
		LCD_SetCursor(x+width*i, y);
		LCD_WriteCommand(MWCR);
		for(vp=0; vp<height*rank+1; vp++){
			//LCD_WriteCommand(MRCR);		   //预读指令，光标自增
			//DDRAM_data = LCD_ReadData();   //读出预读数据，光标又自增。。。

			//LCD_SetCursor(x+width*i, y+vp);
			//LCD_WriteCommand(MWCR);
			LCD_WriteData(0x80);
			delay_100ns(1); 
		}
	}
	LCD_WriteREG(MAMR, (LCD_ReadREG(MAMR) & (~Cursor_Direction_Vert)));
	delay_100ns(5);
	*/
//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_WriteChar1(uint8_t ch)
{
//LCD_FLAG_Using = 1;	
	
	LCD_AccessLayer(Layer_Selection_DDRAM1);

	LCD_TextMode();

	//LCD_TextAsciiMode();
	//LCD_TextHybridMode();

	LCD_WriteCommand(MWCR);
	LCD_WriteData(ch);

//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_WriteChar2(uint8_t x, uint8_t y, uint8_t ch)
{
//LCD_FLAG_Using = 1;

	LCD_AccessLayer(Layer_Selection_DDRAM1);

	LCD_TextMode();
	
	LCD_SetCursor(x, y);

	//LCD_TextAsciiMode();
	//LCD_TextHybridMode();

	LCD_WriteCommand(MWCR);
	LCD_WriteData(ch);

//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_WriteText1(uint8_t* str)
{
	uint8_t* straddr;

	straddr = str;

//LCD_FLAG_Using = 1;

	LCD_AccessLayer(Layer_Selection_DDRAM1);
	
	LCD_TextMode();

	LCD_WriteCommand(MWCR);

	while(*straddr!='\0'){
		LCD_WriteData(*straddr++);
	}

//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_WriteText2(uint8_t x, uint8_t y, uint8_t* str)
{
	uint8_t* straddr;

	straddr = str;

//LCD_FLAG_Using = 1;

	LCD_AccessLayer(Layer_Selection_DDRAM1);

	LCD_TextMode();

	LCD_SetCursor(x, y);
	LCD_WriteCommand(MWCR);

	while(*straddr!='\0'){
		LCD_WriteData(*straddr++);
		delay_100ns(1);
	}

//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_TextBold(FunctionalState state)
{
	if(state == ENABLE){
		LCD_WriteREG(WCCR, LCD_ReadREG(WCCR) | Bold_Font);
	}
	else{  //state == DISABLE
		LCD_WriteREG(WCCR, LCD_ReadREG(WCCR)&0xEF);
	}
}

//被调用
void LCD_SetCursorHeight(uint8_t curheight)
{
	LCD_WriteREG(CHWI, (LCD_ReadREG(CHWI)&0x0F) | (curheight<<4));
}

//被调用
void LCD_SetWordInterval(uint8_t line_width)
{
	LCD_WriteREG(CHWI, (LCD_ReadREG(CHWI)&0xF0) | line_width);
}

//被调用
void LCD_EnlargeText(uint8_t hmul, uint8_t vmul)
{
	LCD_WriteREG(FVHT, (LCD_ReadREG(FVHT)&0x3F) | ((hmul-1)<<6));
	LCD_WriteREG(FVHT, (LCD_ReadREG(FVHT)&0xCF) | ((vmul-1)<<4));
}

//被调用
void LCD_AsciiBlock(uint8_t standard, uint8_t blockarea)
{
	LCD_WriteREG(FNCR, (LCD_ReadREG(FNCR)&0x7F) | standard);
	LCD_WriteREG(FNCR, (LCD_ReadREG(FNCR)&0xFC) | blockarea);
}

//被调用
void LCD_CGRAM_CreatWord(uint8_t word_number, uint8_t* cg)	 //在CGRAM中创造全字型
{
	uint8_t i;
	uint8_t exlayer;
	uint8_t* cgaddr;

	cgaddr = cg;

	exlayer = LCD_ReadREG(MAMR)&0x03;

//LCD_FLAG_Using = 1;

	LCD_WriteREG(MAMR, (LCD_ReadREG(MAMR)&0xFC) | Layer_Selection_CGRAM);
	LCD_WriteREG(CURX, 0x00);
	LCD_WriteREG(CURY, word_number);

	LCD_WriteCommand(MWCR);
	for(i=0; i<32; i++){
		LCD_WriteData(*cgaddr++);
	}

	LCD_WriteREG(MAMR, (LCD_ReadREG(MAMR)&0xFC) | exlayer);  //创造字型后返回以前的操作图层

//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_CGRAM_CreatHalfWord(uint8_t word_number, uint8_t odd_even, uint8_t* cg)
{
	uint8_t i;
	uint8_t exlayer;
	uint8_t* cgaddr;
	uint8_t lcd_flag_temp;

	cgaddr = cg;

	exlayer = LCD_ReadREG(MAMR)&0x03;

	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;

	LCD_WriteREG(MAMR, (LCD_ReadREG(MAMR)&0xFC) | Layer_Selection_CGRAM);
	LCD_WriteREG(CURX, odd_even);
	LCD_WriteREG(CURY, word_number);

	LCD_WriteCommand(MWCR);
	for(i=0; i<32; i++){
		LCD_WriteData(*cgaddr++);
	}

	LCD_WriteREG(MAMR, (LCD_ReadREG(MAMR)&0xFC) | exlayer);  //创造字型后返回以前的操作图层

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}

//被调用
void LCD_WriteWordFromCGRAM(uint8_t x, uint8_t y, uint8_t word_number)
{
//LCD_FLAG_Using = 1;

	LCD_AccessLayer(Layer_Selection_DDRAM1);
	
	LCD_TextMode();
	LCD_WriteREG(WLCR, LCD_ReadREG(WLCR) | Linear_Decode_Mode);

	LCD_SetCursor(x, y);
	LCD_WriteCommand(MWCR);
	LCD_WriteData(0x9F);
	LCD_WriteData(word_number);

	LCD_WriteREG(WLCR, LCD_ReadREG(WLCR)&(~Linear_Decode_Mode));

//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_WriteHalfWordFromCGRAM(uint8_t x, uint8_t y, uint8_t word_number, uint8_t odd_even)
{
//LCD_FLAG_Using = 1;

	LCD_AccessLayer(Layer_Selection_DDRAM1);
	
	LCD_TextMode();
	LCD_WriteREG(WLCR, LCD_ReadREG(WLCR) | Linear_Decode_Mode);

	LCD_SetCursor(x, y);
	LCD_WriteCommand(MWCR);
	LCD_WriteData(0x8F);
	LCD_WriteData(word_number*2+odd_even);

	LCD_WriteREG(WLCR, LCD_ReadREG(WLCR)&(~Linear_Decode_Mode));

//LCD_FLAG_Using = 0;
//if(LCD_FLAG_UpdateIrq == 1){
//	EXTI_GenerateSWInterrupt(EXTI_Line1);
//}
}

//被调用
void LCD_IconInit(void)
{
	LCD_CGRAM_CreatWord(0, (uint8_t*)Night_Icon);
	LCD_CGRAM_CreatWord(1, (uint8_t*)Manual_Icon);
}

//被调用
//Item数量不要超过屏的显示容量
//根据坐标反白相关Item
void LCD_NorString(uint8_t x, uint8_t y, uint8_t* str, FunctionalState invstate)
{
	uint8_t lcd_flag_temp;
	
	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;

	if(invstate == ENABLE){
		LCD_Inv();
	}
	else{
		LCD_NoInv();
	}

	LCD_WriteText2(x, y, str);

	LCD_NoInv();
	
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	
}

void LCD_ClearMenuText(void)
{
	LCD_AccessLayer(Layer_Selection_DDRAM1);
	LCD_SetAppwindow(53, 236, 0, 39);
	LCD_ClearAppWindow();
}

