xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
void LCD_ClearItemText(void)
{
	LCD_AccessLayer(Layer_Selection_DDRAM1);
	LCD_SetAppwindow(74, 236, 1, 28);
	//LCD_SetAppwindow(74, 236, 1, 38);
	LCD_ClearAppWindow();
}

void LCD_ClearItemAllText(void)
{
	LCD_AccessLayer(Layer_Selection_DDRAM1);
	LCD_SetAppwindow(74, 236, 0, 39);
	LCD_ClearAppWindow();
}

void LCD_ClearMenuForm(void)
{
	LCD_AccessLayer(Layer_Selection_DDRAM2);
	LCD_SetAppwindow(53, 236, 1, 38);
	LCD_ClearAppWindow();
//	LCD_WriteChar2(2, 61, ' ');
}

void LCD_DrawMenuForm(void)
{
	LCD_AccessLayer(Layer_Selection_DDRAM2);
	LCD_SetAppwindow(0, 0, 39, 239);
	LCD_DrawForm(1, 53, 1, 1, 38, 20);
	LCD_DrawForm(1, 73, 1, 1, 28, 163);
	LCD_DrawForm(29, 73, 1, 1, 10, 163);
}
#if MOVE
void LCD_RefreshItem(void)
{
	uint8_t lcd_flag_temp;
	
	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;

	if(Current_Menu->Items[Current_Menu->Item_Sel].Children_Menu != NULL){
		LCD_WriteText2(Current_Menu->Items[Current_Menu->Item_Sel].Item_x, Current_Menu->Items[Current_Menu->Item_Sel].Item_y, "+ ");
	}
	else if(Current_Menu->Items[Current_Menu->Item_Sel].function != NULL){
		LCD_WriteText2(Current_Menu->Items[Current_Menu->Item_Sel].Item_x, Current_Menu->Items[Current_Menu->Item_Sel].Item_y, "\x10 ");
	}
	else{
		LCD_WriteText2(Current_Menu->Items[Current_Menu->Item_Sel].Item_x, Current_Menu->Items[Current_Menu->Item_Sel].Item_y, "  ");
	}
	LCD_WriteText1(Current_Menu->Items[Current_Menu->Item_Sel].Item_Context);

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
#endif
#if MOVE
void LCD_NorItem(void)
{
	uint8_t lcd_flag_temp;
	
	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;

	LCD_Inv();
	if(Current_Menu->Items[Current_Menu->Item_Sel].Children_Menu != NULL){
		LCD_WriteText2(Current_Menu->Items[Current_Menu->Item_Sel].Item_x, Current_Menu->Items[Current_Menu->Item_Sel].Item_y, "+ ");
	}
	else if(Current_Menu->Items[Current_Menu->Item_Sel].function != NULL){
		LCD_WriteText2(Current_Menu->Items[Current_Menu->Item_Sel].Item_x, Current_Menu->Items[Current_Menu->Item_Sel].Item_y, "\x10 ");
	}
	else{
		LCD_WriteText2(Current_Menu->Items[Current_Menu->Item_Sel].Item_x, Current_Menu->Items[Current_Menu->Item_Sel].Item_y, "  ");
	}
	LCD_WriteText1(Current_Menu->Items[Current_Menu->Item_Sel].Item_Context);
	LCD_NoInv();

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
#endif
//--------------------------------------------------------
//以下为应用函数
void LCD_Init(void)
{
	LCD_Reset();	

	LCD_WriteREG(WLCR, Display_ON);		   	   //开启屏幕显示
	LCD_WriteREG(MISC, Driver_Clock_Div4);	   //忙信号有效电平为高电平，关闭雪花消除功能，进入绘图模式
	LCD_WriteREG(ADSR, 0x00);				   //关闭卷动功能
	//LCD_WriteREG(ADSR, SCR_HV | SCR_EN);
	LCD_WriteREG(INTR, 0x00);				   //屏蔽扫描中断
	//LCD_WriteREG(WCCR, Cursor_Display_ON);	   //显示光标
	LCD_WriteREG(WCCR, 0x00);
	LCD_WriteREG(CHWI, 0x00);				   //光标高度1像素，行距1像素

	LCD_AccessLayer(Layer_Selection_DDRAMs);
	LCD_ShowLayer(Display_Layer_DDRAMs);
	LCD_DDRAMs_ShowRule(TwoLayer_Rule_XOR);
	LCD_SetAppwindow(0, 239, 0, 39);
	LCD_FillAppWindow(0x00);

	LCD_WriteREG(DWWR, 39);					   //显示窗口320*240
	LCD_WriteREG(DWHR, 239);

	LCD_WriteREG(BGSG, 0);					   //卷动窗口(卷动功能没开启)0*0
	LCD_WriteREG(BGCM, 0);
	LCD_WriteREG(EDSG, 0);
	LCD_WriteREG(EDCM, 0);
	//LCD_WriteREG(BTMR, 0x0F);				   //调整卷动速度
	/*
	LCD_WriteREG(BGSG, 0);
	LCD_WriteREG(BGCM, 0);
	LCD_WriteREG(EDSG, 19);
	LCD_WriteREG(EDCM, 64);
	*/

	LCD_WriteREG(CURX, 0);
	LCD_WriteREG(CURY, 8);

	LCD_WriteREG(BTMR, 0x02);
	LCD_WriteREG(ITCR, 0x00);

	LCD_WriteREG(FVHT, 0x00);				   //不放大字符

	//LCD_FillAppWindow(0xFF);				   //测屏坏点
	//填充屏幕，汉字英语混合显示模式，这样无法使用ASCII字符表80h以上的字符
	
	LCD_TextBold(ENABLE);
	CN_EN_HybridDisplay;
	
	LCD_AccessLayer(Layer_Selection_DDRAM1);	//DDRAM1用于处理文字，DDRAM2用于处理表格与反白
}

void LCD_DisplayMainPannel(void)
{
	uint8_t i;

LCD_FLAG_Using = 1;
	
	LCD_AccessLayer(Layer_Selection_DDRAM1);
	LCD_SetAppwindow(53, 236, 1, 38);
	LCD_ClearAppWindow();
	LCD_AccessLayer(Layer_Selection_DDRAM2);
	LCD_SetAppwindow(53, 236, 1, 38);
	LCD_ClearAppWindow();	

	//LCD_AccessLayer(Layer_Selection_DDRAM2);
	LCD_DrawForm(1, 53, 2, 1, 19, 143);
	LCD_DrawForm(1, 196, 1, 2, 38, 20);

//	LCD_SetAppwindow(53, 236, 0, 39);
	LCD_WriteChar2(2, 198, ' ');
	
	for(i=0; i<MainMenu.Item_Num; i++){
		if(MainMenu.Item_Sel == i)  LCD_Inv();
		if(MainMenu_Items[i].Children_Menu != NULL){
			LCD_WriteText2(MainMenu_Items[i].Item_x, MainMenu_Items[i].Item_y, "+ ");
		}
		else if(MainMenu_Items[i].key_function != NULL){
			LCD_WriteText2(MainMenu_Items[i].Item_x, MainMenu_Items[i].Item_y, "\x10 ");
		}
		else{
			LCD_WriteText2(MainMenu_Items[i].Item_x, MainMenu_Items[i].Item_y, "  ");
		}
		LCD_WriteText1(MainMenu_Items[i].Item_Context);
		if(MainMenu.Item_Sel == i)  LCD_NoInv();
	}

	LCD_WriteText2(2, 198, "\x18\x19\x1A\x1B:移动 ENT:选择 ESC:退出");

	LCD_WriteText2(2, 218, MainMenu_Items[MainMenu.Item_Sel].Item_HelpInfo);

	LCD_SetAppwindow(0, 239, 0, 39);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}

void LCD_InterfaceInit(void)
{
	LCD_DrawRectangle(0, 0, 39, 239);

	LCD_WriteText2(1, 2, "当前时间:[    -  -  ][  :  :  ] 星期");
	LCD_WriteText2(1, 19, "运行时段:  (  )");
	LCD_WriteText2(20, 19, "运行相位:  (  )");
	LCD_WriteText2(1, 36, "当前相位剩余时间:   秒");	 //同行紧跟模式图标

	LCD_DisplayMainPannel();
}

void LCD_UpdateInfo(void)
{
	//保存上下文
	uint8_t xtemp;
	uint8_t ytemp;
	//uint8_t MAMR_temp;
	//uint8_t WLCR_temp;
	//uint8_t MISC_temp;
	uint8_t apptop, appbottom, appleft, appright;
	//uint8_t FNCR_temp;

	xtemp = LCD_ReadREG(CURX);
	ytemp = LCD_ReadREG(CURY);
	//MAMR_temp = LCD_ReadREG(MAMR);
	//WLCR_temp = LCD_ReadREG(WLCR);
	//MISC_temp = LCD_ReadREG(MISC);
	apptop = LCD_ReadREG(AWTR);
	appbottom = LCD_ReadREG(AWBR);
	appleft = LCD_ReadREG(AWLR);
	appright = LCD_ReadREG(AWRR); 

	while(LCD_ReadREG(FNCR)&0x08 != 0x00);
	//FNCR_temp = LCD_ReadREG(FNCR);
	/*	
	LCD_WriteText2(1, 2, "当前时间:[    -  -  ][  :  :  ] 星期");
	LCD_WriteText2(1, 19, "运行时段:  (  )");
	LCD_WriteText2(20, 19, "运行相位:  (  )");
	LCD_WriteText2(1, 36, "当前相位剩余时间:   秒");
	*/
	LCD_SetAppwindow(0, 239, 0, 39);
	//更新年月日
	LCD_WriteChar2(11, 2, Number_Table[Current_Time.tm_year/1000]);
	LCD_WriteChar1(Number_Table[(Current_Time.tm_year/100)%10]);
	LCD_WriteChar1(Number_Table[(Current_Time.tm_year%100)/10]);
	LCD_WriteChar1(Number_Table[Current_Time.tm_year%10]);

