xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	LCD_WriteChar1('-');
	
	//LCD_WriteChar2(16, 2, ((Current_Time.tm_mon+1)/10==0)?' ':Number_Table[(Current_Time.tm_mon+1)/10]);
	LCD_WriteChar1(((Current_Time.tm_mon+1)/10==0)?' ':Number_Table[(Current_Time.tm_mon+1)/10]);
	LCD_WriteChar1(Number_Table[(Current_Time.tm_mon+1)%10]);

	LCD_WriteChar1('-');
	
	//LCD_WriteChar2(19, 2, (Current_Time.tm_mday/10==0)?' ':Number_Table[Current_Time.tm_mday/10]);
	LCD_WriteChar1((Current_Time.tm_mday/10==0)?' ':Number_Table[Current_Time.tm_mday/10]);
	LCD_WriteChar1(Number_Table[Current_Time.tm_mday%10]);

	LCD_WriteText2(37, 2, (uint8_t*)Weekday_Table[Current_Time.tm_wday]);

	//更新时分秒
	LCD_WriteChar2(23, 2, (Current_Time.tm_hour/10==0)?' ':Number_Table[Current_Time.tm_hour/10]);
	LCD_WriteChar1(Number_Table[Current_Time.tm_hour%10]);

	LCD_WriteChar1(':');

	//LCD_WriteChar2(26, 2, (Current_Time.tm_min/10==0)?' ':Number_Table[Current_Time.tm_min/10]);
	LCD_WriteChar1((Current_Time.tm_min/10==0)?' ':Number_Table[Current_Time.tm_min/10]);
	LCD_WriteChar1(Number_Table[Current_Time.tm_min%10]);

	LCD_WriteChar1(':');

	//LCD_WriteChar2(29, 2, (Current_Time.tm_sec/10==0)?' ':Number_Table[Current_Time.tm_sec/10]);
	LCD_WriteChar1((Current_Time.tm_sec/10==0)?' ':Number_Table[Current_Time.tm_sec/10]);
	LCD_WriteChar1(Number_Table[Current_Time.tm_sec%10]);
	
	LCD_WriteChar2(10, 19, ((Current_TimeTable+1)/10==0)?' ':Number_Table[Current_TimeTable/10]);
	LCD_WriteChar1(Number_Table[(Current_TimeTable+1)%10]);

	LCD_WriteChar2(13, 19, (my_Schedule.TimeTable_Number/10==0)?' ':Number_Table[my_Schedule.TimeTable_Number/10]);
	LCD_WriteChar1(Number_Table[my_Schedule.TimeTable_Number%10]);
	
	LCD_WriteChar2(29, 19, ((Current_PhaseTable+1)/10==0)?' ':Number_Table[Current_PhaseTable/10]);
	LCD_WriteChar1(Number_Table[(Current_PhaseTable+1)%10]);
	
	LCD_WriteChar2(32, 19, (my_Schedule.PhaseTable[Current_TimeTable].Phase_Number/10==0)?' ':Number_Table[my_Schedule.PhaseTable[Current_TimeTable].Phase_Number/10]);
	LCD_WriteChar1(Number_Table[my_Schedule.PhaseTable[Current_TimeTable].Phase_Number%10]); 

	LCD_WriteChar2(18, 36, (Current_CutDown/10==0)?' ':Number_Table[Current_CutDown/10]);
	LCD_WriteChar1(Number_Table[Current_CutDown%10]);

	if(Time_FLAG_DayOrNight == 1)	
		LCD_WriteWordFromCGRAM(28, 36, 0);	
	else    
		LCD_WriteText2(28, 36, "  ");

	if(Manual_FLAG == 1)	
		LCD_WriteWordFromCGRAM(31, 36, 1);	
	else  
		LCD_WriteText2(31, 36, "  ");

	//LCD_WriteREG(MAMR, MAMR_temp);
	//LCD_WriteREG(WLCR, WLCR_temp);
	//LCD_WriteREG(MISC, MISC_temp);
	LCD_SetAppwindow(apptop, appbottom, appleft, appright);
	//LCD_WriteREG(FNCR, FNCR_temp);
	LCD_SetCursor(xtemp, ytemp);
}

void LCD_DisplayOtherMenu(struct Menu_TypeDef* menu)
{
	uint8_t i;

LCD_FLAG_Using = 1;

	LCD_ClearMenuText();
/*	
	LCD_AccessLayer(Layer_Selection_DDRAM1);
	LCD_SetAppwindow(53, 236, 1, 38);
	LCD_ClearAppWindow();
*/
/*
	LCD_AccessLayer(Layer_Selection_DDRAM2);
	LCD_SetAppwindow(53, 236, 1, 38);
	LCD_ClearAppWindow();

	LCD_AccessLayer(Layer_Selection_DDRAM2);
	LCD_SetAppwindow(0, 0, 39, 239);
	LCD_DrawForm(1, 53, 1, 1, 38, 20);
	LCD_DrawForm(1, 73, 1, 1, 28, 163);
	LCD_DrawForm(29, 73, 1, 1, 10, 163);

	LCD_WriteChar2(2, 61, ' ');
*/

	LCD_WriteText2(2, 55, menu->Menu_Title);

	for(i=0; i<menu->Item_Num; i++){
		if(menu->Item_Sel == i)  LCD_Inv();
		if(menu->Items[i].Children_Menu != NULL){
			LCD_WriteText2(menu->Items[i].Item_x, menu->Items[i].Item_y, "+ ");
		}
		else if(menu->Items[i].key_function != NULL){
			LCD_WriteText2(menu->Items[i].Item_x, menu->Items[i].Item_y, "\x10 ");
		}
		else{
			LCD_WriteText2(menu->Items[i].Item_x, menu->Items[i].Item_y, "  ");
		}
		LCD_WriteText1(menu->Items[i].Item_Context);
		if(menu->Item_Sel == i)  LCD_NoInv();
	}

	LCD_WriteText2(29, 176, "\x18\x19\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "ENT:选择");
	LCD_WriteText2(29, 216, "ESC:退出");

	LCD_WriteText2(29, 78, "帮助信息");

	LCD_SetAppwindow(96, 170, 29, 38);
	LCD_WriteText2(29, 96, menu->Items[menu->Item_Sel].Item_HelpInfo);

	LCD_SetAppwindow(0, 239, 0, 39);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}






void keyfunction_help(uint8_t* str){
	uint8_t lcd_flag_temp = LCD_FLAG_Using;
LCD_FLAG_Using = 1;
	LCD_AccessLayer(Layer_Selection_DDRAM1);
	LCD_SetAppwindow(76, 135, 29, 38);
	LCD_WriteText2(29, 76, str);
	LCD_SetAppwindow(0, 239, 0, 39);
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void keyfunction_clear_help(void){
	uint8_t lcd_flag_temp = LCD_FLAG_Using;
LCD_FLAG_Using = 1;
	LCD_AccessLayer(Layer_Selection_DDRAM1);
	LCD_SetAppwindow(76, 135, 29, 38);
	LCD_ClearAppWindow();
	LCD_SetAppwindow(0, 239, 0, 39);
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
/**********************************************************
公共密码解锁函数
**********************************************************/
void MenuLock_Update(uint8_t sel, menulock_fundata* menucode){
	uint8_t i;

	LCD_SetCursor(11, 110);
	for(i=0; i<6; i++){
		if(i == sel){
			LCD_Inv();
			LCD_WriteCommand(MWCR);
			LCD_WriteData(Number_Table[menucode->code[i]%10]);
			LCD_NoInv();
		}
		else{
			LCD_WriteCommand(MWCR);
			LCD_WriteData('*');
		}
	}
}
void MenuLock_init(uint8_t sel, uint8_t* code){
	uint8_t i;
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using; 
LCD_FLAG_Using = 1;
	LCD_ClearItemText();

	//LCD_AccessLayer(Layer_Selection_DDRAM1);
	LCD_SetAppwindow(96, 170, 29, 38);
	LCD_ClearAppWindow();

	LCD_SetAppwindow(0, 239, 0, 39);
	
	LCD_WriteText2(2, 80, "请输入六位密码:(初始为0)");
	LCD_SetCursor(11, 110);
	for(i=0; i<CODE_LEN; i++){
		if(i == sel){
			LCD_Inv();
			LCD_WriteCommand(MWCR);
			LCD_WriteData(Number_Table[code[i]%10]);
			LCD_NoInv();
		}
		else{
			LCD_WriteCommand(MWCR);
			LCD_WriteData('*');
		}
	}
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
//注意：菜单信息对menulock函数是不可见的
void Menu_Lock(KEY_TypeDef key, lcd_appstate* state, uint8_t* sel, menulock_fundata* menucode){
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;

