xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	switch(key){
		case KEY3:	if(*sel==0) *sel=5; else (*sel)--;  break;
		case KEY4:  if(*sel==5) *sel=0; else (*sel)++;  break;
		case KEY1:	if(menucode->code[*sel]<9) menucode->code[*sel]++;  break;
		case KEY2:	if(menucode->code[*sel]>0) menucode->code[*sel]--;  break;
		case KEY5:	{
			if(menucode->code[0]==1 && menucode->code[1]==1 && menucode->code[2]==1 && menucode->code[3]==1 && menucode->code[4]==1 && menucode->code[5]==1){
				*state = lcdapp_unlocked;
				*sel = 0;
			}
			else{
				*state = lcdapp_codeerror;
			}
			break;
		}
		case KEY6:{
			*state = lcdapp_return;
			/*
			Current_Menu.cur_funptr = Current_Menu.key_function;
			free(tempdata);
			Current_Menu.fundata = NULL;   //可用可不用
	
			LCD_ClearMenuText();
			Current_Menu.item_display();
			Current_Menu.help_display();
			*/
			break;
		}
		case Nothing: goto menulock_refresh;  //return; 
		default: break;
	}

	goto menulock_havekey;
menulock_refresh:
	switch(*state){
		case lcdapp_codeerror:{
			*state = lcdapp_locked;
LCD_FLAG_Using = 1;
			LCD_AccessLayer(Layer_Selection_DDRAM1);
			LCD_SetAppwindow(76, 170, 29, 38);
			LCD_ClearAppWindow();
			LCD_SetAppwindow(0, 239, 0, 39);
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
		}
	}
	return;

menulock_havekey:
	KEY_PressMinus();

	switch(*state){
		case lcdapp_codeerror:{
			keyfunction_help("密码错误");
			break;
		}
		default: break;
	}

LCD_FLAG_Using = 1;

	MenuLock_Update(*sel, menucode);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}



/**********************************************************
手动模式-路灯测试函数
**********************************************************/
typedef struct{
	//uint8_t KEY_FLAG_Return;
	uint8_t LED_Sn;
	uint8_t sel;
	uint8_t delay;
	uint8_t test;
	lcd_appstate state;
	menulock_fundata codedata;
}ledcheck_fundata;
void LED_Check_datainit(void){
	ledcheck_fundata* tempdata;
			
	ManualModeMenu.fundata = calloc(1, sizeof(ledcheck_fundata));
	tempdata = (ledcheck_fundata*) ManualModeMenu.fundata;

	if(tempdata != NULL){
		//tempdata->KEY_FLAG_Return = 0;
		tempdata->LED_Sn = 1;
		tempdata->test = 0;
		tempdata->sel = 0;
		tempdata->state = lcdapp_ready;
		memset(&tempdata->codedata.code[0], 0, CODE_LEN);

		LED_Check_main(Nothing);
	}
}
void LED_Check_Update(uint8_t LED_Sn){
	LCD_Inv();											 
	LCD_SetCursor(16, 140);
	LCD_WriteCommand(MWCR);
	LCD_WriteData(Number_Table[LED_Sn/10]);
	LCD_WriteData(Number_Table[LED_Sn%10]);
	LCD_NoInv();
}
void LED_Check_interfaceinit(void){
	ledcheck_fundata* tempdata;
	uint8_t lcd_flag_temp;

	tempdata = (ledcheck_fundata*) ManualModeMenu.fundata;
	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;
	LCD_ClearItemText();
		
	LCD_SetAppwindow(0, 239, 0, 39);
	
	LCD_WriteText2(2, 80, "设置要检测的交通灯序号");
	LCD_WriteText2(2, 100, "(1-48号)");
	LCD_WriteText2(2, 120, "\x1B\x1A:序号±10 \x18\x19:序号±1");
	LCD_WriteText2(2, 140, "当前测试序号【  】");

	LED_Check_Update(tempdata->LED_Sn);
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	All_LED_Die();
	No_UpdateLED_FLAG = 1;	//设置全局标志位
}
void LED_Check(KEY_TypeDef key){
	ledcheck_fundata* tempdata;
	uint8_t lcd_flag_temp;
	
	lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (ledcheck_fundata*) ManualModeMenu.fundata;

	switch (key){
		case KEY3:	if(tempdata->LED_Sn<39) tempdata->LED_Sn+=10;  break;
		case KEY4:  if(tempdata->LED_Sn>10) tempdata->LED_Sn-=10;  break;
		case KEY1:	if(tempdata->LED_Sn<48) tempdata->LED_Sn++; break;
		case KEY1_Cont:  if(tempdata->LED_Sn<48) tempdata->LED_Sn++; break;			
		case KEY2:	if(tempdata->LED_Sn>1)  tempdata->LED_Sn--; break;
		case KEY2_Cont:  if(tempdata->LED_Sn>1) tempdata->LED_Sn--;  break;
		case KEY5:	{
			if(tempdata->state == lcdapp_auto) break;
			else{
				//GPIO_Write(LED_Port, ~(0x0001<<((tempdata->LED_Sn-1)%16)));
				GPIO_SetBits(LED_Port, GPIO_Pin_All);
				GPIO_ResetBits(LED_Port, (0x0001<<((tempdata->LED_Sn-1)%16)));
				delay_100ns(1);
				//GPIO_SetBits(LE_Port, (0x0001<<((tempdata->LED_Sn-1)/16)));
				GPIO_SetBits(LE_Port, LE_sel((tempdata->LED_Sn-1)/16));
				delay_100ns(1);
				//GPIO_ResetBits(LE_Port, (0x0001<<((tempdata->LED_Sn-1)/16)));
				GPIO_SetBits(LE_Port, LE_sel((tempdata->LED_Sn-1)/16));
				delay_100ns(1);
	
				tempdata->state = lcdapp_saved;
				break;
			}
		}
		case KEY6:{
			if(tempdata->state == lcdapp_auto){
				//TIM_SetCounter(TIM6, 0x0000);
				//TIM_Cmd(TIM6, ENABLE);
				tempdata->state = lcdapp_cmd;
				 /*
LCD_FLAG_Using = 1;
				LCD_AccessLayer(Layer_Selection_DDRAM1);
				LCD_SetAppwindow(76, 170, 29, 38);
				LCD_ClearAppWindow();
				LCD_SetAppwindow(0, 239, 0, 39);
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}*/
				keyfunction_clear_help();
			}
			else
				tempdata->state = lcdapp_return;
			break;
		}
		case KEY2_3:  {
			//TIM_Cmd(TIM6, DISABLE);  //禁止键盘输入
			
			tempdata->state = lcdapp_auto;	//自动检测

			All_LED_Die();
			tempdata->test = 1;
			tempdata->delay = 0;
			/*
			for(test=0; test<=48; test++){
			   All_LED_Die();
			   GPIO_Write(LED_Port, (0x0001<<((test-1)%16)));
			   delay_100ns(1);
			   GPIO_SetBits(LE_Port, (0x0001<<((test-1)/16)));
			   delay_100ns(1);
			   GPIO_ResetBits(LE_Port, (0x0001<<((test-1)/16)));
			   delay_100ns(1);
			
			   delay_us(5000);
			}
			
			Menu_FLAG_Init_Finished = 0;
			
			TIM_SetCounter(TIM6, 0x0000);
			TIM_Cmd(TIM6, ENABLE);	*/
			break;
		}
		case Nothing: goto led_check_refresh; //break;
		default: break;
	}

	goto led_check_havekey;
led_check_refresh:
	switch(tempdata->state){
		case lcdapp_saved:{
			tempdata->state = lcdapp_cmd;
			//清除帮助显示
			keyfunction_clear_help();
			break;
		}
		case lcdapp_auto:{
			if(tempdata->delay>1){
				tempdata->delay = 0;
				GPIO_Write(LED_Port, ~(0x0001<<((tempdata->test-1)%16)));
				delay_100ns(1);
				//GPIO_SetBits(LE_Port, (0x0001<<((tempdata->test-1)/16)));
				GPIO_SetBits(LE_Port, LE_sel((tempdata->test-1)/16));
				delay_100ns(1);
				//GPIO_ResetBits(LE_Port, (0x0001<<((tempdata->test-1)/16)));
				GPIO_ResetBits(LE_Port, LE_sel((tempdata->test-1)/16));
				delay_100ns(1);
				if(tempdata->test<48) 
					tempdata->test++;
				else{
					keyfunction_clear_help();
					tempdata->state = lcdapp_cmd;
				}
			}
			else tempdata->delay++;
			break;
		}
		default:break;
	}
	return;

