xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
led_check_havekey:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_saved:{
			keyfunction_help("更改成功");
			break;
		}
		case lcdapp_auto:{
			keyfunction_help("自动测试开始");
			break;
		}
		default: break;
	}

LCD_FLAG_Using = 1;
	
	LED_Check_Update(tempdata->LED_Sn);

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void LED_Check_main(KEY_TypeDef key){
	ledcheck_fundata* tempdata;
//	uint8_t lcd_flag_temp;
	
//	lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (ledcheck_fundata*) ManualModeMenu.fundata;

	switch(tempdata->state){
		case lcdapp_ready: MenuLock_init(tempdata->codedata.code_sel, &tempdata->codedata.code[0]); tempdata->state = lcdapp_locked; return; //break;
		case lcdapp_codeerror:
		case lcdapp_locked:	Menu_Lock(key, &tempdata->state, &tempdata->codedata.code_sel, &tempdata->codedata); break;
		case lcdapp_unlocked: LED_Check_interfaceinit(); tempdata->state = lcdapp_cmd; return; //break;
		case lcdapp_saved:
		case lcdapp_auto:
		case lcdapp_cmd: LED_Check(key); break;
		case lcdapp_return:{
			ManualModeMenu.cur_funptr = ManualModeMenu.key_function;
			free(tempdata);
			ManualModeMenu.fundata = NULL;   //可用可不用
	
			LCD_ClearMenuText();
			ManualModeMenu.item_display();
			ManualModeMenu.help_display();

			//LCD_DisplayOtherMenu(Current_Menu);
			Current_PhaseTable = 0;	 //重新执行相位
			Phase_FLAG_Start = 0;
			Cycle_FLAG_Start = 0;
			Time_JudgeDayOrNight();	 //更改昼夜模式
			Time_JudgeTimeTable();	 //更新当前时段
			Phase_OneShot = my_Schedule.PhaseTable[Current_TimeTable];
			Current_CutDown = Phase_OneShot.Last_Time[Current_PhaseTable];
			LED_Interpretation(Current_TimeTable, Current_PhaseTable);
			No_UpdateLED_FLAG = 0;
			return;
		} 
		default: break;
	}
}




/**********************************************************
手动模式-调整当前相位时间
**********************************************************/
typedef struct{
	lcd_appstate state;
	uint8_t sel;
	menulock_fundata codedata;
}manual_cutdown_fundata;
void ManualMode_CutDown_init(void){
	uint8_t i;
	manual_cutdown_fundata* tempdata;
	
	ManualModeMenu.fundata = calloc(1, sizeof(manual_cutdown_fundata));
	tempdata = (manual_cutdown_fundata*) ManualModeMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->state = lcdapp_ready;
		for(i=0; i<CODE_LEN; i++)  tempdata->codedata.code[i] = 0;
		tempdata->codedata.code_sel = 0;
	}

	ManualMode_CutDown_main(Nothing);	
}
void ManualMode_CutDown_interfaceinit(void){
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;
LCD_FLAG_Using = 1;
	LCD_ClearItemText();

	LCD_SetAppwindow(0, 239, 0, 39);
	
	LCD_WriteText2(2, 80, "调整当前相位时间(6-99秒)");
	LCD_WriteText2(2, 100, "\x18\x19:加减时间1秒");
	LCD_WriteText2(2, 120, "\x1B\x1A:加减时间10秒");
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}	
}
void ManualMode_CutDown(KEY_TypeDef key){
	manual_cutdown_fundata* tempdata;
	
	tempdata = (manual_cutdown_fundata*)ManualModeMenu.fundata;

	switch (key){
		case KEY3:	if(Current_CutDown<90&&Current_CutDown>6) Current_CutDown+=10;  break;
		case KEY4:  if(Current_CutDown>16) Current_CutDown-=10;  break;
		case KEY1:	
		case KEY1_Cont: if(Current_CutDown<99&&Current_CutDown>6) Current_CutDown++;  break;
		case KEY2:
		case KEY2_Cont:	if(Current_CutDown>7) Current_CutDown--;  break;
		case KEY5:	break;
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case Nothing:  return;
		default: break;
	}
	//goto manual_have_key;

	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_return:{
			ManualModeMenu.cur_funptr = ManualModeMenu.key_function;
			free(tempdata);
			ManualModeMenu.fundata = NULL;   //可用可不用
	
			LCD_ClearMenuText();
			ManualModeMenu.item_display();
			ManualModeMenu.help_display();
			break;
		}
		default:break;
	}
}
void ManualMode_CutDown_main(KEY_TypeDef key){
	ledcheck_fundata* tempdata;

	tempdata = (ledcheck_fundata*) ManualModeMenu.fundata;

	switch(tempdata->state){
		case lcdapp_ready: MenuLock_init(tempdata->codedata.code_sel, &tempdata->codedata.code[0]); tempdata->state = lcdapp_locked; return; //break;
		case lcdapp_codeerror:
		case lcdapp_locked:	Menu_Lock(key, &tempdata->state, &tempdata->codedata.code_sel, &tempdata->codedata); break;
		case lcdapp_unlocked: ManualMode_CutDown_interfaceinit(); tempdata->state = lcdapp_cmd; return; //break;
		//case lcdapp_saved:
		//case lcdapp_auto:
		case lcdapp_cmd: ManualMode_CutDown(key); break;
		case lcdapp_return:{
			ManualModeMenu.cur_funptr = ManualModeMenu.key_function;
			free(tempdata);
			ManualModeMenu.fundata = NULL;   //可用可不用
	
			LCD_ClearMenuText();
			ManualModeMenu.item_display();
			ManualModeMenu.help_display();
			return;
		} 
		default: break;
	}
}


/**********************************************************
手动模式-循环运行指定相位
**********************************************************/
typedef struct{
	lcd_appstate state;
	uint8_t sel;
	menulock_fundata codedata;
	uint8_t timetable_index;
	uint8_t phasetable_index;
}run_phase_fundata;
void ManualMode_TimePhase_datainit(void){
	run_phase_fundata* tempdata;
	uint8_t i;

	ManualModeMenu.fundata = calloc(1, sizeof(run_phase_fundata));
	tempdata = (run_phase_fundata*) ManualModeMenu.fundata;

	if(tempdata != NULL){
		tempdata->state = lcdapp_ready;
		tempdata->sel = 0;
		tempdata->codedata.code_sel = 0;
		for(i=0; i<CODE_LEN; i++) tempdata->codedata.code[i] = 0;
	}

	ManualMode_TimePhase_main(Nothing);
}
void ManualMode_TimePhase_Update(uint8_t sel, uint8_t TimeTable_temp, uint8_t PhaseTable_temp){
	uint8_t i;
	
	for(i=0; i<2; i++){
		if(i == sel) LCD_Inv();
		LCD_SetCursor(Func_Run_PeriodPhase_Place[i][0], Func_Run_PeriodPhase_Place[i][1]);
		switch(i){
			case 0:	{
				LCD_WriteCommand(MWCR);
				LCD_WriteData(Number_Table[(TimeTable_temp+1)/10]);
				LCD_WriteData(Number_Table[(TimeTable_temp+1)%10]);
				break;
			}
			case 1: {
				LCD_WriteCommand(MWCR);
				LCD_WriteData(Number_Table[(PhaseTable_temp+1)/10]);
				LCD_WriteData(Number_Table[(PhaseTable_temp+1)%10]);
				break;
			}
			default: break;
		}
		if(i == sel) LCD_NoInv();
	}
}
void ManualMode_TimePhase_interface(void){
	run_phase_fundata* tempdata;
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (run_phase_fundata*) ManualModeMenu.fundata; 

LCD_FLAG_Using = 1;
	LCD_ClearItemText();

	LCD_SetAppwindow(0, 239, 0, 39);
	
