xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	LCD_WriteText2(2, 80, "设置并锁定运行时段及相位");
	LCD_WriteText2(2, 100, "\x1B\x1A:移动 \x18\x19:加减");
	LCD_WriteText2(2, 120, "当前选择: 时段【  】");
	LCD_WriteText2(12, 138, "相位【  】");

	ManualMode_TimePhase_Update(tempdata->sel, tempdata->timetable_index, tempdata->phasetable_index);
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	RTC_ITConfig(RTC_IT_SEC, DISABLE);
	Manual_FLAG = 1;  
	LED_Interpretation(0, 0);  
	RTC_ITConfig(RTC_IT_SEC, ENABLE);
}
void ManualMode_TimePhase(KEY_TypeDef key){
	run_phase_fundata* tempdata;
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (run_phase_fundata*) ManualModeMenu.fundata;	

	switch (key){
		case KEY3:	if(tempdata->sel==0) tempdata->sel=1; else tempdata->sel=0;  break;
		case KEY4:  if(tempdata->sel==0) tempdata->sel=1; else tempdata->sel=0;  break;
		case KEY1:	{
			if(tempdata->sel==0&&tempdata->timetable_index<my_Schedule.TimeTable_Number-1){
				tempdata->timetable_index++;
				tempdata->phasetable_index=0;
			} 
			else if(tempdata->sel==1&&tempdata->phasetable_index<my_Schedule.PhaseTable[tempdata->timetable_index].Phase_Number-1){
				tempdata->phasetable_index++;
			}  
			break;
		}
		case KEY2:	{
			if(tempdata->sel==0&&tempdata->timetable_index>0){
				tempdata->timetable_index--; 
				tempdata->phasetable_index=0;
			} 
			else if(tempdata->sel==1&&tempdata->phasetable_index>0){ 
				tempdata->phasetable_index--;  
			}
			break;
		}
		case KEY5:	{ 
			Current_TimeTable=tempdata->timetable_index;  
			Current_PhaseTable=tempdata->phasetable_index;  
			RTC_ITConfig(RTC_IT_SEC, DISABLE);  
			LED_Interpretation(Current_TimeTable, Current_PhaseTable);
			Current_CutDown = my_Schedule.PhaseTable[Current_TimeTable].Last_Time[Current_PhaseTable];  
			RTC_ITConfig(RTC_IT_SEC, ENABLE); 
			
			tempdata->state = lcdapp_set; 
			break;
		}
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case Nothing: goto manualmode_timephase_refresh;
		default: break;
	}
	goto manualmode_timephase_have_key;

manualmode_timephase_refresh:
	switch(tempdata->state){
		case lcdapp_set:{
			tempdata->state = lcdapp_cmd;
			keyfunction_clear_help();
		}
	}
	return;

manualmode_timephase_have_key:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_set:{
			keyfunction_help("设置成功");
			break;
		}
	}

LCD_FLAG_Using = 1;
	ManualMode_TimePhase_Update(tempdata->sel, tempdata->timetable_index, tempdata->phasetable_index);
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void ManualMode_TimePhase_main(KEY_TypeDef key){
	run_phase_fundata* tempdata;
	tempdata = (run_phase_fundata*) ManualModeMenu.fundata;

	switch(tempdata->state){
		case lcdapp_ready: MenuLock_init(tempdata->sel, &tempdata->codedata.code[0]); tempdata->state = lcdapp_locked; return; //break;
		case lcdapp_codeerror:
		case lcdapp_locked:	Menu_Lock(key, &tempdata->state, &tempdata->sel, &tempdata->codedata); break;
		case lcdapp_unlocked: ManualMode_TimePhase_interface();  tempdata->state = lcdapp_cmd; return; //break;
		case lcdapp_set:
		case lcdapp_cmd: ManualMode_TimePhase(key); break;
		case lcdapp_return:{
			ManualModeMenu.cur_funptr = ManualModeMenu.key_function;
			free(tempdata);
			ManualModeMenu.fundata = NULL;   //可用可不用
	
			LCD_ClearMenuText();
			ManualModeMenu.item_display();
			ManualModeMenu.help_display();

			//LCD_DisplayOtherMenu(Current_Menu);
			Current_PhaseTable = 0;	 //重新执行相位
			Phase_FLAG_Start = 0;
			Cycle_FLAG_Start = 0;
			Time_JudgeDayOrNight();	 //更改昼夜模式
			Time_JudgeTimeTable();	 //更新当前时段
			Phase_OneShot = my_Schedule.PhaseTable[Current_TimeTable];
			Current_CutDown = Phase_OneShot.Last_Time[Current_PhaseTable];
			LED_Interpretation(Current_TimeTable, Current_PhaseTable);
			Manual_FLAG = 0;
			return;
		} 
		default: break;
	}
}
/****************************************************************
RTC设置菜单
****************************************************************/
typedef struct{
	uint8_t KEY_FLAG_Return;
	uint8_t sel;
	//uint8_t i;
	struct tm time;
} RTC_SetDate_fundata;
void RTC_SetDate_Update(uint8_t sel, struct tm time){
	uint8_t i;
	
	for(i=2; i<14; i++){
		if(i == sel){
			LCD_Inv();
		}
		LCD_SetCursor(Func_RTCDate_Place[i-2][0], Func_RTCDate_Place[i-2][1]);
		LCD_WriteCommand(MWCR);
		switch (i){
			//case 0:	 LCD_WriteData(Number_Table[time.tm_year/1000]);  break;
			//case 1:  LCD_WriteData(Number_Table[(time.tm_year/100)%10]);  break;
			case 2:	 LCD_WriteData(Number_Table[(time.tm_year%100)/10]);  break;
			case 3:	 LCD_WriteData(Number_Table[time.tm_year%10]);  break;
			case 4:	 LCD_WriteData(Number_Table[(time.tm_mon+1)/10]);  break;
			case 5:	 LCD_WriteData(Number_Table[(time.tm_mon+1)%10]);  break;
			case 6:	 LCD_WriteData(Number_Table[time.tm_mday/10]);  break;
			case 7:	 LCD_WriteData(Number_Table[time.tm_mday%10]);  break;
			case 8:	 LCD_WriteData(Number_Table[time.tm_hour/10]);  break;
			case 9:	 LCD_WriteData(Number_Table[time.tm_hour%10]);  break;
			case 10: LCD_WriteData(Number_Table[time.tm_min/10]);  break;
			case 11: LCD_WriteData(Number_Table[time.tm_min%10]);  break;
			case 12: LCD_WriteData(Number_Table[time.tm_sec/10]);  break;
			case 13: LCD_WriteData(Number_Table[time.tm_sec%10]);  break;
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
}
void RTC_SetDate_Init(void){
	RTC_SetDate_fundata* tempdata;
	//uint8_t i;
	uint8_t lcd_flag_temp;
	
	lcd_flag_temp = LCD_FLAG_Using;
		
	RTCSetMenu.fundata = calloc(1, sizeof(RTC_SetDate_fundata));
	tempdata = (RTC_SetDate_fundata*) RTCSetMenu.fundata;

	if(RTCSetMenu.fundata != NULL){
		tempdata->KEY_FLAG_Return = 0;
		tempdata->sel = 2;
		tempdata->time.tm_year = 2012;   //<2038
		tempdata->time.tm_mon = 7;   //0-11
		tempdata->time.tm_mday = 18;	//1-31
		tempdata->time.tm_hour = 12;	//0-23
		tempdata->time.tm_min = 0;   //0-59
		tempdata->time.tm_sec = 0;   //0-59

LCD_FLAG_Using = 1;
/*	
	LCD_AccessLayer(Layer_Selection_DDRAM1);
	LCD_SetAppwindow(74, 162, 2, 27);
	LCD_ClearAppWindow();
*/
		LCD_ClearItemAllText();
		//LCD_SetAppwindow(0, 239, 0, 39);
		
		LCD_WriteText2(2, 80, "当光标置于个位时加1，十位时加10");
		LCD_WriteText2(2, 120, "日期:20  -  -  ");
		LCD_WriteText2(2, 150, "时间:    :  :  ");
		LCD_WriteText2(2, 200, "\x1B\x1A:移动 \x18\x19:加减");
	
		LCD_SetAppwindow(0, 239, 0, 39);
		
		RTC_SetDate_Update(tempdata->sel, tempdata->time);

