xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	}
}
void RTC_SetDate(KEY_TypeDef key){
	RTC_SetDate_fundata* tempdata;
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (RTC_SetDate_fundata*) RTCSetMenu.fundata;
	
	switch (key){
		case KEY3:	if(tempdata->sel==2) tempdata->sel=13; else tempdata->sel--;  break;
		case KEY4:  if(tempdata->sel==13) tempdata->sel=2; else tempdata->sel++;  break;
		case KEY1:	{
			switch (tempdata->sel){
				//case 0:	 LCD_WriteData(Number_Table[time.tm_year/1000]);  break;
				//case 1:  LCD_WriteData(Number_Table[(time.tm_year/100)%10]);  break;
				case 2:	 {
					if(tempdata->time.tm_year<2028){ 
						tempdata->time.tm_year+=10;
						if(tempdata->time.tm_mon == 1&&tempdata->time.tm_mday>=29){  //检查当前设置月份是否2月
							if((tempdata->time.tm_year%4==0) && (tempdata->time.tm_year%100!=0) || (tempdata->time.tm_year%400==0)){
								tempdata->time.tm_mday = 29;
							}
							else{
								tempdata->time.tm_mday = 28;
							}
						}
					}  
					break;
				}
				case 3:	 {
					if(tempdata->time.tm_year<2037){
						tempdata->time.tm_year++;
						if(tempdata->time.tm_mon == 1&&tempdata->time.tm_mday>=29){  //检查当前设置月份是否2月
							if((tempdata->time.tm_year%4==0) && (tempdata->time.tm_year%100!=0) || (tempdata->time.tm_year%400==0)){
								tempdata->time.tm_mday = 29;
							}
							else{
								tempdata->time.tm_mday = 28;
							}
						}
					}  
					break;
				}
				case 4:	 {
					if(tempdata->time.tm_mon<2){ 
						tempdata->time.tm_mon+=10;
						if(tempdata->time.tm_mday==31){
							if(tempdata->time.tm_mon==11){
								tempdata->time.tm_mday = 30;
							}
						}
					}
					break;
				}  
				case 5:	 {
					if(tempdata->time.tm_mon<11){
						tempdata->time.tm_mon++;
						if(tempdata->time.tm_mon==3 || tempdata->time.tm_mon==5 || tempdata->time.tm_mon==8 || tempdata->time.tm_mon==10){
							if(tempdata->time.tm_mday==31)
								tempdata->time.tm_mday = 30;
						}
						else if(tempdata->time.tm_mon==1){
							if(tempdata->time.tm_mday>28){
								if((tempdata->time.tm_year%4==0) && (tempdata->time.tm_year%100!=0) || (tempdata->time.tm_year%400==0)){
									tempdata->time.tm_mday = 29;
								}
								else{
									tempdata->time.tm_mday = 28;
								}
							}
						}
					}
					break;
				}
				case 6:	 {
					if(tempdata->time.tm_mon==3 || tempdata->time.tm_mon==5 || tempdata->time.tm_mon==8 || tempdata->time.tm_mon==10){	 
						if(tempdata->time.tm_mday<21){
							tempdata->time.tm_mday += 10;
						}
					}
					else if(tempdata->time.tm_mon == 1){
						if((tempdata->time.tm_year%4==0) && (tempdata->time.tm_year%100!=0) || (tempdata->time.tm_year%400==0)){	//闰年
							if(tempdata->time.tm_mday<20)
								tempdata->time.tm_mday += 10;
						}
						else{
							if(tempdata->time.tm_mday<19)
								tempdata->time.tm_mday += 10;
						}
					}
					else{
						if(tempdata->time.tm_mday<22){
							tempdata->time.tm_mday += 10;
						}
					}
					break;
				}
				case 7:	 {
					if(tempdata->time.tm_mon==3 || tempdata->time.tm_mon==5 || tempdata->time.tm_mon==8 || tempdata->time.tm_mon==10){	 
						if(tempdata->time.tm_mday<30){
							tempdata->time.tm_mday ++;
						}
					}
					else if(tempdata->time.tm_mon == 1){
						if((tempdata->time.tm_year%4==0) && (tempdata->time.tm_year%100!=0) || (tempdata->time.tm_year%400==0)){	//闰年
							if(tempdata->time.tm_mday<29)
								tempdata->time.tm_mday ++;
						}
						else{
							if(tempdata->time.tm_mday<28)
								tempdata->time.tm_mday ++;
						}
					}
					else{
						if(tempdata->time.tm_mday<31){
							tempdata->time.tm_mday ++;
						}
					}
					break;
				}
				case 8:	 if(tempdata->time.tm_hour<14) tempdata->time.tm_hour+=10;  break;
				case 9:	 if(tempdata->time.tm_hour<23) tempdata->time.tm_hour++;  break;
				case 10: if(tempdata->time.tm_min<50) tempdata->time.tm_min+=10;  break;
				case 11: if(tempdata->time.tm_min<59) tempdata->time.tm_min++;   break;
				case 12: if(tempdata->time.tm_sec<50) tempdata->time.tm_sec+=10;  break;
				case 13: if(tempdata->time.tm_sec<59) tempdata->time.tm_sec++;  break;
				default: break;
			}
			break;
		}
		case KEY2:	{
			switch (tempdata->sel){
				//case 0:	 LCD_WriteData(Number_Table[time.tm_year/1000]);  break;
				//case 1:  LCD_WriteData(Number_Table[(time.tm_year/100)%10]);  break;
				case 2:	 {
					if(tempdata->time.tm_year>2009){ 
						tempdata->time.tm_year -= 10;
						if(tempdata->time.tm_mon == 1&&tempdata->time.tm_mday>=29){  //检查当前设置月份是否2月
							if((tempdata->time.tm_year%4==0) && (tempdata->time.tm_year%100!=0) || (tempdata->time.tm_year%400==0)){
								tempdata->time.tm_mday = 29;
							}
							else{
								tempdata->time.tm_mday = 28;
							}
						}
					}  
					break;
				}
				case 3:	 {
					if(tempdata->time.tm_year>2000){
						tempdata->time.tm_year--;
						if(tempdata->time.tm_mon == 1&&tempdata->time.tm_mday>=29){  //检查当前设置月份是否2月
							if((tempdata->time.tm_year%4==0) && (tempdata->time.tm_year%100!=0) || (tempdata->time.tm_year%400==0)){
								tempdata->time.tm_mday = 29;
							}
							else{
								tempdata->time.tm_mday = 28;
							}
						}
					}
					break;
				}
				case 4:	 {
					if(tempdata->time.tm_mon>9){ 
						tempdata->time.tm_mon-=10;
						if(tempdata->time.tm_mon==1&&tempdata->time.tm_mday>=29){
							if((tempdata->time.tm_year%4==0) && (tempdata->time.tm_year%100!=0) || (tempdata->time.tm_year%400==0)){
								tempdata->time.tm_mday = 29;
							}
							else{
								tempdata->time.tm_mday = 28;
							}
						}
					}
					break;
				}  
				case 5:	 {
					if(tempdata->time.tm_mon>0){
						tempdata->time.tm_mon--;
						if(tempdata->time.tm_mon==3 || tempdata->time.tm_mon==5 || tempdata->time.tm_mon==8 || tempdata->time.tm_mon==10){
							if(tempdata->time.tm_mday==31)
								tempdata->time.tm_mday = 30;
						}
						else if(tempdata->time.tm_mon==1){
							if(tempdata->time.tm_mday>28){
								if((tempdata->time.tm_year%4==0) && (tempdata->time.tm_year%100!=0) || (tempdata->time.tm_year%400==0)){
									tempdata->time.tm_mday = 29;
								}
								else{
									tempdata->time.tm_mday = 28;
								}
							}
						}
					}
					break;
				}
				case 6:	 {
					if(tempdata->time.tm_mday > 10){
						tempdata->time.tm_mday -= 10;
					}
				 	break;
				}
				case 7:	 {
					if(tempdata->time.tm_mday >1){
						tempdata->time.tm_mday --;
					}
					break;
				}
				case 8:	 if(tempdata->time.tm_hour>9) tempdata->time.tm_hour-=10;  break;
				case 9:	 if(tempdata->time.tm_hour>0) tempdata->time.tm_hour--;  break;
				case 10: if(tempdata->time.tm_min>9) tempdata->time.tm_min-=10;  break;
				case 11: if(tempdata->time.tm_min<0) tempdata->time.tm_min--;   break;
				case 12: if(tempdata->time.tm_sec>9) tempdata->time.tm_sec-=10;  break;
				case 13: if(tempdata->time.tm_sec>0) tempdata->time.tm_sec--;  break;
				default: break;
			}
			break;
		}
		case KEY5:	{
			RTC_WaitForLastTask();
			RTC_ITConfig(RTC_IT_SEC, DISABLE);  
			Time_SetCalendarTime(tempdata->time);  
			RTC_ITConfig(RTC_IT_SEC, ENABLE);  
			tempdata->KEY_FLAG_Return = 1;  
			break;
		}
		case KEY6:	{
			tempdata->KEY_FLAG_Return = 1;			  
			break;	//功能函数返回
		}
		case Nothing: return;
		default: break;
	}

