xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	KEY_PressMinus();

	if(tempdata->KEY_FLAG_Return == 1){
		RTCSetMenu.cur_funptr = RTCSetMenu.key_function;
		free(tempdata);
		RTCSetMenu.fundata = NULL;   //可用可不用

		LCD_ClearMenuText();
		RTCSetMenu.item_display();
		RTCSetMenu.help_display();
		return;
	}

LCD_FLAG_Using = 1;
	
	RTC_SetDate_Update(tempdata->sel, tempdata->time);

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
/******************************************************
保存当前时间到外部RTC
******************************************************/
void time_saveto_ds1302(void){
	struct tm time = Current_Time;

	DS1302_SetSec(time.tm_sec, DISABLE);
	DS1302_SetMin(time.tm_min);
	DS1302_SetHour(time.tm_hour, DISABLE);
	DS1302_SetDate(time.tm_mday);
	DS1302_SetMon(time.tm_mon+1); //struct tm与ds1302内部存储范围不一致
	DS1302_SetYear(time.tm_year%100);
}
/******************************************************
昼夜时段设置
******************************************************/
typedef struct{
	uint8_t KEY_FLAG_Return;
	uint8_t hour, min, sec;
	uint8_t sel;	
} DayNight_fundata;
void DayNight_PeriodofTime_Update(uint8_t sel, uint8_t hour, uint8_t min, uint8_t sec){
	uint8_t i;

	for(i=0; i<6; i++){
		if(i == sel){
			LCD_Inv();
		}
		LCD_SetCursor(Func_DayNight_Place[i][0], Func_DayNight_Place[i][1]);
		LCD_WriteCommand(MWCR);
		switch (i){
			case 0:	 LCD_WriteData(Number_Table[hour/10]);  break;
			case 1:	 LCD_WriteData(Number_Table[hour%10]);  break;
			case 2:  LCD_WriteData(Number_Table[min/10]);  break;
			case 3:  LCD_WriteData(Number_Table[min%10]);  break;
			case 4:  LCD_WriteData(Number_Table[sec/10]);  break;
			case 5:  LCD_WriteData(Number_Table[sec%10]);  break;
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
}
void DayNight_PeriodofTime_Init(void){
	DayNight_fundata* tempdata;
	uint8_t lcd_flag_temp;
	
	lcd_flag_temp = LCD_FLAG_Using;
		
	TimeSetMenu.fundata = calloc(1, sizeof(DayNight_fundata));
	tempdata = (DayNight_fundata*) TimeSetMenu.fundata;

	if(tempdata != NULL){
		tempdata->KEY_FLAG_Return = 0;
		tempdata->hour = my_Schedule.DayNight_Mode.DayNight_hour;
		tempdata->min = my_Schedule.DayNight_Mode.DayNight_min;
		tempdata->sec = my_Schedule.DayNight_Mode.DayNight_sec;
		tempdata->sel = 0;

LCD_FLAG_Using = 1;
		
		LCD_ClearItemAllText();
		//LCD_SetAppwindow(0, 239, 0, 39);
		
		LCD_WriteText2(2, 80, "当光标置于个位时加1，十位时加10");
		LCD_WriteText2(10, 130, "  :  :  ");
		LCD_WriteText2(2, 200, "\x1B\x1A:移动 \x18\x19:加减");
	
		LCD_SetAppwindow(0, 239, 0, 39);

		DayNight_PeriodofTime_Update(tempdata->sel, tempdata->hour, tempdata->min, tempdata->sec);

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	}
}
void DayNight_PeriodofTime(KEY_TypeDef key){
	DayNight_fundata* tempdata;
	uint8_t lcd_flag_temp;
	
	lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (DayNight_fundata*)TimeSetMenu.fundata;

	switch(key){
		case KEY3:	if(tempdata->sel==0) tempdata->sel=5; else tempdata->sel--;  break;
		case KEY4:	if(tempdata->sel==5) tempdata->sel=0; else tempdata->sel++;  break;
		case KEY1:  {
			switch (tempdata->sel){
				case 0: if(tempdata->hour < 14) tempdata->hour+=10; break;
				case 1: if(tempdata->hour < 23) tempdata->hour++;  break;
				case 2: if(tempdata->min < 50) tempdata->min+=10;  break;
				case 3: if(tempdata->min < 59) tempdata->min++;  break;
				case 4: if(tempdata->sec < 50) tempdata->sec+=10;  break;
				case 5: if(tempdata->sec < 59) tempdata->sec++;  break;
				default: break;
			}
			break;
		}
		case KEY1_Cont:{
			switch (tempdata->sel){
				case 0: if(tempdata->hour < 14) tempdata->hour+=10; break;
				case 1: if(tempdata->hour < 23) tempdata->hour++;  break;
				case 2: if(tempdata->min < 50) tempdata->min+=10;  break;
				case 3: if(tempdata->min < 59) tempdata->min++;  break;
				case 4: if(tempdata->sec < 50) tempdata->sec+=10;  break;
				case 5: if(tempdata->sec < 59) tempdata->sec++;  break;
				default: break;
			}
			break;
		}
		case KEY2:  {
			switch (tempdata->sel){
				case 0: if(tempdata->hour > 9) tempdata->hour-=10;  break;
				case 1: if(tempdata->hour > 0) tempdata->hour--;  break;
				case 2: if(tempdata->min > 9) tempdata->min-=10;  break;
				case 3: if(tempdata->min > 0) tempdata->min--;  break;
				case 4: if(tempdata->sec > 9) tempdata->sec-=10;  break;
				case 5: if(tempdata->sec > 0) tempdata->sec--;  break;
				default: break;
			}
			break;
		}
		case KEY2_Cont:{
			switch (tempdata->sel){
				case 0: if(tempdata->hour > 9) tempdata->hour-=10;  break;
				case 1: if(tempdata->hour > 0) tempdata->hour--;  break;
				case 2: if(tempdata->min > 9) tempdata->min-=10;  break;
				case 3: if(tempdata->min > 0) tempdata->min--;  break;
				case 4: if(tempdata->sec > 9) tempdata->sec-=10;  break;
				case 5: if(tempdata->sec > 0) tempdata->sec--;  break;
				default: break;
			}
			break;
		}
		case KEY5:  {
			RTC_WaitForLastTask();
			RTC_ITConfig(RTC_IT_SEC, DISABLE);  
			my_Schedule.DayNight_Mode.DayNight_hour = tempdata->hour;
			my_Schedule.DayNight_Mode.DayNight_min = tempdata->min;
			my_Schedule.DayNight_Mode.DayNight_sec = tempdata->sec; 
			RTC_WaitForLastTask(); 
			RTC_ITConfig(RTC_IT_SEC, ENABLE);  
			tempdata->KEY_FLAG_Return = 1;  
			break;
		}
		case KEY6:  tempdata->KEY_FLAG_Return = 1;  break;
		case Nothing: return; //break;	  //定时刷新屏幕，如果检测按键无输入且函数无需更新，返回
		default: break;
	}

	KEY_PressMinus();

	if(tempdata->KEY_FLAG_Return == 1){
		TimeSetMenu.cur_funptr = TimeSetMenu.key_function;
		free(tempdata);
		RTCSetMenu.fundata = NULL;   //可用可不用

		LCD_ClearMenuText();
		TimeSetMenu.item_display();
		TimeSetMenu.help_display();
		return;
	}

LCD_FLAG_Using = 1;

	DayNight_PeriodofTime_Update(tempdata->sel, tempdata->hour, tempdata->min, tempdata->sec);

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}


/****************************************************************
灯号--路口led映射关系设置菜单
****************************************************************/
typedef struct{
	uint8_t KEY_FLAG_Return;
	uint8_t sel;
	uint8_t PinNum[16];
	uint8_t crossway;
	lcd_appstate state;
	uint16_t used_shadow[6];
} LedGPIO_fundata;
void LCD_LedGPIO_Update(uint8_t sel, uint8_t* PinNum){
	uint8_t i;
	LedGPIO_fundata* tempdata;

