xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	tempdata = (LedGPIO_fundata*) LEDColorMenu.fundata;

	for(i=0; i<17; i++){
		if(i == tempdata->sel){
			LCD_Inv();
		}
		if(i == 0){
			LCD_WriteText2(Func_LedGPIO_Place[i][0], Func_LedGPIO_Place[i][1], (uint8_t*)Weekday_Table[tempdata->crossway+1]);	
		}
		else{
			LCD_SetCursor(Func_LedGPIO_Place[i][0], Func_LedGPIO_Place[i][1]);
			if(tempdata->PinNum[i-1]==0x00){
				LCD_WriteText1("×");
			}
			else{
				LCD_WriteCommand(MWCR);
				LCD_WriteData((tempdata->PinNum[i-1]/10==0x00)?' ':Number_Table[tempdata->PinNum[i-1]/10]);
				LCD_WriteData(Number_Table[tempdata->PinNum[i-1]%10]);
			}
		}
		if(i == tempdata->sel){
			LCD_NoInv();
		}
	}
}
void LCD_LedGPIO_Init(void){
	LedGPIO_fundata* tempdata;
	uint8_t lcd_flag_temp;
	uint8_t i;
	
	lcd_flag_temp = LCD_FLAG_Using;
		
	LEDColorMenu.fundata = calloc(1, sizeof(LedGPIO_fundata));
	tempdata = (LedGPIO_fundata*) LEDColorMenu.fundata;

	if(tempdata != NULL){
		tempdata->KEY_FLAG_Return = 0;
		tempdata->sel = 0;
		tempdata->crossway = 0;
		tempdata->state = lcdapp_ready;
		for(i=0; i<16; i++){
			tempdata->PinNum[i] = my_Schedule.Crossway_LED_Sn[tempdata->crossway].LEDColor_Sn[i];  //存储灯组1的第i个已定义灯色输出端口序号
		}
		for(i=0; i<6; i++){
			tempdata->used_shadow[i] = used_if_record[i]; //保存端口占用记录
		}

LCD_FLAG_Using = 1;

		LCD_ClearItemAllText();	
		LCD_SetAppwindow(0, 239, 0, 39);	
		LCD_WriteText2(2, 75, "灯组  (端口序号:1-96 ×:禁用)");
		//LCD_WriteText2(6, 80, (uint8_t*)Weekday_Table[tempdata->crossway+1]);
		LCD_WriteText2(11, 93, "绿   黄   红");
		LCD_WriteText2(5, 111, "左转 [  ] [  ] [  ]");
		LCD_WriteText2(5, 129, "直行 [  ] [  ] [  ]");
		LCD_WriteText2(5, 147, "右转 [  ] [  ] [  ]");
		LCD_WriteText2(5, 165, "调头 [  ] [  ] [  ]");
		LCD_WriteText2(5, 183, "人行1[  ]      [  ]");
		LCD_WriteText2(5, 201, "人行2[  ]      [  ]");
	
		LCD_WriteText2(29, 176, "\x1A\x1B:移动");
		LCD_WriteText2(29, 196, "\x18\x19:选择端口");
		LCD_WriteText2(2, 220, "请长按确定键以保存设置");

		LCD_LedGPIO_Update(tempdata->sel, tempdata->PinNum);

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	}
}
void LCD_LedGPIO(KEY_TypeDef key){
	LedGPIO_fundata* tempdata;
	uint8_t lcd_flag_temp;
	uint8_t i;
	
	lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (LedGPIO_fundata*) LEDColorMenu.fundata;

	switch(key){
		case KEY3:
		case KEY3_Cont:  if(tempdata->sel==0) tempdata->sel=16; else tempdata->sel--; break;
		case KEY4:
		case KEY4_Cont:  if(tempdata->sel==16) tempdata->sel=0; else tempdata->sel++; break;
		case KEY1:{
			if(tempdata->sel == 0){
				if(tempdata->crossway<CROSSWAY_MAX-1) tempdata->crossway ++;
				else tempdata->crossway = 0;

				for(i=0; i<16; i++){
					tempdata->PinNum[i] = my_Schedule.Crossway_LED_Sn[tempdata->crossway].LEDColor_Sn[i];  //存储灯组1的第i个已定义灯色输出端口序号
				}
				for(i=0; i<6; i++){
					tempdata->used_shadow[i] = used_if_record[i]; //保存端口占用记录
				}
			}
			else{
la1:
				//删除原记录
				tempdata->used_shadow[(tempdata->PinNum[tempdata->sel-1]-1)/16] ^= 0x0001<<((tempdata->PinNum[tempdata->sel-1]-1)%16);
				if(tempdata->PinNum[tempdata->sel-1]<96){
					tempdata->PinNum[tempdata->sel-1]++;
					//检测此序号是否被使用
					if(ledgpio_map_check_used(tempdata->PinNum[tempdata->sel-1]) == ERROR)
						goto la1;
				} 
				else tempdata->PinNum[tempdata->sel-1]=0;
				if(tempdata->PinNum[tempdata->sel-1] != 0x00)
					tempdata->used_shadow[(tempdata->PinNum[tempdata->sel-1]-1)/16] |= 0x0001<<((tempdata->PinNum[tempdata->sel-1]-1)%16);
			}
			break;
		}
		case KEY1_Cont:{
			if(tempdata->sel != 0){
//la2:
				if(tempdata->PinNum[tempdata->sel-1]<96){
					tempdata->PinNum[tempdata->sel-1]++;
					//if(ledgpio_map_check_used(tempdata->PinNum[tempdata->sel-1]) == ERROR)
						//goto la2;
				} 
				else tempdata->PinNum[tempdata->sel-1]=0;
			}
			break;
		}
		case KEY2:{
			if(tempdata->sel == 0){
				if(tempdata->crossway>0) tempdata->crossway --;
				else tempdata->crossway = 5;

				for(i=0; i<16; i++){
					tempdata->PinNum[i] = my_Schedule.Crossway_LED_Sn[tempdata->crossway].LEDColor_Sn[i];  //存储灯组1的第i个已定义灯色输出端口序号
				}
			}
			else{
//la3:
				if(tempdata->PinNum[tempdata->sel-1]>0) tempdata->PinNum[tempdata->sel-1]--;
				else tempdata->PinNum[tempdata->sel-1]=96; 
				//if(ledgpio_map_check_used(tempdata->PinNum[tempdata->sel-1]) == ERROR && tempdata->PinNum[tempdata->sel-1] != 0x00)
					//goto la3;
			}
			break;
		}	
		case KEY2_Cont:{
			if(tempdata->sel != 0){
//la4:
				if(tempdata->PinNum[tempdata->sel-1]>0) tempdata->PinNum[tempdata->sel-1]--; 
				else tempdata->PinNum[tempdata->sel-1]=96;
				//if(ledgpio_map_check_used(tempdata->PinNum[tempdata->sel-1]) == ERROR && tempdata->PinNum[tempdata->sel-1] != 0x00)
					//goto la4;
			}
			break;
		}
		case KEY5_Cont:{
			RTC_WaitForLastTask();
			RTC_ITConfig(RTC_IT_SEC, DISABLE);

			//从不使用（0）到分配端口要记录到used_if_record里面，从使用到不使用，要修改记录
			for(i=0; i<16; i++){
				my_Schedule.Crossway_LED_Sn[tempdata->crossway].LEDColor_Sn[i] = tempdata->PinNum[i];
			}
			
			RTC_WaitForLastTask();
			RTC_ITConfig(RTC_IT_SEC, ENABLE);

			//tempdata->KEY_FLAG_Return = 1;
			tempdata->state = lcdapp_saved;
			break;
		}
		case KEY6:	tempdata->KEY_FLAG_Return = 1;  break;
		case Nothing: goto refresh;						//定时刷屏进入，非按键触发进入
		default: break;
	}
	
	goto have_key;

refresh:
	if(tempdata->state != lcdapp_ready){
		tempdata->state = lcdapp_ready;
		keyfunction_clear_help();
	}
	return;

have_key:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_saved:{
			keyfunction_help("设置成功");
			break;
		}
		default: break;
	}

	if(tempdata->KEY_FLAG_Return == 1){
		LEDColorMenu.cur_funptr = LEDColorMenu.key_function;
		free(tempdata);
		LEDColorMenu.fundata = NULL;   //可用可不用

		LCD_ClearMenuText();
		LEDColorMenu.item_display();
		LEDColorMenu.help_display();		
		return;
	}

LCD_FLAG_Using = 1;
	
	LCD_LedGPIO_Update(tempdata->sel, tempdata->PinNum);

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
/**********************************************************************
保存灯组接口设置
**********************************************************************/
void ledgpio_saveto_e2prom(void){
	uint8_t crossway;
	uint8_t* data_ptr;

	RTC_WaitForLastTask();
	RTC_ITConfig(RTC_IT_SEC, DISABLE);
	for(crossway=0; crossway<CROSSWAY_MAX; crossway++){
		data_ptr = my_Schedule.Crossway_LED_Sn[crossway].LEDColor_Sn;
		e2prom_write_bytes(LED_SN_OFFSET+crossway*LED_SN_SIZE, LED_SN_SIZE, data_ptr);
		delay_100ns(1000);
	}
	RTC_WaitForLastTask();
	RTC_ITConfig(RTC_IT_SEC, ENABLE);
}
/**********************************************************************
恢复灯组接口设置到出厂状态
**********************************************************************/
void reset_ledgpio_map(void){
	RTC_WaitForLastTask();
	RTC_ITConfig(RTC_IT_SEC, DISABLE);
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[0] = 1;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[1] = 6;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[2] = 9;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[3] = 14;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[4] = 5;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[5] = 13;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[6] = 2;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[7] = 7;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[8] = 10;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[9] = 15;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[10] = 3;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[11] = 8;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[12] = 11;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[13] = 16;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[14] = 4;
	my_Schedule.Crossway_LED_Sn[0].LEDColor_Sn[15] = 12;

	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[0] = 17;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[1] = 22;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[2] = 25;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[3] = 32;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[4] = 21;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[5] = 28;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[6] = 18;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[7] = 23;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[8] = 26;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[9] = 31;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[10] = 19;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[11] = 24;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[12] = 29;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[13] = 30;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[14] = 20;
	my_Schedule.Crossway_LED_Sn[1].LEDColor_Sn[15] = 19;

