xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[0] = 33;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[1] = 36;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[2] = 39;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[3] = 42;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[4] = 45;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[5] = 47;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[6] = 34;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[7] = 37;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[8] = 40;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[9] = 43;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[10] = 35;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[11] = 38;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[12] = 41;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[13] = 44;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[14] = 46;
	my_Schedule.Crossway_LED_Sn[2].LEDColor_Sn[15] = 48;

	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[0] = 37;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[1] = 41;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[2] = 45;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[3] = 0;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[4] = 0;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[5] = 0;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[6] = 38;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[7] = 42;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[8] = 46;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[9] = 0;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[10] = 39;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[11] = 43;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[12] = 47;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[13] = 0;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[14] = 0;
	my_Schedule.Crossway_LED_Sn[3].LEDColor_Sn[15] = 0;

	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[0] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[1] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[2] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[3] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[4] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[5] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[6] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[7] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[8] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[9] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[10] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[11] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[12] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[13] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[14] = 0;
	my_Schedule.Crossway_LED_Sn[4].LEDColor_Sn[15] = 0;

	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[0] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[1] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[2] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[3] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[4] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[5] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[6] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[7] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[8] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[9] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[10] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[11] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[12] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[13] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[14] = 0;
	my_Schedule.Crossway_LED_Sn[5].LEDColor_Sn[15] = 0;
	RTC_WaitForLastTask();
	RTC_ITConfig(RTC_IT_SEC, ENABLE);
}
/**********************************************************************
闪烁设置菜单函数
**********************************************************************/
//公共更新子程序
void flashfunc_update(uint8_t sel, uint8_t crossway, uint16_t flashdata){
	uint8_t i;
	uint8_t lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;	
	for(i=0; i<17; i++){
		if(i == sel){
			LCD_Inv();
		}
		LCD_SetCursor(Func_SetFlash_Place[i][0], Func_SetFlash_Place[i][1]);
		if(i != 16){
			LCD_WriteText1(((flashdata&(0x0001<<i))==0x0000)?	(uint8_t*)Tick_Cross_Table[0]:(uint8_t*)Tick_Cross_Table[1]);
		}
		else{
			//LCD_WriteText1("灯组");
			LCD_WriteText1((uint8_t*)Weekday_Table[crossway+1]);
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
/**********************************************************************
闪烁许可设置
**********************************************************************/
typedef struct{
	uint8_t sel;
	uint8_t crossway;
	uint16_t flash_allowed[CROSSWAY_MAX];
	lcd_appstate state;
}flash_fundata;
void flash_allowed_datainit(void){
	uint8_t i;
	flash_fundata* tempdata;
	
	FlashMenu.fundata = calloc(1, sizeof(flash_fundata));
	tempdata = (flash_fundata*) FlashMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->crossway = 0;
		tempdata->state = lcdapp_ready;
		for(i=0; i<CROSSWAY_MAX; i++)  tempdata->flash_allowed[i] = my_Schedule.Crossway_Flash[i].FLASH_Allowence;
	}

	flash_allowed_main(Nothing);
}
void Set_FlashAllowence_Interface(void){
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;
	LCD_ClearItemAllText();
	
	LCD_SetAppwindow(0, 239, 0, 39);
	
	LCD_WriteText2(2, 75, "\x11灯组  \x10");
	LCD_WriteText2(12, 93, "绿  黄  红");
	LCD_WriteText2(5, 111, "左转 [  ] [  ] [  ]");
	LCD_WriteText2(5, 129, "直行 [  ] [  ] [  ]");
	LCD_WriteText2(5, 147, "右转 [  ] [  ] [  ]");
	LCD_WriteText2(5, 165, "调头 [  ] [  ] [  ]");
	LCD_WriteText2(5, 183, "人行1[  ]      [  ]");
	LCD_WriteText2(5, 201, "人行2[  ]      [  ]");

	LCD_WriteText2(29, 136, "√:允许闪烁");
	LCD_WriteText2(29, 156, "×:禁止闪烁");

	LCD_WriteText2(29, 176, "\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "\x18\x19:设置");
	LCD_WriteText2(2, 218, "长按确认键进行保存"); 
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void Set_FlashAllowence(KEY_TypeDef key){
	flash_fundata* tempdata;
	//uint8_t lcd_flag_temp;
	uint8_t i;

	tempdata = (flash_fundata*) FlashMenu.fundata;
	switch (key){
		case KEY3:  if(tempdata->sel==0) tempdata->sel=16; else tempdata->sel--; break;
		case KEY4:  if(tempdata->sel==16) tempdata->sel=0; else tempdata->sel++; break;
		case KEY1:{
			if(tempdata->sel != 16){
				tempdata->flash_allowed[tempdata->crossway] = tempdata->flash_allowed[tempdata->crossway] ^ (0x0001<<(tempdata->sel));
			}
			else{
				if(tempdata->crossway == 5)  tempdata->crossway = 0;
				else tempdata->crossway ++;
			}
			break;
		}
		case KEY2:{
			if(tempdata->sel != 16){
				tempdata->flash_allowed[tempdata->crossway] = tempdata->flash_allowed[tempdata->crossway] ^ (0x0001<<(tempdata->sel));
			}
			else{
				if(tempdata->crossway == 0)  tempdata->crossway = 5;
				else  tempdata->crossway --;
			}
			break;
		}
		case KEY5_Cont:  {
			for(i=0; i<6; i++){
				my_Schedule.Crossway_Flash[i].FLASH_Allowence = tempdata->flash_allowed[i];
			}
			tempdata->state = lcdapp_saved;
			//KEY_FLAG_Return = 1;
			break;
		}
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case Nothing: goto flash_allowence_refresh; //break;
		default: break;
	}
	goto flash_allowence_havekey;

flash_allowence_refresh:
	switch(tempdata->state){
		case lcdapp_cmd: break;
		default:{
			keyfunction_clear_help();
			tempdata->state = lcdapp_cmd;
			break;
		} 
	}
	return;

flash_allowence_havekey:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_saved:{
			keyfunction_help("保存成功");			
		}
		default: break;
	}
	flashfunc_update(tempdata->sel, tempdata->crossway, tempdata->flash_allowed[tempdata->crossway]);
}
void flash_allowed_main(KEY_TypeDef key){
	flash_fundata* tempdata;
	tempdata = (flash_fundata*) FlashMenu.fundata;

	switch(tempdata->state){
		case lcdapp_ready:{
			Set_FlashAllowence_Interface(); 
			flashfunc_update(tempdata->sel, tempdata->crossway, tempdata->flash_allowed[tempdata->crossway]); 
			tempdata->state = lcdapp_cmd; 
			break;
		}
		case lcdapp_saved:
		case lcdapp_cmd: Set_FlashAllowence(key); break;
		case lcdapp_return:{
			FlashMenu.cur_funptr = FlashMenu.key_function;
			free(tempdata);
			FlashMenu.fundata = NULL;   //可用可不用
	
			LCD_ClearMenuText();
			FlashMenu.item_display();
			FlashMenu.help_display();
			break;
		}
	}
}

/**********************************************************************
日昼常闪设置
**********************************************************************/
typedef struct{
	uint8_t sel;
	uint8_t crossway;
	uint16_t dayflash[CROSSWAY_MAX];
	lcd_appstate state;
}dayflash_fundata;
void dayflash_datainit(void){
	uint8_t i;
	dayflash_fundata* tempdata;
	
