xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	FlashMenu.fundata = calloc(1, sizeof(dayflash_fundata));
	tempdata = (dayflash_fundata*) FlashMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->crossway = 0;
		tempdata->state = lcdapp_ready;
		for(i=0; i<CROSSWAY_MAX; i++)  tempdata->dayflash[i] = my_Schedule.Crossway_Flash[i].Day_FLASH_ON;
	}

	dayflash_main(Nothing);
}
void dayflash_Interface(void){
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;
	LCD_ClearItemAllText();
	
	LCD_SetAppwindow(0, 239, 0, 39);
	
	LCD_WriteText2(2, 75, "\x11灯组  \x10");
	LCD_WriteText2(12, 93, "绿  黄  红");
	LCD_WriteText2(5, 111, "左转 [  ] [  ] [  ]");
	LCD_WriteText2(5, 129, "直行 [  ] [  ] [  ]");
	LCD_WriteText2(5, 147, "右转 [  ] [  ] [  ]");
	LCD_WriteText2(5, 165, "调头 [  ] [  ] [  ]");
	LCD_WriteText2(5, 183, "人行1[  ]      [  ]");
	LCD_WriteText2(5, 201, "人行2[  ]      [  ]");

	LCD_WriteText2(29, 136, "√:白天常闪");
	LCD_WriteText2(29, 156, "×:不闪烁");

	LCD_WriteText2(29, 176, "\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "\x18\x19:设置");
	LCD_WriteText2(2, 218, "长按确认键进行保存"); 
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void dayflash(KEY_TypeDef key){
	dayflash_fundata* tempdata;
	uint8_t i;

	tempdata = (dayflash_fundata*) FlashMenu.fundata;

	switch (key){
		case KEY3:  if(tempdata->sel==0) tempdata->sel=16; else tempdata->sel--; break;
		case KEY4:  if(tempdata->sel==16) tempdata->sel=0; else tempdata->sel++; break;
		case KEY1:	{
			if(tempdata->sel != 16){
				tempdata->dayflash[tempdata->crossway] = tempdata->dayflash[tempdata->crossway] ^ (0x0001<<(tempdata->sel));
			}
			else{
				if(tempdata->crossway == CROSSWAY_MAX-1)  tempdata->crossway = 0;
				else  tempdata->crossway ++;
			}
			break;
		}
		case KEY2:	{
			if(tempdata->sel != 16){
				tempdata->dayflash[tempdata->crossway] = tempdata->dayflash[tempdata->crossway] ^ (0x0001<<(tempdata->sel));
			}
			else{
				if(tempdata->crossway == 0)  tempdata->crossway = CROSSWAY_MAX-1;
				else  tempdata->crossway --;
			}
			break;
		}
		case KEY5_Cont: {
			for(i=0; i<CROSSWAY_MAX; i++){
				my_Schedule.Crossway_Flash[i].Day_FLASH_ON = tempdata->dayflash[i];
			}
			tempdata->state = lcdapp_saved;

			//KEY_FLAG_Return = 1;
			break;
		}
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case Nothing: goto dayflash_refresh;
		default: break;
	}
	goto dayflash_havekey;

dayflash_refresh:
	switch(tempdata->state){
		case lcdapp_cmd: break;
		default:{
			keyfunction_clear_help();
			tempdata->state = lcdapp_cmd;
			break;
		}
	}
	return;

dayflash_havekey:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_saved:{
			keyfunction_help("保存成功");
			break;
		}
		default: break;
	}

	flashfunc_update(tempdata->sel, tempdata->crossway, tempdata->dayflash[tempdata->crossway]);
}
void dayflash_main(KEY_TypeDef key){
	dayflash_fundata* tempdata;
	tempdata = (dayflash_fundata*) FlashMenu.fundata;

	switch(tempdata->state){
		case lcdapp_ready:{
			dayflash_Interface(); 
			flashfunc_update(tempdata->sel, tempdata->crossway, tempdata->dayflash[tempdata->crossway]); 
			tempdata->state = lcdapp_cmd; 
			break;
		}
		case lcdapp_saved:
		case lcdapp_cmd: dayflash(key); break;
		case lcdapp_return:{
			FlashMenu.cur_funptr = FlashMenu.key_function;
			free(tempdata);
			FlashMenu.fundata = NULL;   //可用可不用
	
			LCD_ClearMenuText();
			FlashMenu.item_display();
			FlashMenu.help_display();
			break;
		}
	}
}
/**********************************************************************
晚间常闪设置(与日昼常闪设置非常相似，直接套用)
**********************************************************************/
typedef struct{
	uint8_t sel;
	uint8_t crossway;
	uint16_t nightflash[CROSSWAY_MAX];
	lcd_appstate state;
}nightflash_fundata;
void nightflash_datainit(void){
	uint8_t i;
	nightflash_fundata* tempdata;
	
	FlashMenu.fundata = calloc(1, sizeof(nightflash_fundata));
	tempdata = (nightflash_fundata*) FlashMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->crossway = 0;
		tempdata->state = lcdapp_ready;
		for(i=0; i<CROSSWAY_MAX; i++)  tempdata->nightflash[i] = my_Schedule.Crossway_Flash[i].Night_FLASH_ON;
	}

	nightflash_main(Nothing);
}
void nightflash_Interface(void){
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;
	LCD_ClearItemAllText();
	
	LCD_SetAppwindow(0, 239, 0, 39);
	
	LCD_WriteText2(2, 80, "\x11灯组  \x10");
	LCD_WriteText2(12, 93, "绿  黄  红");
	LCD_WriteText2(5, 111, "左转 [  ] [  ] [  ]");
	LCD_WriteText2(5, 129, "直行 [  ] [  ] [  ]");
	LCD_WriteText2(5, 147, "右转 [  ] [  ] [  ]");
	LCD_WriteText2(5, 165, "调头 [  ] [  ] [  ]");
	LCD_WriteText2(5, 183, "人行1[  ]      [  ]");
	LCD_WriteText2(5, 201, "人行2[  ]      [  ]");

	LCD_WriteText2(29, 136, "√:晚间常闪");
	LCD_WriteText2(29, 156, "×:不闪烁");

	LCD_WriteText2(29, 176, "\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "\x18\x19:设置");
	LCD_WriteText2(2, 218, "长按确认键进行保存"); 
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void nightflash(KEY_TypeDef key){
	nightflash_fundata* tempdata;
	uint8_t lcd_flag_temp;
	uint8_t i;

	lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (nightflash_fundata*) FlashMenu.fundata;

	switch (key){
		case KEY3:  if(tempdata->sel==0) tempdata->sel=16; else tempdata->sel--; break;
		case KEY4:  if(tempdata->sel==16) tempdata->sel=0; else tempdata->sel++; break;
		case KEY1:	{
			if(tempdata->sel != 16){
				tempdata->nightflash[tempdata->crossway] = tempdata->nightflash[tempdata->crossway] ^ (0x0001<<(tempdata->sel));
			}
			else{
				if(tempdata->crossway == CROSSWAY_MAX-1)  tempdata->crossway = 0;
				else  tempdata->crossway ++;
			}
			break;
		}
		case KEY2:	{
			if(tempdata->sel != 16){
				tempdata->nightflash[tempdata->crossway] = tempdata->nightflash[tempdata->crossway] ^ (0x0001<<(tempdata->sel));
			}
			else{
				if(tempdata->crossway == 0)  tempdata->crossway = CROSSWAY_MAX-1;
				else  tempdata->crossway --;
			}
			break;
		}
		case KEY5_Cont: {
			for(i=0; i<6; i++){
				my_Schedule.Crossway_Flash[i].Night_FLASH_ON = tempdata->nightflash[i];
			}
			tempdata->state = lcdapp_saved;

