xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
			//KEY_FLAG_Return = 1;
			break;
		}
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case Nothing: goto dayflash_refresh;
		default: break;
	}
	goto dayflash_havekey;

dayflash_refresh:
	switch(tempdata->state){
		case lcdapp_cmd: break;
		default:{
			keyfunction_clear_help();
			tempdata->state = lcdapp_cmd;
			break;
		}
	}
	return;

dayflash_havekey:
	KEY_PressMinus();

LCD_FLAG_Using = 1;
	switch(tempdata->state){
		case lcdapp_saved:{
			keyfunction_help("保存成功");
			break;
		}
		default: break;
	}

	flashfunc_update(tempdata->sel, tempdata->crossway, tempdata->nightflash[tempdata->crossway]);
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void nightflash_main(KEY_TypeDef key){
	nightflash_fundata* tempdata;
	tempdata = (nightflash_fundata*) FlashMenu.fundata;

	switch(tempdata->state){
		case lcdapp_ready:{
			nightflash_Interface(); 
			flashfunc_update(tempdata->sel, tempdata->crossway, tempdata->nightflash[tempdata->crossway]); 
			tempdata->state = lcdapp_cmd; 
			break;
		}
		case lcdapp_saved:
		case lcdapp_cmd: dayflash(key); break;
		case lcdapp_return:{
			FlashMenu.cur_funptr = FlashMenu.key_function;
			free(tempdata);
			FlashMenu.fundata = NULL;   //可用可不用
	
			LCD_ClearMenuText();
			FlashMenu.item_display();
			FlashMenu.help_display();
			break;
		}
	}
}
/**********************************************************************
相位表设置
**********************************************************************/
typedef struct{
	uint8_t sel;
	uint8_t period_sel;
	uint8_t phase_sel;
	uint8_t crossway;
	uint8_t cutdown;
	uint16_t crossway_phase;
	lcd_appstate state;
}phase_fundata;
void set_phase_datainit(void){
	phase_fundata* tempdata;
	
	PhaseMenu.fundata = calloc(1, sizeof(phase_fundata));
	tempdata = (phase_fundata*) PhaseMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->period_sel = 0;
		tempdata->phase_sel = 0;
		tempdata->cutdown = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel];
		tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel];
		tempdata->state = lcdapp_ready;
	}
	else{
		tempdata->state = lcdapp_return;
	}
	set_phase_main(Nothing);
}
const uint8_t Func_SetPhase_Place[10][2] = {{7, 80}, {8, 98}, {19, 98}, {8, 126}, {18, 126}, {8, 146}, {18, 146}, {8, 166}, {18, 166}, {15, 186}};
void set_phase_update(uint8_t crossway, uint8_t sel, uint16_t crossway_phase, uint8_t phase_sel, uint8_t period_sel, uint8_t cutdown){
	uint8_t i;
	uint8_t lcd_flag_temp;

	lcd_flag_temp = LCD_FLAG_Using;
LCD_FLAG_Using = 1;	
	for(i=0; i<10; i++){
		if(i == sel){
			LCD_Inv();
		}
		switch (i){
			case 0: {
				LCD_WriteText2(7, 80, (uint8_t*)Weekday_Table[crossway+1]);
				break;
			}
			case 1: {
				LCD_WriteChar2(8, 98, Number_Table[(period_sel+1)/10]);
				LCD_WriteChar1(Number_Table[(period_sel+1)%10]);
				break;
			}
			case 2: {
				LCD_WriteChar2(19, 98, Number_Table[(phase_sel+1)/10]);
				LCD_WriteChar1(Number_Table[(phase_sel+1)%10]);
				break;
			}
			case 3: {	//当绿红黄都为0时，如LG LY LR位均为0时，则该灯不亮
				LCD_SetCursor(8, 126);
				if((crossway_phase&LeftGreen) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&LeftRed) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else if((crossway_phase&LeftYellow) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[2]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 4: {
				LCD_SetCursor(18, 126);
				if((crossway_phase&StraightGreen) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&StraightRed) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else if((crossway_phase&StraightYellow) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[2]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 5: {
				LCD_SetCursor(8, 146);
				if((crossway_phase&RightGreen) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&RightRed) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else if((crossway_phase&RightYellow) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[2]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 6: {
				LCD_SetCursor(18, 146);
				if((crossway_phase&BackGreen) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&BackRed) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else if((crossway_phase&BackYellow) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[2]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 7: {
				LCD_SetCursor(8, 166);
				if((crossway_phase&SideWalk1Green) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&SideWalk1Red) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 8: {
				LCD_SetCursor(18, 166);
				if((crossway_phase&SideWalk2Green) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&SideWalk2Red) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 9: {
				LCD_SetCursor(15, 186);
				LCD_WriteChar1(Number_Table[cutdown/10]);
				LCD_WriteChar1(Number_Table[cutdown%10]);
				break;
			}
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void set_phase_interface(void){
	phase_fundata* tempdata;
	uint8_t lcd_flag_temp = LCD_FLAG_Using;

	tempdata = (phase_fundata*) PhaseMenu.fundata;

LCD_FLAG_Using = 1;
	LCD_ClearItemAllText();
	
	LCD_SetAppwindow(0, 239, 0, 39);
	
	LCD_WriteText2(2, 80, "\x11灯组  \x10 (×:表示该灯不亮)" );
	LCD_WriteText2(2, 98, "时段【  】 相位【  】");
	LCD_WriteText2(2, 126, "左转 [  ] 直行 [  ]");
	LCD_WriteText2(2, 146, "右转 [  ] 调头 [  ]");
	LCD_WriteText2(2, 166, "人行1[  ] 人行2[  ]");
	LCD_WriteText2(2, 186, "相位运行时间:  秒");

	LCD_SetAppwindow(96, 170, 29, 38);
	LCD_WriteText2(29, 96, "长按确定键对设置进行保存，否则设置将会丢失");
	
	LCD_SetAppwindow(0, 239, 0, 39); 

