xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	LCD_WriteText2(29, 176, "\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "\x18\x19:选择");
	
	set_phase_update(tempdata->crossway, tempdata->sel, tempdata->crossway_phase, tempdata->phase_sel, tempdata->period_sel, tempdata->cutdown); 
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void set_phase(KEY_TypeDef key){
	phase_fundata* tempdata;
	
	tempdata = (phase_fundata*) PhaseMenu.fundata;

	switch (key){
		case KEY3:  if(tempdata->sel==0) tempdata->sel=9; else tempdata->sel--; break;
		case KEY4:  if(tempdata->sel==9) tempdata->sel=0; else tempdata->sel++; break;
		case KEY1:	{
			switch (tempdata->sel){
				case 0: {
					if(tempdata->crossway==5) tempdata->crossway=0; 
					else tempdata->crossway++;
					
					//Set_PhaseUpdate(crossway, PeriodOfTimeNum, PhaseNum, &cutdown, &Crossway_Phase);
					tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel];
					tempdata->cutdown = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel];
					break;
				}
				case 1: {
					if(tempdata->period_sel<my_Schedule.TimeTable_Number-1) tempdata->period_sel++;
					tempdata->phase_sel = 0;
					tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel];
					tempdata->cutdown = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel];
					break;
				}
				case 2: {
					if(tempdata->phase_sel<my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1) tempdata->phase_sel++; 
					tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel];
					tempdata->cutdown = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel];
					break;
				}
				case 3: {
					if((tempdata->crossway_phase&LeftGreen) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^LeftGreen)|LeftRed;
					}
					else if((tempdata->crossway_phase&LeftRed) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^LeftRed)|LeftYellow;
					}
					else if((tempdata->crossway_phase&LeftYellow) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^LeftYellow;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|LeftGreen;
					}
					break;
				}
				case 4:	{
					if((tempdata->crossway_phase&StraightGreen) != 0x00){
						tempdata->crossway_phase = (tempdata->crossway_phase^StraightGreen)|StraightRed;
					}
					else if((tempdata->crossway_phase&StraightRed) != 0x00){
						tempdata->crossway_phase = (tempdata->crossway_phase^StraightRed)|StraightYellow;
					}
					else if((tempdata->crossway_phase&StraightYellow) != 0x00){
						tempdata->crossway_phase = tempdata->crossway_phase^StraightYellow;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|StraightGreen;
					}
					break;
				}
				case 5:	{
					if((tempdata->crossway_phase&RightGreen) != 0x00){
						tempdata->crossway_phase = (tempdata->crossway_phase^RightGreen)|RightRed;
					}
					else if((tempdata->crossway_phase&RightRed) != 0x00){
						tempdata->crossway_phase = (tempdata->crossway_phase^RightRed)|RightYellow;
					}
					else if((tempdata->crossway_phase&RightYellow) != 0x00){
						tempdata->crossway_phase = tempdata->crossway_phase^RightYellow;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|RightGreen;
					}
					break;
				}
				case 6:	{
					if((tempdata->crossway_phase&BackGreen) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^BackGreen)|BackRed;
					}
					else if((tempdata->crossway_phase&BackRed) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^BackRed)|BackYellow;
					}
					else if((tempdata->crossway_phase&BackYellow) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^BackYellow;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|BackGreen;
					}
					break;
				}
				case 7:	{
					if((tempdata->crossway_phase&SideWalk1Green) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^SideWalk1Green)|SideWalk1Red;
					}
					else if((tempdata->crossway_phase&SideWalk1Red) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^SideWalk1Red;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|SideWalk1Green;
					}
					break;
				}
				case 8:	{
					if((tempdata->crossway_phase&SideWalk2Green) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^SideWalk2Green)|SideWalk2Red;
					}
					else if((tempdata->crossway_phase&SideWalk2Red) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^SideWalk2Red;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|SideWalk2Green;
					}
					break;
				}
				case 9: {
					if(tempdata->cutdown<99) tempdata->cutdown++;
					break;
				}
				default: break;
			}
			break;
		}
		case KEY2:	{
			switch (tempdata->sel){
				case 0: {
					if(tempdata->crossway==0) tempdata->crossway=5; 
					else tempdata->crossway--;
					tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel];
					break;
				}
				case 1: {
					if(tempdata->period_sel>0) tempdata->period_sel--;
					tempdata->phase_sel = 0;
					tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel]; 
					tempdata->cutdown = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel];
					break;
				}
				case 2: {
					if(tempdata->phase_sel>0) tempdata->phase_sel--; 
					tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel];
					break;
				}
				case 3: {
					if((tempdata->crossway_phase&LeftGreen) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^LeftGreen;
					}
					else if((tempdata->crossway_phase&LeftRed) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^LeftRed)|LeftGreen;
					}
					else if((tempdata->crossway_phase&LeftYellow) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^LeftYellow)|LeftRed;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|LeftYellow;
					}
					break;
				}
				case 4:	{
					if((tempdata->crossway_phase&StraightGreen) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^StraightGreen;
					}
					else if((tempdata->crossway_phase&StraightRed) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^StraightRed)|StraightGreen;
					}
					else if((tempdata->crossway_phase&LeftYellow) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^StraightYellow)|StraightRed;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|StraightYellow;
					}
					break;
				}
				case 5:	{
					if((tempdata->crossway_phase&RightGreen) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^RightGreen;
					}
					else if((tempdata->crossway_phase&LeftRed) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^RightRed)|RightGreen;
					}
					else if((tempdata->crossway_phase&LeftYellow) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^RightYellow)|RightRed;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|RightYellow;
					}
					break;
				}
				case 6:	{
					if((tempdata->crossway_phase&BackGreen) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^BackGreen;
					}
					else if((tempdata->crossway_phase&LeftRed) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^BackRed)|BackGreen;
					}
					else if((tempdata->crossway_phase&LeftYellow) != 0x00){
						tempdata->crossway_phase = (tempdata->crossway_phase^BackYellow)|BackRed;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|BackYellow;
					}
					break;
				}
				case 7:	{
					if((tempdata->crossway_phase&SideWalk1Green) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^SideWalk1Green;
					}
					else if((tempdata->crossway_phase&SideWalk1Red) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^SideWalk1Red)|SideWalk1Green;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|SideWalk1Red;
					}
					break;
				}
				case 8:	{
					if((tempdata->crossway_phase&SideWalk2Green) != 0x0000){
						tempdata->crossway_phase = tempdata->crossway_phase^SideWalk2Green;
					}
					else if((tempdata->crossway_phase&SideWalk2Red) != 0x0000){
						tempdata->crossway_phase = (tempdata->crossway_phase^SideWalk2Red)|SideWalk2Green;
					}
					else{
						tempdata->crossway_phase = tempdata->crossway_phase|SideWalk2Red;
					}
					break;
				}
				case 9: {
					if(tempdata->cutdown>7) tempdata->cutdown--;
					break;
				}
				default: break;
			}
			break;
		}
		case KEY5_Cont:  {
			while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);

			RTC_WaitForLastTask();
			RTC_ITConfig(RTC_IT_SEC, DISABLE);

			my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel] = tempdata->crossway_phase;
			my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel] = tempdata->cutdown;
			
			RTC_WaitForLastTask();
			RTC_ITConfig(RTC_IT_SEC, ENABLE);

			tempdata->state = lcdapp_saved;
			break;
		}
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case KEY2_Cont: {
			if(tempdata->sel == 9){
				if(tempdata->cutdown>7) tempdata->cutdown--;
				break;
			}
		}
		case KEY1_Cont: {
			if(tempdata->sel == 9){
				if(tempdata->cutdown<99) tempdata->cutdown++;
				break;
			}
		}
		case Nothing: goto set_phase_refresh; 
		default: break;
	}
	goto set_phase_havekey;

set_phase_refresh:
	switch(tempdata->state){
		case lcdapp_saved: break;
		default:{
			tempdata->state = lcdapp_cmd;
			keyfunction_clear_help();
		}
	}
	return;

set_phase_havekey:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_saved:{
			keyfunction_help("设置成功");
			break;
		}
		default: break;
	}
	set_phase_update(tempdata->crossway, tempdata->sel, tempdata->crossway_phase, tempdata->phase_sel, tempdata->period_sel, tempdata->cutdown);
}
void set_phase_main(KEY_TypeDef key){
	phase_fundata* tempdata;

	tempdata = (phase_fundata*) PhaseMenu.fundata;

	switch(tempdata->state){
		case lcdapp_ready: set_phase_interface(); set_phase_update(tempdata->crossway, tempdata->sel, tempdata->crossway_phase, tempdata->phase_sel, tempdata->period_sel, tempdata->cutdown); tempdata->state = lcdapp_cmd; break;
		case lcdapp_saved:
		case lcdapp_cmd:{
			set_phase(key);
			break;
		}
		case lcdapp_return:{
			PhaseMenu.cur_funptr = PhaseMenu.key_function;
			free(tempdata);
			PhaseMenu.fundata = NULL;   //可用可不用
	
			LCD_ClearMenuText();
			PhaseMenu.item_display();
			PhaseMenu.help_display();
			break;
		}
	}
}
/**********************************************************************
删除相位
**********************************************************************/
void del_phase_datainit(void){
	phase_fundata* tempdata;
	
	PhaseMenu.fundata = calloc(1, sizeof(phase_fundata));
	tempdata = (phase_fundata*) PhaseMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->period_sel = 0;
		tempdata->phase_sel = 0;
		tempdata->crossway = 0;
		tempdata->cutdown = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel];
		tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel];
		tempdata->state = lcdapp_ready;
	}
	else{
		return;
		//tempdata->state = lcdapp_return;
	}
	
