xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	del_phase_main(Nothing);
}
void del_phase_update(uint8_t crossway, uint8_t sel, uint16_t crossway_phase, uint8_t phase_sel, uint8_t period_sel, uint8_t cutdown){
	uint8_t i;
	uint8_t lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;
	for(i=0; i<4; i++){
		if(i == sel){
			LCD_Inv();
		}
		switch (i){
			case 0: {
				//LCD_WriteText2(3, 80, "灯组");
				LCD_WriteText2(7, 80, (uint8_t*)Weekday_Table[crossway+1]);
				break;
			}
			case 1: {
				LCD_WriteChar2(8, 98, Number_Table[(period_sel+1)/10]);
				LCD_WriteChar1(Number_Table[(period_sel+1)%10]);
				break;
			}
			case 2: {
				LCD_WriteChar2(19, 98, Number_Table[(phase_sel+1)/10]);
				LCD_WriteChar1(Number_Table[(phase_sel+1)%10]);
				break;
			}
			case 3: {
				LCD_WriteText2(9, 206, "删除");
				break;
			}
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
	for(i=0; i<7; i++){
		LCD_SetCursor(Func_PhaseInfo_Place[i][0], Func_PhaseInfo_Place[i][1]);
		switch (i){
			case 0: {
				if((crossway_phase&LeftGreen) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&LeftRed) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else if((crossway_phase&LeftYellow) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[2]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 1: {
				if((crossway_phase&StraightGreen) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&StraightRed) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else if((crossway_phase&StraightYellow) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[2]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 2: {
				if((crossway_phase&RightGreen) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&RightRed) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else if((crossway_phase&RightYellow) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[2]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 3: {
				if((crossway_phase&BackGreen) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&BackRed) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else if((crossway_phase&BackYellow) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[2]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 4: {
				if((crossway_phase&SideWalk1Green) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&SideWalk1Red) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 5: {
				if((crossway_phase&SideWalk2Green) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[0]);
				}
				else if((crossway_phase&SideWalk2Red) != 0x0000){
					LCD_WriteText1((uint8_t*)LedColor_Table[1]);
				}
				else{
					LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
				}
				break;
			}
			case 6: {
				LCD_WriteChar1(Number_Table[cutdown/10]);
				LCD_WriteChar1(Number_Table[cutdown%10]);
				break;
			}
			default: break;
		}
	}
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void del_phase_interface(void){
	phase_fundata* tempdata;
    uint8_t lcd_flag_temp = LCD_FLAG_Using;

	tempdata = (phase_fundata*) PhaseMenu.fundata;

LCD_FLAG_Using = 1;
	LCD_ClearItemAllText();
	
	LCD_SetAppwindow(0, 239, 0, 39);
	
	LCD_WriteText2(2, 80, "\x11灯组  \x10 (×:表示该灯不亮)" );
	LCD_WriteText2(2, 98, "时段【  】 相位【  】");
	LCD_WriteText2(2, 126, "左转 [  ] 直行 [  ]");
	LCD_WriteText2(2, 146, "右转 [  ] 调头 [  ]");
	LCD_WriteText2(2, 166, "人行1[  ] 人行2[  ]");
	LCD_WriteText2(2, 186, "相位运行时间:  秒");
	LCD_WriteText2(7, 206, "【    】");
	
	LCD_SetAppwindow(96, 170, 29, 38);
	LCD_WriteText2(29, 76, "删除操作将删除所有灯组的选定时段的相位");
	
	LCD_SetAppwindow(0, 239, 0, 39); 

	LCD_WriteText2(29, 176, "\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "\x18\x19:选择");
	
	del_phase_update(tempdata->crossway, tempdata->sel, tempdata->crossway_phase, tempdata->phase_sel, tempdata->period_sel, tempdata->cutdown);

LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void del_phase(KEY_TypeDef key){
	phase_fundata* tempdata;
	uint8_t i,j;

	tempdata = (phase_fundata*) PhaseMenu.fundata;
	
	switch(tempdata->state){
		case lcdapp_cmd: 
		case lcdapp_saved: 
		case lcdapp_notsaved:{
			switch (key){
				case KEY3:  if(tempdata->sel==0) tempdata->sel=3; else tempdata->sel--; break;
				case KEY4:  if(tempdata->sel==3) tempdata->sel=0; else tempdata->sel++; break;
				case KEY1:	{
					switch(tempdata->sel){
						case 0: if(tempdata->crossway < 5) tempdata->crossway ++; else tempdata->crossway = 0; break;
						case 1: if(tempdata->period_sel < my_Schedule.TimeTable_Number-1) tempdata->period_sel ++; else tempdata->period_sel = 0; tempdata->phase_sel=0; break;
						case 2: if(tempdata->phase_sel < my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1) tempdata->phase_sel ++; else tempdata->phase_sel = 0; break;
						default: break;
					}
					tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel];
					tempdata->cutdown = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel];
					break;
				}
				case KEY2:	{
					switch(tempdata->sel){
						case 0: if(tempdata->crossway > 0) tempdata->crossway --; else tempdata->crossway = 5; break;
						case 1: if(tempdata->period_sel > 0) tempdata->period_sel --; else tempdata->period_sel= my_Schedule.TimeTable_Number-1; tempdata->phase_sel=0;break;
						case 2: if(tempdata->phase_sel > 0) tempdata->phase_sel --; else tempdata->phase_sel = my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1; break;
						default: break;
					}
					tempdata->crossway_phase = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[tempdata->crossway][tempdata->phase_sel];
					tempdata->cutdown = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel];
					break;
				}
				case KEY5:  {
					if(tempdata->sel == 3){
						if(tempdata->state == lcdapp_cmd){
							tempdata->state = lcdapp_need_confirm;
							tempdata->sel = 4;
							
							LCD_WriteText2(2, 223, "【  】 【  】");
							keyfunction_clear_help();
							keyfunction_help("再按一次确定键予以保存");
							/*
							LCD_Inv();
							LCD_WriteText2(4, 223, "是");
							LCD_NoInv();
							*/
						}
						/*
						else if(tempdata->state == lcdapp_need_confirm){
							tempdata->state = lcdapp_need_saved;
		
							if(my_Schedule.PhaseTable[periodoftime].Phase_Number > 1){
								while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);
		
								RTC_WaitForLastTask();
								RTC_ITConfig(RTC_IT_SEC, DISABLE);
				
								for(j=0; j<6; j++){	 //j:crossway
									for(i=tempdata->phase_sel; i<my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1; i++){
										my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][i] = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][i+1];
									} 
								}
								for(i=tempdata->phase_sel; i<my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1; i++){
									my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[i] = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[i+1];;
								}
								for(j=0; j<6; j++){
									my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1] = 0xFC00;
								}
								my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1] = 0;
								my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number -= 1;
								
								RTC_WaitForLastTask();
								RTC_ITConfig(RTC_IT_SEC, ENABLE);
			
								tempdata->phase_sel = my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1;
							}
						}*/
					}	
					break;
				}
				case KEY6:	tempdata->state = lcdapp_return;  break;
				case Nothing: goto del_phase_refresh;
				default: break;
			}
			break;
		}
		case lcdapp_need_confirm:{
			switch(key){
				case KEY3: 
				case KEY4: if(tempdata->sel == 4) tempdata->sel = 5; else tempdata->sel = 4; break;
				case KEY5: {
					if(tempdata->sel == 4){
						tempdata->state = lcdapp_saved;
		
						if(my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number > 1){
							while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);
	
							RTC_WaitForLastTask();
							RTC_ITConfig(RTC_IT_SEC, DISABLE);
			
							for(j=0; j<6; j++){	 //j:crossway
								for(i=tempdata->phase_sel; i<my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1; i++){
									my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][i] = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][i+1];
								} 
							}
							for(i=tempdata->phase_sel; i<my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1; i++){
								my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[i] = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[i+1];;
							}
							for(j=0; j<6; j++){
								my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1] = 0xFC00;
							}
							my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1] = 0;
							my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number -= 1;
							
							RTC_WaitForLastTask();
							RTC_ITConfig(RTC_IT_SEC, ENABLE);
		
							tempdata->phase_sel = my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1;
						}
					}
					else tempdata->state = lcdapp_notsaved;
					break;
				}
				case KEY6: {
					tempdata->state = lcdapp_notsaved;
					break;
				}
				case Nothing: goto del_phase_refresh;
				default: break;
			}
		}
	}
	goto del_phase_havekey;

del_phase_refresh:
	switch(tempdata->state){
		case lcdapp_need_confirm:
		case lcdapp_cmd: break;
		case lcdapp_saved:
		case lcdapp_notsaved:{
			tempdata->state = lcdapp_cmd;
			keyfunction_clear_help();
			break;
		}
	}
	return;

del_phase_havekey:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_need_confirm:{
			for(i=4; i<6; i++){
				if(i == tempdata->sel) LCD_Inv();
				switch(i){
					case 4: LCD_WriteText2(4, 223, "是");  break;
					case 5: LCD_WriteText2(11, 223, "否"); break;
					default:break;
				}
				if(i == tempdata->sel) LCD_NoInv();
			}
			break;
		}
		case lcdapp_saved:{
			keyfunction_clear_help();
			keyfunction_help("操作成功");
			LCD_WriteText2(2, 223, "             ");
			break;
		}
		case lcdapp_notsaved:{
			keyfunction_clear_help();
			keyfunction_help("取消操作");
			LCD_WriteText2(2, 223, "             ");
			break;
		}
		//case lcdapp_cmd:{
			//del_phase_update(tempdata->crossway, tempdata->sel, tempdata->crossway_phase, tempdata->phase_sel, tempdata->period_sel, tempdata->cutdown);
			//break;
		//}
		default: break;
	}
	del_phase_update(tempdata->crossway, tempdata->sel, tempdata->crossway_phase, tempdata->phase_sel, tempdata->period_sel, tempdata->cutdown);
}
void del_phase_main(KEY_TypeDef key){
	phase_fundata* tempdata;

	tempdata = (phase_fundata*) PhaseMenu.fundata;

	if(tempdata != NULL){
		switch(tempdata->state){
			case lcdapp_ready: del_phase_interface(); /*set_phase_update(tempdata->crossway, tempdata->sel, tempdata->crossway_phase, tempdata->phase_sel, tempdata->period_sel, tempdata->cutdown);*/ tempdata->state = lcdapp_cmd; break;
			case lcdapp_saved:
			case lcdapp_notsaved:
			case lcdapp_need_confirm:
			case lcdapp_cmd:{
				del_phase(key);
				break;
			}
			case lcdapp_return:{
				PhaseMenu.cur_funptr = PhaseMenu.key_function;
				free(tempdata);
				PhaseMenu.fundata = NULL;   //可用可不用
		
				LCD_ClearMenuText();
				PhaseMenu.item_display();
				PhaseMenu.help_display();
				break;
			}
		}
	}
	else{
		LCD_ClearMenuText();
		PhaseMenu.item_display();
		PhaseMenu.help_display();
	}
}

/**********************************************************************
添加相位
**********************************************************************/
typedef struct{
	uint8_t sel;
	uint8_t period_sel, phase_sel;
	uint8_t option;
	lcd_appstate state;
}add_phase_fundata;
void add_phase_datainit(void){
	add_phase_fundata* tempdata;
	
