xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	PhaseMenu.fundata = calloc(1, sizeof(add_phase_fundata));
	tempdata = (add_phase_fundata*) PhaseMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->period_sel = 0;
		tempdata->phase_sel = 0;
		tempdata->option = 0;
		tempdata->state = lcdapp_ready;
	}
	else{
		return;
	}
	
	add_phase_main(Nothing);
}
void add_phase_update(uint8_t sel, uint8_t period_sel, uint8_t phase_sel, uint8_t options){
	uint8_t i;
	uint8_t lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;
	for(i=0; i<4; i++){
		if(i == sel)
		{
			LCD_Inv();
		}
		LCD_SetCursor(Func_AddPhase_Place[i][0], Func_AddPhase_Place[i][1]);
		switch (i){
			case 0:	LCD_WriteChar1(Number_Table[(period_sel+1)/10]); LCD_WriteChar1(Number_Table[(period_sel+1)%10]); break;
			case 1:	LCD_WriteChar1(Number_Table[(phase_sel+1)/10]); LCD_WriteChar1(Number_Table[(phase_sel+1)%10]); break;
			case 2:	if(options == 0) LCD_WriteText1("向上插入"); else LCD_WriteText1("向下插入");	break;
			case 3:	LCD_WriteText1("生成相位");	break;
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void add_phase_interface(void){
	add_phase_fundata* tempdata;
	uint8_t lcd_flag_temp = LCD_FLAG_Using;

	tempdata = (add_phase_fundata*) PhaseMenu.fundata;
LCD_FLAG_Using = 1;
	LCD_ClearItemAllText();
			
	LCD_SetAppwindow(75, 239, 2, 28);
	
	LCD_WriteText2(2, 80, "请设置要添加的相位位置,添加的相位初始时间为0,初始相位全为红灯");
	LCD_WriteText2(5, 150, "时段【  】 相位【  】");
	LCD_WriteText2(2, 180, "【        】【        】");
	
	LCD_SetAppwindow(96, 170, 29, 38);
	LCD_WriteText2(29, 96, "在选定时段和相位,按照设定添加一个初始相位");
	
	LCD_SetAppwindow(0, 239, 0, 39); 

	LCD_WriteText2(29, 176, "\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "\x18\x19:选择");
	
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	add_phase_update(tempdata->sel, tempdata->period_sel, tempdata->phase_sel, tempdata->option);
}
void add_phase(KEY_TypeDef key){
	add_phase_fundata* tempdata;
	uint8_t i, j;

	tempdata = (add_phase_fundata*) PhaseMenu.fundata;

	switch (key){
		case KEY3:  if(tempdata->sel==0) tempdata->sel=3; else tempdata->sel--; break;
		case KEY4:  if(tempdata->sel==3) tempdata->sel=0; else tempdata->sel++; break;
		case KEY1:	{
			switch(tempdata->sel){
				case 0: if(tempdata->period_sel < my_Schedule.TimeTable_Number-1) tempdata->period_sel++; break;
				case 1: if(tempdata->phase_sel < my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1) tempdata->phase_sel ++;break;
				case 2: if(tempdata->option == 0) tempdata->option = 1; else tempdata->option = 0; break;
				//case 2: break;
				default: break;
			}
			break;
		}
		case KEY2:	{
			switch(tempdata->sel){
				case 0: if(tempdata->period_sel > 0) tempdata->period_sel --; break;
				case 1: if(tempdata->phase_sel > 0) tempdata->phase_sel --; break;
				case 2: if(tempdata->option == 0) tempdata->option = 1; else tempdata->option = 0; break;
				//case 2: break;
				default: break;
			}
			break;
		}
		case KEY5:  {
			if(tempdata->sel == 3){
				if(my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number < 16){	 //判断相位数是否满了
					while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);
					
					RTC_WaitForLastTask();
					RTC_ITConfig(RTC_IT_SEC, DISABLE);

					//while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);
					
					if(tempdata->option == 1){   //向下插入相位模式
						if(tempdata->phase_sel != my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number-1){
							for(i=my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number; i>tempdata->phase_sel+1; i--){
								for(j=0; j<6; j++){
									my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][i] = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][i-1];
								}
								my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[i] = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[i-1];
							}
						}
						for(j=0; j<6; j++){
							my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][tempdata->phase_sel+1] = 0xFC00;
							//my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i] = 0xFC00;
						}
						my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel+1] = 7;
						//my_Schedule.PhaseTable[periodoftime].Last_Time[i] = 0;
					}
					else{  //options == 0  向上插入相位模式
						for(i=i=my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number; i>tempdata->phase_sel; i--){
							for(j=0; j<6; j++){
								my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][i] = my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][i-1];
							}
							my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[i] = my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[i-1];
						}	
						for(j=0; j<6; j++){
							my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[j][tempdata->phase_sel] = 0xFC00;
							//my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i] = 0xFC00;
						}
						my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[tempdata->phase_sel] = 7;
						//my_Schedule.PhaseTable[periodoftime].Last_Time[i] = 0;
					}
					my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number ++;
					
					RTC_WaitForLastTask();
					RTC_ITConfig(RTC_IT_SEC, ENABLE);

					tempdata->state = lcdapp_saved;
				}
				else tempdata->state = lcdapp_notsaved;
			}
			break;
		}
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case Nothing: goto add_phase_refresh; //break;
		default: break;
	}
	goto add_phase_havekey;

add_phase_refresh:
	switch(tempdata->state){
		case lcdapp_saved:
		case lcdapp_notsaved:{
			tempdata->state = lcdapp_cmd;
			//keyfunction_clear_help();
			LCD_SetAppwindow(96, 170, 29, 38);
			LCD_WriteText2(29, 96, "在选定时段和相位,按照设定添加一个初始相位");	
			LCD_SetAppwindow(0, 239, 0, 39);
			break;
		}
		default: break;
	}
	return;

add_phase_havekey:
	KEY_PressMinus();
	switch(tempdata->state){
		case lcdapp_saved:{
			keyfunction_help("操作成功");
			break;
		}
		case lcdapp_notsaved:{
			keyfunction_help("取消操作");
			break;
		}
		case lcdapp_cmd:{
			add_phase_update(tempdata->sel, tempdata->period_sel, tempdata->phase_sel, tempdata->option);
			break;
		}
		default: break;
	}	
}
void add_phase_main(KEY_TypeDef key){
	add_phase_fundata* tempdata;

	tempdata = (add_phase_fundata*) PhaseMenu.fundata;

	if(tempdata != NULL){
		switch(tempdata->state){
			case lcdapp_ready: add_phase_interface(); tempdata->state = lcdapp_cmd; break;
			case lcdapp_saved:
			case lcdapp_notsaved:
			case lcdapp_cmd:{
				add_phase(key);
				break;
			}
			case lcdapp_return:{
				PhaseMenu.cur_funptr = PhaseMenu.key_function;
				free(tempdata);
				PhaseMenu.fundata = NULL;   //可用可不用
		
				LCD_ClearMenuText();
				PhaseMenu.item_display();
				PhaseMenu.help_display();
				break;
			}
		}
	}
	else{
		PhaseMenu.cur_funptr = PhaseMenu.key_function;
		LCD_ClearMenuText();
		PhaseMenu.item_display();
		PhaseMenu.help_display();
	}
}
/**********************************************************************
时段表设置
**********************************************************************/
typedef struct{
	uint8_t sel;
	uint8_t period_sel;
	ShortTime_TypeDef temptime;
	lcd_appstate state;
}set_period_fundata;
void set_period_datainit(void){
	set_period_fundata* tempdata;

