xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
	PeriodOfTimeMenu.fundata = calloc(1, sizeof(set_period_fundata));
	tempdata = (set_period_fundata*) PeriodOfTimeMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->period_sel = 0;
		tempdata->temptime = my_Schedule.TimeTable[tempdata->period_sel];
		tempdata->state = lcdapp_ready;
	}
	else{
		return;//考虑将数据初始化返回是否分配成功
	}
}
void set_period_update(uint8_t sel, uint8_t period_sel, struct ShortTime time){
	uint8_t i;
	uint8_t lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;
	for(i=0; i<4; i++){
		if(i == sel){
			LCD_Inv();
		}
		LCD_SetCursor(Func_SetPeriodOfTime_Place[i][0], Func_SetPeriodOfTime_Place[i][1]);
		switch (i){
			case 0:	LCD_WriteChar1(Number_Table[(period_sel+1)/10]); LCD_WriteChar1(Number_Table[(period_sel+1)%10]); break;
			case 1:	LCD_WriteChar1(Number_Table[time.hour/10]); LCD_WriteChar1(Number_Table[time.hour%10]); break;
			case 2: LCD_WriteChar1(Number_Table[time.min/10]); LCD_WriteChar1(Number_Table[time.min%10]); break;
			case 3:	LCD_WriteChar1(Number_Table[time.sec/10]); LCD_WriteChar1(Number_Table[time.sec%10]); break;
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void set_period_interface(void){
	uint8_t lcd_flag_temp;
	set_period_fundata* tempdata;

	tempdata = (set_period_fundata*) PeriodOfTimeMenu.fundata;
	lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;
		
	LCD_ClearItemAllText();

	LCD_SetAppwindow(96, 170, 29, 38);
	LCD_WriteText2(29, 96, "设置时段时间");
	
	LCD_SetAppwindow(0, 239, 0, 39); 
	
	LCD_WriteText2(2, 80, "请设置所选时段的时间");
	LCD_WriteText2(8, 100, "选择时段【  】");
	LCD_WriteText2(2, 120, "时段时间:  -  -  ");

	LCD_WriteText2(29, 176, "\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "\x18\x19:选择");
		
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	set_period_update(tempdata->sel, tempdata->period_sel, tempdata->temptime);
}
void set_period(KEY_TypeDef key){
	set_period_fundata* tempdata;

	tempdata = (set_period_fundata*) PeriodOfTimeMenu.fundata;

	switch (key){
		case KEY3:  if(tempdata->sel==0) tempdata->sel=3; else tempdata->sel--; break;
		case KEY4:  if(tempdata->sel==3) tempdata->sel=0; else tempdata->sel++; break;
		case KEY1:	{
			switch (tempdata->sel){
				case 0: {
					if(tempdata->period_sel<my_Schedule.TimeTable_Number-1){ 
						tempdata->period_sel++;
						tempdata->temptime = my_Schedule.TimeTable[tempdata->period_sel]; 
					}														    
					break;
				}
				case 1: {
					if(tempdata->period_sel<my_Schedule.TimeTable_Number-1){ 
						if(tempdata->temptime.hour<my_Schedule.TimeTable[tempdata->period_sel+1].hour-1){ 
							tempdata->temptime.hour ++;
						}
						else if(tempdata->temptime.min<=my_Schedule.TimeTable[tempdata->period_sel+1].min && tempdata->temptime.sec<=my_Schedule.TimeTable[tempdata->period_sel+1].sec){
							tempdata->temptime.hour ++;
						}	
					}
					else{
						if(tempdata->temptime.hour<23)
							tempdata->temptime.hour ++;
					}
					break;
				}
				case 2: {
					if(tempdata->period_sel<my_Schedule.TimeTable_Number-1 && tempdata->temptime.hour==my_Schedule.TimeTable[tempdata->period_sel+1].hour){
						if(tempdata->temptime.min<my_Schedule.TimeTable[tempdata->period_sel+1].min){
							tempdata->temptime.min ++;
						}
					}
					else{
						if(tempdata->temptime.min<59)
							tempdata->temptime.min ++;
					}
					break;
				}
				case 3: {
					if(tempdata->period_sel<my_Schedule.TimeTable_Number-1 && tempdata->temptime.hour==my_Schedule.TimeTable[tempdata->period_sel+1].hour && tempdata->temptime.min==my_Schedule.TimeTable[tempdata->period_sel+1].min){
						if(tempdata->temptime.sec<my_Schedule.TimeTable[tempdata->period_sel+1].sec-1){
							tempdata->temptime.sec ++;
						}
					}
					else{
						if(tempdata->temptime.sec<59)
							tempdata->temptime.sec ++;
					}
					break;
				}
				default: break;
			}
			break;
		}
		case KEY2:	{
			switch (tempdata->sel){
				case 0: {
					if(tempdata->period_sel>0){ 
						tempdata->period_sel --;
						tempdata->temptime = my_Schedule.TimeTable[tempdata->period_sel];
					} 
					break;
				}
				case 1: {
					if(tempdata->period_sel>0){
						if(tempdata->temptime.hour>my_Schedule.TimeTable[tempdata->period_sel-1].hour+1){
							tempdata->temptime.hour --;
						}
						else if(tempdata->temptime.min>=my_Schedule.TimeTable[tempdata->period_sel-1].min && tempdata->temptime.sec>my_Schedule.TimeTable[tempdata->period_sel-1].sec+1){
							tempdata->temptime.hour --;
						}
					}
					else{
						if(tempdata->temptime.hour>0) 
							tempdata->temptime.hour --;
					}
					break;
				}
				case 2: {
					if(tempdata->period_sel>0 && tempdata->temptime.hour==my_Schedule.TimeTable[tempdata->period_sel-1].hour){
						if(tempdata->temptime.min>my_Schedule.TimeTable[tempdata->period_sel-1].min)
							tempdata->temptime.min --;
					}
					else{
						if(tempdata->temptime.min>0)
							tempdata->temptime.min --;
					} 
					break;
				}
				case 3: {
					if(tempdata->period_sel>0 && tempdata->temptime.hour==my_Schedule.TimeTable[tempdata->period_sel-1].hour && tempdata->temptime.min==my_Schedule.TimeTable[tempdata->period_sel-1].min){
						if(tempdata->temptime.sec>my_Schedule.TimeTable[tempdata->period_sel-1].sec+1)
							tempdata->temptime.sec --;
					}
					else{
						if(tempdata->temptime.sec>0)
							tempdata->temptime.sec --;
					} 
					break;
				}
				default: break;
			}
			break;
		}
		case KEY5_Cont:  {							
			while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);
			
			RTC_WaitForLastTask();
			RTC_ITConfig(RTC_IT_SEC, DISABLE);
			
			//while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);

			my_Schedule.TimeTable[tempdata->period_sel] = tempdata->temptime;

			RTC_WaitForLastTask();
			RTC_ITConfig(RTC_IT_SEC, ENABLE);

			tempdata->state = lcdapp_saved;

			break;
		}
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case Nothing: goto set_period_refresh;
		default: break;
	}
	goto set_period_havekey;

set_period_refresh:
	switch(tempdata->state){
		case lcdapp_saved:{
			tempdata->state = lcdapp_cmd;
			keyfunction_clear_help();
			break;
		}
	}
	return;

set_period_havekey:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_saved:{
			keyfunction_help("操作成功");
			break;
		}
		case lcdapp_cmd:{
			set_period_update(tempdata->sel, tempdata->period_sel, tempdata->temptime);
			break;
		}
		default: break;
	}
}
void set_period_main(KEY_TypeDef key){
	set_period_fundata* tempdata;

	tempdata = (set_period_fundata*) PeriodOfTimeMenu.fundata;
	
	if(tempdata != NULL){
		switch(tempdata->state){
			case lcdapp_ready: set_period_interface(); tempdata->state = lcdapp_cmd; break;
			case lcdapp_saved:
			//case lcdapp_notsaved:
			case lcdapp_cmd:{
				set_period(key);
				break;
			}
			case lcdapp_return:{
				PeriodOfTimeMenu.cur_funptr = PeriodOfTimeMenu.key_function;
				free(tempdata);
				PeriodOfTimeMenu.fundata = NULL;   //可用可不用
		
				LCD_ClearMenuText();
				PeriodOfTimeMenu.item_display();
				PeriodOfTimeMenu.help_display();
				break;
			}
		}
	}
	else{
		PeriodOfTimeMenu.cur_funptr = PeriodOfTimeMenu.key_function;
		LCD_ClearMenuText();
		PeriodOfTimeMenu.item_display();
		PeriodOfTimeMenu.help_display();
	}
}
/**********************************************************************
删除时段表
**********************************************************************/
typedef struct{
	uint8_t sel;
	uint8_t period_sel;
	ShortTime_TypeDef start_time, end_time;
	lcd_appstate state; 
}del_period_fundata;
