xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
void del_period_datainit(void){
	del_period_fundata* tempdata;

	PeriodOfTimeMenu.fundata = calloc(1, sizeof(del_period_fundata));
	tempdata = (del_period_fundata*) PeriodOfTimeMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->period_sel = 0;
		tempdata->start_time = my_Schedule.TimeTable[tempdata->period_sel];
		if(my_Schedule.TimeTable_Number == 1) tempdata->end_time = my_Schedule.TimeTable[0];
		else tempdata->end_time = my_Schedule.TimeTable[1];
		tempdata->state = lcdapp_ready;
	}
	else{
		return;//考虑将数据初始化返回是否分配成功
	}
}
void del_period_update(struct ShortTime start_time, struct ShortTime end_time, uint8_t sel, uint8_t period_sel){
	uint8_t i;
	uint8_t lcd_flag_temp = LCD_FLAG_Using;

LCD_FLAG_Using = 1;
	for(i=0; i<2; i++){
		if(i == sel) LCD_Inv();
		switch(i){
			case 0:	LCD_SetCursor(18, 100); LCD_WriteChar1(Number_Table[(period_sel+1)/10]); LCD_WriteChar1(Number_Table[(period_sel+1)%10]); break;
			case 1: LCD_WriteText2(16, 160, "删除"); break;
			default: break;
		}
		if(i == sel) LCD_NoInv();
	}

	LCD_SetCursor(13, 120);
	LCD_WriteChar1((start_time.hour<10)?' ':Number_Table[start_time.hour/10]);
	LCD_WriteChar1(Number_Table[start_time.hour%10]);
	LCD_WriteChar1('-');
	LCD_WriteChar1((start_time.min<10)?' ':Number_Table[start_time.min/10]);
	LCD_WriteChar1(Number_Table[start_time.min%10]);
	LCD_WriteChar1('-');
	LCD_WriteChar1((start_time.sec<10)?' ':Number_Table[start_time.sec/10]);
	LCD_WriteChar1(Number_Table[start_time.sec%10]);

	LCD_SetCursor(13, 140);
	LCD_WriteChar1((end_time.hour<10)?' ':Number_Table[end_time.hour/10]);
	LCD_WriteChar1(Number_Table[end_time.hour%10]);
	LCD_WriteChar1('-');
	LCD_WriteChar1((end_time.min<10)?' ':Number_Table[end_time.min/10]);
	LCD_WriteChar1(Number_Table[end_time.min%10]);
	LCD_WriteChar1('-');
	LCD_WriteChar1((end_time.sec<10)?' ':Number_Table[end_time.sec/10]);
	LCD_WriteChar1(Number_Table[end_time.sec%10]);
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
}
void del_period_interface(void){
	del_period_fundata* tempdata;

	uint8_t lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (del_period_fundata*) PeriodOfTimeMenu.fundata;

LCD_FLAG_Using = 1;
	LCD_ClearItemAllText();

	LCD_SetAppwindow(96, 170, 29, 38);
	LCD_WriteText2(29, 96, "删除所选的时段");
	
	LCD_SetAppwindow(0, 239, 0, 39); 
	
	LCD_WriteText2(2, 80, "请选择要删除的时段");
	LCD_WriteText2(8, 100, "选择时段【  】");
	LCD_WriteText2(4, 120, "起始时间:");
	LCD_WriteText2(4, 140, "终止时间:");
	LCD_WriteText2(14, 160, "【    】");

	LCD_WriteText2(29, 176, "\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "\x18\x19:选择");
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}	
	del_period_update(tempdata->start_time, tempdata->end_time, tempdata->sel, tempdata->period_sel);
}
void del_period(KEY_TypeDef key){
	uint8_t i;
	del_period_fundata* tempdata;

	tempdata = (del_period_fundata*) PeriodOfTimeMenu.fundata;

	switch (key){
		case KEY3:  //if(tempdata->sel==0) tempdata->sel=1; else tempdata->sel=0; break;
		case KEY4:  if(tempdata->sel==1) tempdata->sel=0; else tempdata->sel=1; break;
		case KEY1:	{
			if(tempdata->sel == 0){
				if(tempdata->period_sel<my_Schedule.TimeTable_Number-1){
					//Display_FLAG_NextDay = 0; 
					tempdata->period_sel++;
					tempdata->start_time = my_Schedule.TimeTable[tempdata->period_sel];
					if(tempdata->period_sel == my_Schedule.TimeTable_Number-1){
						tempdata->end_time = my_Schedule.TimeTable[0];
						//Display_FLAG_NextDay = 1;
					}
					else{
						tempdata->end_time = my_Schedule.TimeTable[tempdata->period_sel+1]; 
					}
				}
			}
			break;
		}
		case KEY2:	{
			if(tempdata->sel == 0){
				if(tempdata->period_sel>0){ 
					tempdata->period_sel --;
					tempdata->start_time = my_Schedule.TimeTable[tempdata->period_sel];
					tempdata->end_time = my_Schedule.TimeTable[tempdata->period_sel+1];
				} 
			}
			break;
		}
		case KEY5_Cont:  {
			if(tempdata->sel == 1){							
				if(my_Schedule.TimeTable_Number >1){
					while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);
	
					RTC_WaitForLastTask();
					RTC_ITConfig(RTC_IT_SEC, DISABLE);								
	
					//while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);
					
					for(i=tempdata->period_sel; i<my_Schedule.TimeTable_Number-2; i++){
						my_Schedule.TimeTable[i] = my_Schedule.TimeTable[i+1];
						my_Schedule.PhaseTable[i] = my_Schedule.PhaseTable[i+1];
					}
					my_Schedule.TimeTable_Number --;
	
					if(tempdata->period_sel>0)
						tempdata->period_sel --;
	
					tempdata->start_time = my_Schedule.TimeTable[tempdata->period_sel];
					if(tempdata->period_sel == my_Schedule.TimeTable_Number-1){
						tempdata->end_time = my_Schedule.TimeTable[0];
						//Display_FLAG_NextDay = 1;
					}
					else{
						tempdata->end_time = my_Schedule.TimeTable[tempdata->period_sel+1]; 
					}
	
					RTC_WaitForLastTask();
					RTC_ITConfig(RTC_IT_SEC, ENABLE);
	
				}
				tempdata->state = lcdapp_saved;
			}
			break;
		}
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case Nothing: goto del_period_refresh;
		default: break;
	}
	goto del_period_havekey;

del_period_refresh:
	switch(tempdata->state){
		case lcdapp_saved:{
			tempdata->state = lcdapp_cmd;
			keyfunction_clear_help();
			break;
		}
		default: break;
	}
	return;

del_period_havekey:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_saved:{
			keyfunction_help("操作成功");
			break;
		}
		default: break;
	}
	del_period_update(tempdata->start_time, tempdata->end_time, tempdata->sel, tempdata->period_sel);
}
void del_period_main(KEY_TypeDef key){
	del_period_fundata* tempdata;

	tempdata = (del_period_fundata*) PeriodOfTimeMenu.fundata;

	if(tempdata != NULL){
		switch(tempdata->state){
			case lcdapp_ready: del_period_interface(); tempdata->state = lcdapp_cmd; break;
			case lcdapp_saved:
			//case lcdapp_notsaved:
			case lcdapp_cmd:{
				del_period(key);
				break;
			}
			case lcdapp_return:{
				PeriodOfTimeMenu.cur_funptr = PeriodOfTimeMenu.key_function;
				free(tempdata);
				PeriodOfTimeMenu.fundata = NULL;   //可用可不用
		
				LCD_ClearMenuText();
				PeriodOfTimeMenu.item_display();
				PeriodOfTimeMenu.help_display();
				break;
			}
		}
	}
	else{
		PeriodOfTimeMenu.cur_funptr = PeriodOfTimeMenu.key_function;
		LCD_ClearMenuText();
		PeriodOfTimeMenu.item_display();
		PeriodOfTimeMenu.help_display();
	}
}
/**********************************************************************
添加时段表
**********************************************************************/
typedef struct{
	uint8_t sel;
	uint8_t period_sel;
	ShortTime_TypeDef time;
	lcd_appstate state;
}add_period_fundata;
void add_period_datainit(void){
	add_period_fundata* tempdata;

	PeriodOfTimeMenu.fundata = calloc(1, sizeof(add_period_fundata));
	tempdata = (add_period_fundata*) PeriodOfTimeMenu.fundata;

	if(tempdata != NULL){
		tempdata->sel = 0;
		tempdata->period_sel = 0;
		tempdata->time.hour = 12;
		tempdata->time.min = 0;
		tempdata->time.sec = 0;
		tempdata->state = lcdapp_ready;
	}
	else{
		return;//考虑将数据初始化返回是否分配成功
	}
}
void add_period_update(uint8_t sel, ShortTime_TypeDef time){
	uint8_t i;

	for(i=0; i<4; i++){
		if(i == sel) LCD_Inv();

