xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
		switch (i){
			case 0:	LCD_SetCursor(10, 150); LCD_WriteChar1(Number_Table[time.hour/10]); LCD_WriteChar1(Number_Table[time.hour%10]); break;
			case 1: LCD_SetCursor(13, 150); LCD_WriteChar1(Number_Table[time.min/10]); LCD_WriteChar1(Number_Table[time.min%10]); break;
			case 2:	LCD_SetCursor(16, 150); LCD_WriteChar1(Number_Table[time.sec/10]); LCD_WriteChar1(Number_Table[time.sec%10]); break;
			case 3: LCD_WriteText2(16, 180, "确定");
			default: break;
		}

		if(i == sel) LCD_NoInv();
	}
}
void add_period_interface(void){
	add_period_fundata* tempdata;

	uint8_t lcd_flag_temp = LCD_FLAG_Using;
	tempdata = (add_period_fundata*) PeriodOfTimeMenu.fundata;
LCD_FLAG_Using = 1;
	LCD_ClearItemAllText();
			
	LCD_SetAppwindow(75, 239, 2, 28);
	
	LCD_WriteText2(2, 80, "请设置要添加的时段初始时间，选确定键保存设置");
	LCD_WriteText2(2, 120, "时段起始时间：");
	LCD_WriteText2(10, 150, "  -  -  ");
	LCD_WriteText2(14, 180, "【    】");
	
	LCD_SetAppwindow(96, 170, 29, 38);
	LCD_WriteText2(29, 96, "设置时段，按确定键保存");
	
	LCD_SetAppwindow(0, 239, 0, 39); 

	LCD_WriteText2(29, 176, "\x1A\x1B:移动");
	LCD_WriteText2(29, 196, "\x18\x19:选择");
	
LCD_FLAG_Using = lcd_flag_temp;
if(LCD_FLAG_UpdateIrq == 1 && LCD_FLAG_Using == 0){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
	add_period_update(tempdata->sel, tempdata->time);
}
void add_period(KEY_TypeDef key){
	uint8_t i;
	add_period_fundata* tempdata;

	tempdata = (add_period_fundata*) PeriodOfTimeMenu.fundata;
	
	switch (key){
		case KEY3:  if(tempdata->sel==0) tempdata->sel=3; else tempdata->sel--; break;
		case KEY4:  if(tempdata->sel==3) tempdata->sel=0; else tempdata->sel++; break;
		case KEY1:	{
			switch(tempdata->sel){
				case 0: if(tempdata->time.hour<23) tempdata->time.hour++; else tempdata->time.hour=0; break;
				case 1: if(tempdata->time.min<59) tempdata->time.min++; else tempdata->time.min=0; break;
				case 2: if(tempdata->time.sec<59) tempdata->time.sec++; else tempdata->time.sec=0; break;
				default: break;
			}
			break;
		}
		case KEY2:	{
			switch(tempdata->sel){
				case 0: if(tempdata->time.hour>0) tempdata->time.hour--; else tempdata->time.hour=23; break;
				case 1: if(tempdata->time.min>0) tempdata->time.min--; else tempdata->time.min=59; break;
				case 2: if(tempdata->time.sec>0) tempdata->time.sec--; else tempdata->time.sec=59; break;
				default: break;
			}
			break;
		}
		case KEY5:  {
			if(tempdata->sel == 3){
				if(my_Schedule.TimeTable_Number < 16){	 //判断时段数是否满了
					//判断设置时间位于的时段号
					for(i=0, tempdata->period_sel=my_Schedule.TimeTable_Number; i<my_Schedule.TimeTable_Number; i++){
						if(tempdata->time.hour < my_Schedule.TimeTable[i].hour){
							tempdata->period_sel = i;
							break;
						}
						else if(tempdata->time.hour > my_Schedule.TimeTable[i].hour) continue;
						else{
							if(tempdata->time.min < my_Schedule.TimeTable[i].min){
								tempdata->period_sel = i;
								break;
							}
							else if(tempdata->time.min > my_Schedule.TimeTable[i].min) continue;
							else{
								if(tempdata->time.sec < my_Schedule.TimeTable[i].sec){
									tempdata->period_sel = i;
									break;
								}
								else if(tempdata->time.sec > my_Schedule.TimeTable[i].sec) continue;
								else{
									//时段时间重复了
									//Time_FLAG_Repeatability = 1;
									tempdata->state = lcdapp_error_repeat;
									goto add_period_havekey;
									//break;
								}
							}
						}
					}				
															
					while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);

					RTC_WaitForLastTask();
					RTC_ITConfig(RTC_IT_SEC, DISABLE);

					for(i=my_Schedule.TimeTable_Number; i>tempdata->period_sel; i--){
						my_Schedule.TimeTable[i] = my_Schedule.TimeTable[i-1];
						my_Schedule.PhaseTable[i] = my_Schedule.PhaseTable[i-1];
					}
					my_Schedule.TimeTable[tempdata->period_sel] = tempdata->time;
					my_Schedule.PhaseTable[tempdata->period_sel].Phase_Number = 1;
					my_Schedule.PhaseTable[tempdata->period_sel].Last_Time[0] = 7;
					for(i=0; i<6; i++) my_Schedule.PhaseTable[tempdata->period_sel].Crossway_LED[i][0] = 0xFC00;
					my_Schedule.TimeTable_Number ++;
					
					RTC_WaitForLastTask();
					RTC_ITConfig(RTC_IT_SEC, ENABLE);

					tempdata->state = lcdapp_saved;
				}
				else{										
					tempdata->state = lcdapp_error_full;
				}
			}
			break;
		}
		case KEY6:	tempdata->state = lcdapp_return;  break;
		case Nothing: goto add_period_refresh;
		default: break;
	}				   
	goto add_period_havekey;

add_period_refresh:
	switch(tempdata->state){
		case lcdapp_error_full:
		case lcdapp_error_repeat:
		case lcdapp_saved:{
			tempdata->state = lcdapp_cmd;
			keyfunction_clear_help();
			break;
		}
		default: break;
	}	
	return;

add_period_havekey:
	KEY_PressMinus();

	switch(tempdata->state){
		case lcdapp_error_full:{
			keyfunction_help("时段表已满");
			break;
		}
		case lcdapp_error_repeat:{
			keyfunction_help("时段重叠");
			break;
		}
		case lcdapp_saved:{
			keyfunction_help("操作成功");
			break;
		}
		default: break;
	}
}
void add_period_main(KEY_TypeDef key){
	add_period_fundata* tempdata;

	tempdata = (add_period_fundata*) PeriodOfTimeMenu.fundata;
	
	if(tempdata != NULL){
		switch(tempdata->state){
			case lcdapp_ready: add_period_interface(); tempdata->state = lcdapp_cmd; break;
			case lcdapp_saved:
			//case lcdapp_notsaved:
			case lcdapp_error_repeat:
			case lcdapp_error_full:
			case lcdapp_cmd:{
				add_period(key);
				break;
			}
			case lcdapp_return:{
				PeriodOfTimeMenu.cur_funptr = PeriodOfTimeMenu.key_function;
				free(tempdata);
				PeriodOfTimeMenu.fundata = NULL;   //可用可不用
		
				LCD_ClearMenuText();
				PeriodOfTimeMenu.item_display();
				PeriodOfTimeMenu.help_display();
				break;
			}
		}
	}
	else{
		PeriodOfTimeMenu.cur_funptr = PeriodOfTimeMenu.key_function;
		LCD_ClearMenuText();
		PeriodOfTimeMenu.item_display();
		PeriodOfTimeMenu.help_display();
	}
}




#if MOVE
void Add_PeriodOfTime_Update(uint8_t sel, ShortTime_TypeDef time)
{
	uint8_t i;

	for(i=0; i<4; i++){
		if(i == sel) LCD_Inv();

		switch (i){
			case 0:	LCD_SetCursor(10, 150); LCD_WriteChar1(Number_Table[time.hour/10]); LCD_WriteChar1(Number_Table[time.hour%10]); break;
			case 1: LCD_SetCursor(13, 150); LCD_WriteChar1(Number_Table[time.min/10]); LCD_WriteChar1(Number_Table[time.min%10]); break;
			case 2:	LCD_SetCursor(16, 150); LCD_WriteChar1(Number_Table[time.sec/10]); LCD_WriteChar1(Number_Table[time.sec%10]); break;
			case 3: LCD_WriteText2(16, 180, "确定");
			default: break;
		}

		if(i == sel) LCD_NoInv();
	}
}

void Add_PeriodOfTime(void)
{
	uint8_t KEY_FLAG_Return;
	uint8_t sel;
	uint8_t Menu_Init_Finished;
	uint8_t periodoftime_temp;
	ShortTime_TypeDef time;
	uint8_t Time_FLAG_Repeatability;
	uint8_t i;

	periodoftime_temp = 0;
	Time_FLAG_Repeatability = 0;
	sel = 0;  //对应时 分 秒 确定键
	time.hour = 12;
	time.min = 0;
	time.sec = 0;
	KEY_FLAG_Return = 0;
	Menu_Init_Finished = 0;

	while(1){
		if(Menu_Init_Finished == 0){

LCD_FLAG_Using = 1;
		
			LCD_ClearItemAllText();
			
			LCD_SetAppwindow(75, 239, 2, 28);
			
			LCD_WriteText2(2, 80, "请设置要添加的时段初始时间，选确定键保存设置");
			LCD_WriteText2(2, 120, "时段起始时间：");
			LCD_WriteText2(10, 150, "  -  -  ");
			LCD_WriteText2(14, 180, "【    】");
			
			LCD_SetAppwindow(96, 170, 29, 38);
			LCD_WriteText2(29, 96, "设置时段，按确定键保存");
			
			LCD_SetAppwindow(0, 239, 0, 39); 
		
