xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
			LCD_WriteText2(29, 176, "\x1A\x1B:移动");
			LCD_WriteText2(29, 196, "\x18\x19:选择");
			
			Add_PeriodOfTime_Update(sel, time);
		
LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
			Menu_Init_Finished = 1;
		}

		if(KEY_Press > 0){
			switch (KEY_Buffer[KEY_BufferPointer]){
				case KEY6:  if(sel==0) sel=3; else sel--; break;
				case KEY1:  if(sel==3) sel=0; else sel++; break;
				case KEY2:	{
								switch(sel){
									case 0: if(time.hour<23) time.hour++; else time.hour=0; break;
									case 1: if(time.min<59) time.min++; else time.min=0; break;
									case 2: if(time.sec<59) time.sec++; else time.sec=0; break;
									default: break;
								}
								break;
							}
				case KEY3:	{
								switch(sel){
									case 0: if(time.hour>0) time.hour--; else time.hour=23; break;
									case 1: if(time.min>0) time.min--; else time.min=59; break;
									case 2: if(time.sec>0) time.sec--; else time.sec=59; break;
									default: break;
								}
								break;
							}
				case KEY4:  {
								if(sel == 3){
									if(my_Schedule.TimeTable_Number < 16){	 //判断时段数是否满了
										//判断设置时间位于的时段号
										for(i=0, periodoftime_temp=my_Schedule.TimeTable_Number; i<my_Schedule.TimeTable_Number; i++){
											if(time.hour < my_Schedule.TimeTable[i].hour){
												periodoftime_temp = i;
												break;
											}
											else if(time.hour > my_Schedule.TimeTable[i].hour) continue;
											else{
												if(time.min < my_Schedule.TimeTable[i].min){
													periodoftime_temp = i;
													break;
												}
												else if(time.min > my_Schedule.TimeTable[i].min) continue;
												else{
													if(time.sec < my_Schedule.TimeTable[i].sec){
														periodoftime_temp = i;
														break;
													}
													else if(time.sec > my_Schedule.TimeTable[i].sec) continue;
													else{
														//时段时间重复了
														Time_FLAG_Repeatability = 1;
														break;
													}
												}
											}
										}

										if(Time_FLAG_Repeatability == 1){
											LCD_FLAG_Using = 1;

											LCD_ClearItemText();
											LCD_SetAppwindow(0, 239, 0, 39);
											LCD_WriteText2(8, 150, "相位时间重复");										

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
											delay_us(10000);
											Menu_Init_Finished = 0;
											Time_FLAG_Repeatability = 0;
										}
										else{										
											while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);

											RTC_WaitForLastTask();
											RTC_ITConfig(RTC_IT_SEC, DISABLE);

											for(i=my_Schedule.TimeTable_Number; i>periodoftime_temp; i--){
												my_Schedule.TimeTable[i] = my_Schedule.TimeTable[i-1];
												my_Schedule.PhaseTable[i] = my_Schedule.PhaseTable[i-1];
											}
											my_Schedule.TimeTable[periodoftime_temp] = time;
											my_Schedule.PhaseTable[periodoftime_temp].Phase_Number = 1;
											my_Schedule.PhaseTable[periodoftime_temp].Last_Time[0] = 0;
											for(i=0; i<6; i++)
												my_Schedule.PhaseTable[periodoftime_temp].Crossway_LED[i][0] = 0xFC00;
											my_Schedule.TimeTable_Number ++;
											
											RTC_WaitForLastTask();
											RTC_ITConfig(RTC_IT_SEC, ENABLE);

LCD_FLAG_Using = 1;

											LCD_ClearItemText();
											LCD_SetAppwindow(0, 239, 0, 39);
											LCD_WriteText2(8, 150, "相位添加成功");										

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
											delay_us(10000);
											Menu_Init_Finished = 0;
										}
									}
									else{										
LCD_FLAG_Using = 1;

										LCD_ClearItemText();
										LCD_SetAppwindow(0, 239, 0, 39);
										LCD_WriteText2(8, 150, "时段数已满");										

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
										delay_us(10000);
										Menu_Init_Finished = 0;
									}
								}
								break;
							}
				case KEY5:	KEY_FLAG_Return = 1;  break;
			}

			KEY_PressMinus();

			if(KEY_FLAG_Return == 1){
				LCD_DisplayOtherMenu(Current_Menu);
				return;
			}

LCD_FLAG_Using = 1;

			Add_PeriodOfTime_Update(sel, time);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
		}
	}
}
#endif
#if MOVE
void Add_PhaseInfo_Update(uint8_t periodoftime, uint8_t phasenum, uint8_t sel, uint8_t options)
{
	uint8_t i;

	for(i=0; i<4; i++){
		if(i == sel)
		{
			LCD_Inv();
		}
		LCD_SetCursor(Func_AddPhase_Place[i][0], Func_AddPhase_Place[i][1]);
		switch (i){
			case 0:	LCD_WriteChar1(Number_Table[(periodoftime+1)/10]); LCD_WriteChar1(Number_Table[(periodoftime+1)%10]); break;
			case 1:	LCD_WriteChar1(Number_Table[(phasenum+1)/10]); LCD_WriteChar1(Number_Table[(phasenum+1)%10]); break;
			case 2:	if(options == 0) LCD_WriteText1("向上插入"); else LCD_WriteText1("向下插入");	break;
			case 3:	LCD_WriteText1("生成相位");	break;
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
}

void Add_Phase(void)
{
	uint8_t KEY_FLAG_Return;
	uint8_t sel;
	uint8_t periodoftime, phasenum;
	uint8_t options;
	uint8_t Menu_Init_Finished;
	//uint8_t cutdown;
	uint8_t i, j;

	KEY_FLAG_Return = 0;
	Menu_Init_Finished = 0;
	sel = 0;
	periodoftime = 0;
	phasenum = 0;
	options = 0;
	//cutdown = 0;

	while(1){
		if(Menu_Init_Finished == 0){

LCD_FLAG_Using = 1;
		
			LCD_ClearItemAllText();
			
			LCD_SetAppwindow(75, 239, 2, 28);
			
			LCD_WriteText2(2, 80, "请设置要添加的相位位置,添加的相位初始时间为0,初始相位全为红灯");
			LCD_WriteText2(5, 150, "时段【  】 相位【  】");
			LCD_WriteText2(2, 180, "【向上插入】【生成相位】");
			
			LCD_SetAppwindow(96, 170, 29, 38);
			LCD_WriteText2(29, 96, "在选定时段和相位,按照设定添加一个初始相位");
			
			LCD_SetAppwindow(0, 239, 0, 39); 
		
			LCD_WriteText2(29, 176, "\x1A\x1B:移动");
			LCD_WriteText2(29, 196, "\x18\x19:选择");
			
			Add_PhaseInfo_Update(periodoftime, phasenum, sel, options);
		
LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
			Menu_Init_Finished = 1;
		}

