xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
		if(KEY_Press > 0){
			switch (KEY_Buffer[KEY_BufferPointer]){
				case KEY6:  if(sel==0) sel=3; else sel--; break;
				case KEY1:  if(sel==3) sel=0; else sel++; break;
				case KEY2:	{
								switch(sel){
									case 0: if(periodoftime < my_Schedule.TimeTable_Number-1) periodoftime++; break;
									case 1: if(phasenum < my_Schedule.PhaseTable[periodoftime].Phase_Number-1) phasenum ++;break;
									case 2: if(options == 0) options = 1; else options = 0; break;
									//case 2: break;
									default: break;
								}
								break;
							}
				case KEY3:	{
								switch(sel){
									case 0: if(periodoftime > 0) periodoftime --; break;
									case 1: if(phasenum > 0) phasenum --; break;
									case 2: if(options == 0) options = 1; else options = 0; break;
									//case 2: break;
									default: break;
								}
								break;
							}
				case KEY4:  {
								if(sel == 3){
									if(my_Schedule.PhaseTable[periodoftime].Phase_Number < 16){	 //判断相位数是否满了
										RTC_WaitForLastTask();
										RTC_ITConfig(RTC_IT_SEC, DISABLE);
										
										while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);
										
										if(options == 1){   //向下插入相位模式
											if(phasenum != my_Schedule.PhaseTable[periodoftime].Phase_Number-1){
												for(i=my_Schedule.PhaseTable[periodoftime].Phase_Number; i>phasenum+1; i--){
													for(j=0; j<6; j++){
														my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i] = my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i-1];
													}
													my_Schedule.PhaseTable[periodoftime].Last_Time[i] = my_Schedule.PhaseTable[periodoftime].Last_Time[i-1];
												}
											}
											for(j=0; j<6; j++){
												my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][phasenum+1] = 0xFC00;
												//my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i] = 0xFC00;
											}
											my_Schedule.PhaseTable[periodoftime].Last_Time[phasenum+1] = 0;
											//my_Schedule.PhaseTable[periodoftime].Last_Time[i] = 0;
										}
										else{  //options == 0  向上插入相位模式
											for(i=i=my_Schedule.PhaseTable[periodoftime].Phase_Number; i>phasenum; i--){
												for(j=0; j<6; j++){
													my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i] = my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i-1];
												}
												my_Schedule.PhaseTable[periodoftime].Last_Time[i] = my_Schedule.PhaseTable[periodoftime].Last_Time[i-1];
											}	
											for(j=0; j<6; j++){
												my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][phasenum] = 0xFC00;
												//my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i] = 0xFC00;
											}
											my_Schedule.PhaseTable[periodoftime].Last_Time[phasenum] = 0;
											//my_Schedule.PhaseTable[periodoftime].Last_Time[i] = 0;
										}
										my_Schedule.PhaseTable[periodoftime].Phase_Number ++;
										
										RTC_WaitForLastTask();
										RTC_ITConfig(RTC_IT_SEC, ENABLE);

LCD_FLAG_Using = 1;

										LCD_ClearItemText();
										LCD_SetAppwindow(0, 239, 0, 39);
										LCD_WriteText2(8, 150, "相位添加成功");										

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
										delay_us(10000);
										Menu_Init_Finished = 0;
									}
								}
								break;
							}
				case KEY5:	KEY_FLAG_Return = 1;  break;
			}

			KEY_PressMinus();

			if(KEY_FLAG_Return == 1){
				LCD_DisplayOtherMenu(Current_Menu);
				return;
			}

LCD_FLAG_Using = 1;

			Add_PhaseInfo_Update(periodoftime, phasenum, sel, options);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
		}
	}
}
#endif
#if MOVE
void Delete_PeriodOfTime_Update(struct ShortTime start_time, struct ShortTime end_time, uint8_t sel, uint8_t periodoftime)
{
	uint8_t i;

	for(i=0; i<2; i++){
		if(i == sel) LCD_Inv();
		switch(i){
			case 0:	LCD_SetCursor(18, 100); LCD_WriteChar1(Number_Table[(periodoftime+1)/10]); LCD_WriteChar1(Number_Table[(periodoftime+1)%10]); break;
			case 1: LCD_WriteText2(16, 160, "删除");
			default: break;
		}
		if(i == sel) LCD_NoInv();
	}

	LCD_SetCursor(13, 120);
	LCD_WriteChar1((start_time.hour<10)?' ':Number_Table[start_time.hour/10]);
	LCD_WriteChar1(Number_Table[start_time.hour%10]);
	LCD_WriteChar1('-');
	LCD_WriteChar1((start_time.min<10)?' ':Number_Table[start_time.min/10]);
	LCD_WriteChar1(Number_Table[start_time.min%10]);
	LCD_WriteChar1('-');
	LCD_WriteChar1((start_time.sec<10)?' ':Number_Table[start_time.sec/10]);
	LCD_WriteChar1(Number_Table[start_time.sec%10]);

	LCD_SetCursor(13, 140);
	LCD_WriteChar1((end_time.hour<10)?' ':Number_Table[end_time.hour/10]);
	LCD_WriteChar1(Number_Table[end_time.hour%10]);
	LCD_WriteChar1('-');
	LCD_WriteChar1((end_time.min<10)?' ':Number_Table[end_time.min/10]);
	LCD_WriteChar1(Number_Table[end_time.min%10]);
	LCD_WriteChar1('-');
	LCD_WriteChar1((end_time.sec<10)?' ':Number_Table[end_time.sec/10]);
	LCD_WriteChar1(Number_Table[end_time.sec%10]);
}

void Delete_PeriodOfTime(void)
{
	uint8_t KEY_FLAG_Return;
	uint8_t sel;
	uint8_t periodoftime;
	uint8_t Menu_Init_Finished;
	ShortTime_TypeDef start_time, end_time;
	//uint8_t Display_FLAG_NextDay;
	uint8_t i;

	KEY_FLAG_Return = 0;
	//Display_FLAG_NextDay = 0;
	sel = 0;   //这里只选择时段号与删除键
	periodoftime = 0;
	Menu_Init_Finished = 0;
	start_time = my_Schedule.TimeTable[0];
	if(my_Schedule.TimeTable_Number == 1){
		end_time = my_Schedule.TimeTable[0];
		//Display_FLAG_NextDay = 1;
	}
	else
		end_time = my_Schedule.TimeTable[1];

	while(1){
		if(Menu_Init_Finished == 0){

LCD_FLAG_Using = 1;
		
			LCD_ClearItemAllText();

			LCD_SetAppwindow(96, 170, 29, 38);
			LCD_WriteText2(29, 96, "删除所选的时段");
			
			LCD_SetAppwindow(0, 239, 0, 39); 
			
			LCD_WriteText2(2, 80, "请选择要删除的时段");
			LCD_WriteText2(8, 100, "选择时段【  】");
			LCD_WriteText2(4, 120, "起始时间:");
			LCD_WriteText2(4, 140, "终止时间:");
			LCD_WriteText2(14, 160, "【    】");
		
			LCD_WriteText2(29, 176, "\x1A\x1B:移动");
			LCD_WriteText2(29, 196, "\x18\x19:选择");
			
			Delete_PeriodOfTime_Update(start_time, end_time, sel, periodoftime);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
			Menu_Init_Finished = 1;
		}

