xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
		if(KEY_Press > 0){
			switch (KEY_Buffer[KEY_BufferPointer]){
				case KEY6:  if(sel==0) sel=1; else sel=0; break;
				case KEY1:  if(sel==1) sel=0; else sel=1; break;
				case KEY2:	{
								if(sel == 0){
									if(periodoftime<my_Schedule.TimeTable_Number-1){
										//Display_FLAG_NextDay = 0; 
										periodoftime++;
										start_time = my_Schedule.TimeTable[periodoftime];
										if(periodoftime == my_Schedule.TimeTable_Number-1){
											end_time = my_Schedule.TimeTable[0];
											//Display_FLAG_NextDay = 1;
										}
										else{
											end_time = my_Schedule.TimeTable[periodoftime+1]; 
										}
									}
								}
								break;
							}
				case KEY3:	{
								if(sel == 0){
									if(periodoftime>0){ 
										periodoftime --;
										start_time = my_Schedule.TimeTable[periodoftime];
										end_time = my_Schedule.TimeTable[periodoftime+1];
									} 
								}
								break;
							}
				case KEY4:  {							
								if(my_Schedule.TimeTable_Number >1){
									RTC_WaitForLastTask();
									RTC_ITConfig(RTC_IT_SEC, DISABLE);								
	
									while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);
									
									for(i=periodoftime; i<my_Schedule.TimeTable_Number-2; i++){
										my_Schedule.TimeTable[i] = my_Schedule.TimeTable[i+1];
										my_Schedule.PhaseTable[i] = my_Schedule.PhaseTable[i+1];
									}
									my_Schedule.TimeTable_Number --;
	
									if(periodoftime>0)
										periodoftime --;
	
									start_time = my_Schedule.TimeTable[periodoftime];
									if(periodoftime == my_Schedule.TimeTable_Number-1){
										end_time = my_Schedule.TimeTable[0];
										//Display_FLAG_NextDay = 1;
									}
									else{
										end_time = my_Schedule.TimeTable[periodoftime+1]; 
									}
	
									RTC_WaitForLastTask();
									RTC_ITConfig(RTC_IT_SEC, ENABLE);

LCD_FLAG_Using = 1;

									LCD_ClearItemText();
									LCD_SetAppwindow(0, 239, 0, 39);
									LCD_WriteText2(9, 150, "删除时段成功");										

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}

									delay_us(10000);
									Menu_Init_Finished = 0;
								}
								break;
							}
				case KEY5:	KEY_FLAG_Return = 1;  break;
			}

			KEY_PressMinus();

			if(KEY_FLAG_Return == 1){
				LCD_DisplayOtherMenu(Current_Menu);
				return;
			}

LCD_FLAG_Using = 1;

			Delete_PeriodOfTime_Update(start_time, end_time, sel, periodoftime);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
		}
	}
}
#endif
#if MOVE
void Set_PeriodOfTime_Update(uint8_t sel, uint8_t periodoftime, struct ShortTime time)
{
	uint8_t i;

	for(i=0; i<4; i++){
		if(i == sel){
			LCD_Inv();
		}
		LCD_SetCursor(Func_SetPeriodOfTime_Place[i][0], Func_SetPeriodOfTime_Place[i][1]);
		switch (i){
			case 0:	LCD_WriteChar1(Number_Table[(periodoftime+1)/10]); LCD_WriteChar1(Number_Table[(periodoftime+1)%10]); break;
			case 1:	LCD_WriteChar1(Number_Table[time.hour/10]); LCD_WriteChar1(Number_Table[time.hour%10]); break;
			case 2: LCD_WriteChar1(Number_Table[time.min/10]); LCD_WriteChar1(Number_Table[time.min%10]); break;
			case 3:	LCD_WriteChar1(Number_Table[time.sec/10]); LCD_WriteChar1(Number_Table[time.sec%10]); break;
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
}

void Set_PeriodOfTime(void)
{
	uint8_t KEY_FLAG_Return;
	uint8_t sel;
	uint8_t periodoftime;
	uint8_t Menu_Init_Finished;
	ShortTime_TypeDef temptime;

	KEY_FLAG_Return = 0;
	sel = 0;
	periodoftime = 0;
	Menu_Init_Finished = 0;
	temptime = my_Schedule.TimeTable[periodoftime];

	while(1){
		if(Menu_Init_Finished == 0){

LCD_FLAG_Using = 1;
		
			LCD_ClearItemAllText();

			LCD_SetAppwindow(96, 170, 29, 38);
			LCD_WriteText2(29, 96, "设置时段时间");
			
			LCD_SetAppwindow(0, 239, 0, 39); 
			
			LCD_WriteText2(2, 80, "请设置所选时段的时间");
			LCD_WriteText2(8, 100, "选择时段【  】");
			LCD_WriteText2(2, 120, "时段时间:  -  -  ");
		
			LCD_WriteText2(29, 176, "\x1A\x1B:移动");
			LCD_WriteText2(29, 196, "\x18\x19:选择");
			
			Set_PeriodOfTime_Update(sel, periodoftime, temptime);
		
LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
			Menu_Init_Finished = 1;
		}

		if(KEY_Press > 0){
			switch (KEY_Buffer[KEY_BufferPointer]){
				case KEY6:  if(sel==0) sel=3; else sel--; break;
				case KEY1:  if(sel==3) sel=0; else sel++; break;
				case KEY2:	{
								switch (sel){
									case 0: {
												if(periodoftime<my_Schedule.TimeTable_Number-1){ 
													periodoftime++;
													temptime = my_Schedule.TimeTable[periodoftime]; 
												}
												break;
											}
									case 1: {
												if(periodoftime<my_Schedule.TimeTable_Number-1){ 
													if(temptime.hour<my_Schedule.TimeTable[periodoftime+1].hour-1){ 
														temptime.hour ++;
													}
													else if(temptime.min<=my_Schedule.TimeTable[periodoftime+1].min && temptime.sec<=my_Schedule.TimeTable[periodoftime+1].sec){
														temptime.hour ++;
													}	
												}
												else{
													if(temptime.hour<23)
														temptime.hour ++;
												}
												break;
											}
									case 2: {
												if(periodoftime<my_Schedule.TimeTable_Number-1 && temptime.hour==my_Schedule.TimeTable[periodoftime+1].hour){
													if(temptime.min<my_Schedule.TimeTable[periodoftime+1].min){
														temptime.min ++;
													}
												}
												else{
													if(temptime.min<59)
														temptime.min ++;
												}
												break;
											}
									case 3: {
												if(periodoftime<my_Schedule.TimeTable_Number-1 && temptime.hour==my_Schedule.TimeTable[periodoftime+1].hour && temptime.min==my_Schedule.TimeTable[periodoftime+1].min){
													if(temptime.sec<my_Schedule.TimeTable[periodoftime+1].sec-1){
														temptime.sec ++;
													}
												}
												else{
													if(temptime.sec<59)
														temptime.sec ++;
												}
												break;
											}
									default: break;
								}
								break;
							}
				case KEY3:	{
								switch (sel){
									case 0: {
												if(periodoftime>0){ 
													periodoftime --;
													temptime = my_Schedule.TimeTable[periodoftime];
												} 
												break;
											}
									case 1: {
												if(periodoftime>0){
													if(temptime.hour>my_Schedule.TimeTable[periodoftime-1].hour+1){
														temptime.hour --;
													}
													else if(temptime.min>=my_Schedule.TimeTable[periodoftime-1].min && temptime.sec>my_Schedule.TimeTable[periodoftime-1].sec+1){
														temptime.hour --;
													}
												}
												else{
													if(temptime.hour>0) 
														temptime.hour --;
												}
												break;
											}
									case 2: {
												if(periodoftime>0 && temptime.hour==my_Schedule.TimeTable[periodoftime-1].hour){
													if(temptime.min>my_Schedule.TimeTable[periodoftime-1].min)
														temptime.min --;
												}
												else{
													if(temptime.min>0)
														temptime.min --;
												} 
												break;
											}
									case 3: {
												if(periodoftime>0 && temptime.hour==my_Schedule.TimeTable[periodoftime-1].hour && temptime.min==my_Schedule.TimeTable[periodoftime-1].min){
													if(temptime.sec>my_Schedule.TimeTable[periodoftime-1].sec+1)
														temptime.sec --;
												}
												else{
													if(temptime.sec>0)
														temptime.sec --;
												} 
												break;
											}
									default: break;
								}
								break;
							}
				case KEY4:  {							
								RTC_WaitForLastTask();
								RTC_ITConfig(RTC_IT_SEC, DISABLE);
								
								while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);

