xhyzjiji/TSC_base_on_STM32/TSC V400 Debug/MDK/RA8806_CTRL.c
								my_Schedule.TimeTable[periodoftime] = temptime;

								RTC_WaitForLastTask();
								RTC_ITConfig(RTC_IT_SEC, ENABLE);

LCD_FLAG_Using = 1;

								LCD_ClearItemText();
								LCD_SetAppwindow(0, 239, 0, 39);
								LCD_WriteText2(9, 150, "修改时段成功");										

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
								delay_us(10000);
								Menu_Init_Finished = 0;

								break;
							}
				case KEY5:	KEY_FLAG_Return = 1;  break;
			}

			KEY_PressMinus();

			if(KEY_FLAG_Return == 1){
				LCD_DisplayOtherMenu(Current_Menu);
				return;
			}

LCD_FLAG_Using = 1;

			Set_PeriodOfTime_Update(sel, periodoftime, temptime);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
		}
	}
}
#endif
#if MOVE
void Delete_Phase(void)
{
	uint8_t KEY_FLAG_Return;
	uint8_t Menu_Init_Finished;
	uint8_t crossway;
	uint8_t sel;  //只对crossway periodoftime phasenum进行修改，还有删除确认键
	uint8_t periodoftime, phasenum;
	uint16_t phase;  //不允许修改，只用于观察用
	uint8_t cutdown;
	uint8_t i, j;

	KEY_FLAG_Return = 0;
	Menu_Init_Finished = 0;
	crossway = 0;
	sel = 0;
	periodoftime = 0;
	phasenum = 0;
	phase = my_Schedule.PhaseTable[periodoftime].Crossway_LED[crossway][phasenum];
	cutdown = my_Schedule.PhaseTable[periodoftime].Last_Time[phasenum];

	while(1){
		if(Menu_Init_Finished == 0){
LCD_FLAG_Using = 1;

			LCD_ClearItemAllText();
			
			LCD_SetAppwindow(0, 239, 0, 39);
			
			LCD_WriteText2(2, 80, "\x11      \x10 (×:表示该灯不亮)" );
			LCD_WriteText2(2, 98, "时段【  】 相位【  】");
			LCD_WriteText2(2, 126, "左转 [  ] 直行 [  ]");
			LCD_WriteText2(2, 146, "右转 [  ] 调头 [  ]");
			LCD_WriteText2(2, 166, "人行1[  ] 人行2[  ]");
			LCD_WriteText2(2, 186, "相位运行时间:  秒");
			LCD_WriteText2(10, 206, "【删除】");
			
			LCD_SetAppwindow(96, 170, 29, 38);
			LCD_WriteText2(29, 96, "删除操作将删除所有灯组的选定时段的相位");
			
			LCD_SetAppwindow(0, 239, 0, 39); 
		
			LCD_WriteText2(29, 176, "\x1A\x1B:移动");
			LCD_WriteText2(29, 196, "\x18\x19:选择");
			
			Delete_PhaseInfo_Update(sel, crossway, periodoftime, phasenum, phase, cutdown);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
			
			Menu_Init_Finished = 1;	
		}

		if(KEY_Press > 0){
			switch (KEY_Buffer[KEY_BufferPointer]){
				case KEY6:  if(sel==0) sel=3; else sel--; break;
				case KEY1:  if(sel==3) sel=0; else sel++; break;
				case KEY2:	{
								switch(sel){
									case 0: if(crossway < 5) crossway ++; else crossway = 0; break;
									case 1: if(periodoftime < my_Schedule.TimeTable_Number-1) periodoftime ++; else periodoftime = 0; phasenum=0; break;
									case 2: if(phasenum < my_Schedule.PhaseTable[periodoftime].Phase_Number-1) phasenum ++; else phasenum = 0; break;
									default: break;
								}
								phase = my_Schedule.PhaseTable[periodoftime].Crossway_LED[crossway][phasenum];
								cutdown = my_Schedule.PhaseTable[periodoftime].Last_Time[phasenum];
								break;
							}
				case KEY3:	{
								switch(sel){
									case 0: if(crossway > 0) crossway --; else crossway = 5; break;
									case 1: if(periodoftime > 0) periodoftime --; else periodoftime = my_Schedule.TimeTable_Number-1; phasenum=0;break;
									case 2: if(phasenum > 0) phasenum --; else phasenum = my_Schedule.PhaseTable[periodoftime].Phase_Number-1; break;
									default: break;
								}
								phase = my_Schedule.PhaseTable[periodoftime].Crossway_LED[crossway][phasenum];
								cutdown = my_Schedule.PhaseTable[periodoftime].Last_Time[phasenum];
								break;
							}
				case KEY4:  {
								if(sel == 3){
									if(my_Schedule.PhaseTable[periodoftime].Phase_Number > 1){
										RTC_WaitForLastTask();
										RTC_ITConfig(RTC_IT_SEC, DISABLE);

										while(Current_CutDown==0 && Current_PhaseTable==Phase_OneShot.Phase_Number-1);

										for(j=0; j<6; j++){	 //j:crossway
											for(i=phasenum; i<my_Schedule.PhaseTable[periodoftime].Phase_Number-1; i++){
												my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i] = my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][i+1];
											} 
										}
										for(i=phasenum; i<my_Schedule.PhaseTable[periodoftime].Phase_Number-1; i++){
											my_Schedule.PhaseTable[periodoftime].Last_Time[i] = my_Schedule.PhaseTable[periodoftime].Last_Time[i+1];;
										}
										for(j=0; j<6; j++){
											my_Schedule.PhaseTable[periodoftime].Crossway_LED[j][my_Schedule.PhaseTable[periodoftime].Phase_Number-1] = 0xFC00;
										}
										my_Schedule.PhaseTable[periodoftime].Last_Time[my_Schedule.PhaseTable[periodoftime].Phase_Number-1] = 0;
										my_Schedule.PhaseTable[periodoftime].Phase_Number -= 1;
										
										RTC_WaitForLastTask();
										RTC_ITConfig(RTC_IT_SEC, ENABLE);

										phasenum = my_Schedule.PhaseTable[periodoftime].Phase_Number-1;

LCD_FLAG_Using = 1;

										LCD_ClearItemText();
										LCD_SetAppwindow(0, 239, 0, 39);
										LCD_WriteText2(8, 150, "删除相位成功");										
				
LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
										delay_us(10000);
										Menu_Init_Finished = 0;
									}
								}
								break;
							}
				case KEY5:	KEY_FLAG_Return = 1;  break;
			}

			KEY_PressMinus();

			if(KEY_FLAG_Return == 1){
				LCD_DisplayOtherMenu(Current_Menu);
				return;
			}

LCD_FLAG_Using = 1;

			Delete_PhaseInfo_Update(sel, crossway, periodoftime, phasenum, phase, cutdown);

LCD_FLAG_Using = 0;
if(LCD_FLAG_UpdateIrq == 1){
	EXTI_GenerateSWInterrupt(EXTI_Line1);
}
		}
	}
}
#endif


#if MOVE
void Delete_PhaseInfo_Update(uint8_t sel, uint8_t crossway, uint8_t PeriodOfTimeNum, uint8_t PhaseNum, uint16_t phase, uint8_t cutdown){
	uint8_t i;

	for(i=0; i<4; i++){
		if(i == sel){
			LCD_Inv();
		}
		switch (i){
			case 0: {
						LCD_WriteText2(3, 80, "灯组");
						LCD_WriteText1((uint8_t*)Weekday_Table[crossway+1]);
						break;
					}
			case 1: {
						LCD_WriteChar2(8, 98, Number_Table[(PeriodOfTimeNum+1)/10]);
						LCD_WriteChar1(Number_Table[(PeriodOfTimeNum+1)%10]);
						break;
					}
			case 2: {
						LCD_WriteChar2(19, 98, Number_Table[(PhaseNum+1)/10]);
						LCD_WriteChar1(Number_Table[(PhaseNum+1)%10]);
						break;
					}
			case 3: {
						LCD_WriteText2(12, 206, "删除");
						break;
					}
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
	for(i=0; i<7; i++){
		LCD_SetCursor(Func_PhaseInfo_Place[i][0], Func_PhaseInfo_Place[i][1]);
		switch (i){
			case 0: {
						if((phase&LeftGreen) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[0]);
						}
						else if((phase&LeftRed) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[1]);
						}
						else if((phase&LeftYellow) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[2]);
						}
						else{
							LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
						}
						break;
					}
			case 1: {
						if((phase&StraightGreen) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[0]);
						}
						else if((phase&StraightRed) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[1]);
						}
						else if((phase&StraightYellow) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[2]);
						}
						else{
							LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
						}
						break;
					}
			case 2: {
						if((phase&RightGreen) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[0]);
						}
						else if((phase&RightRed) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[1]);
						}
						else if((phase&RightYellow) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[2]);
						}
						else{
							LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
						}
						break;
					}
			case 3: {
						if((phase&BackGreen) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[0]);
						}
						else if((phase&BackRed) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[1]);
						}
						else if((phase&BackYellow) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[2]);
						}
						else{
							LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
						}
						break;
					}
			case 4: {
						if((phase&SideWalk1Green) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[0]);
						}
						else if((phase&SideWalk1Red) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[1]);
						}
						else{
							LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
						}
						break;
					}
			case 5: {
						if((phase&SideWalk2Green) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[0]);
						}
						else if((phase&SideWalk2Red) != 0x00){
							LCD_WriteText1((uint8_t*)LedColor_Table[1]);
						}
						else{
							LCD_WriteText1((uint8_t*)Tick_Cross_Table[0]);
						}
						break;
					}
			case 6: {
						LCD_WriteChar1(Number_Table[cutdown/10]);
						LCD_WriteChar1(Number_Table[cutdown%10]);
						break;
					}
			default: break;
		}
	}
}

void Add_PhaseInfo_Update(uint8_t periodoftime, uint8_t phasenum, uint8_t sel, uint8_t options){
	uint8_t i;

	for(i=0; i<4; i++){
		if(i == sel)
		{
			LCD_Inv();
		}
		LCD_SetCursor(Func_AddPhase_Place[i][0], Func_AddPhase_Place[i][1]);
		switch (i){
			case 0:	LCD_WriteChar1(Number_Table[(periodoftime+1)/10]); LCD_WriteChar1(Number_Table[(periodoftime+1)%10]); break;
			case 1:	LCD_WriteChar1(Number_Table[(phasenum+1)/10]); LCD_WriteChar1(Number_Table[(phasenum+1)%10]); break;
			case 2:	if(options == 0) LCD_WriteText1("向上插入"); else LCD_WriteText1("向下插入");	break;
			case 3:	LCD_WriteText1("生成相位");	break;
			default: break;
		}
		if(i == sel){
			LCD_NoInv();
		}
	}
}
#endif
